#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Apartment_single_modular

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Apartment_single_modular.Apartment_single_modular_C.updateBuilding
// 0x0320 (0x0320 - 0x0000)
struct Apartment_single_modular_C_UpdateBuilding final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25B3[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_2;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25B4[0x8];                                     // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25B5[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25B6[0x8];                                     // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0080(0x0030)(IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue_1;               // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue_2;               // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue_3;               // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25B7[0x4];                                     // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMesh*>                    K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25B8[0x6];                                     // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMesh*>                    K2Node_MakeArray_Array_1;                          // 0x00F0(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25B9[0x3];                                     // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CallFunc_Array_Get_Item;                           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25BA[0x3];                                     // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25BB[0x8];                                     // 0x0118(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x0120(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25BC[0x4];                                     // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UChildActorComponent*                   CallFunc_AddComponent_ReturnValue_4;               // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25BD[0x4];                                     // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAps_StreetProp_base_C*                 K2Node_DynamicCast_AsAps_Street_Prop_Base;         // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25BE[0x3];                                     // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25BF[0x3];                                     // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25C0[0xF];                                     // 0x0181(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0190(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UChildActorComponent*                   CallFunc_AddComponent_ReturnValue_5;               // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C1[0x4];                                     // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAps_SignProp_base_C*                   K2Node_DynamicCast_AsAps_Sign_Prop_Base;           // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25C2[0x3];                                     // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_3;          // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x01E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C3[0x4];                                     // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_3;              // 0x01F0(0x0030)(IsPlainOldData, NoDestructor)
	class UChildActorComponent*                   CallFunc_AddComponent_ReturnValue_6;               // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAps_Roofprop_base_C*                   K2Node_DynamicCast_AsAps_Roofprop_Base;            // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidClass_ReturnValue_1;               // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25C4[0x2];                                     // 0x0232(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_2;              // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25C5[0x3];                                     // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_4;          // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25C6[0x3];                                     // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x0248(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C7[0xC];                                     // 0x0254(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_4;              // 0x0260(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25C8[0x7];                                     // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue_7;               // 0x0298(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C9[0x4];                                     // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CallFunc_Array_Random_OutItem;                     // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25CA[0x4];                                     // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_Array_Get_Item_1;                         // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_3;              // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x02C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25CB[0x1];                                     // 0x02C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_4;              // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25CC[0x3];                                     // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_5;          // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_4;                 // 0x02D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25CD[0x3];                                     // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_5;              // 0x02E0(0x0030)(IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue_8;               // 0x0310(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_5;              // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_6;              // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Apartment_single_modular_C_UpdateBuilding) == 0x000010, "Wrong alignment on Apartment_single_modular_C_UpdateBuilding");
static_assert(sizeof(Apartment_single_modular_C_UpdateBuilding) == 0x000320, "Wrong size on Apartment_single_modular_C_UpdateBuilding");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, Temp_int_Variable) == 0x000000, "Member 'Apartment_single_modular_C_UpdateBuilding::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000004, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, Temp_int_Variable_1) == 0x00000C, "Member 'Apartment_single_modular_C_UpdateBuilding::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000010, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x000014, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_MakeVector_ReturnValue) == 0x000018, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_Multiply_IntFloat_ReturnValue_2) == 0x000024, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_Multiply_IntFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_MakeTransform_ReturnValue) == 0x000030, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_MakeVector_ReturnValue_1) == 0x000060, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_AddComponent_ReturnValue) == 0x000070, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_MakeTransform_ReturnValue_1) == 0x000080, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_AddComponent_ReturnValue_1) == 0x0000B0, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_AddComponent_ReturnValue_2) == 0x0000B8, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_AddComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_AddComponent_ReturnValue_3) == 0x0000C0, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_AddComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000C8, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, Temp_int_Loop_Counter_Variable) == 0x0000CC, "Member 'Apartment_single_modular_C_UpdateBuilding::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000D0, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, K2Node_MakeArray_Array) == 0x0000D8, "Member 'Apartment_single_modular_C_UpdateBuilding::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_IsValidClass_ReturnValue) == 0x0000E8, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_SetStaticMesh_ReturnValue) == 0x0000E9, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, K2Node_MakeArray_Array_1) == 0x0000F0, "Member 'Apartment_single_modular_C_UpdateBuilding::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_Array_Find_ReturnValue) == 0x000100, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_Array_Contains_ReturnValue) == 0x000104, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_Array_Get_Item) == 0x000108, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_SetStaticMesh_ReturnValue_1) == 0x000110, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, Temp_int_Variable_2) == 0x000114, "Member 'Apartment_single_modular_C_UpdateBuilding::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_MakeTransform_ReturnValue_2) == 0x000120, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_MakeTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_Subtract_IntInt_ReturnValue) == 0x000150, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_AddComponent_ReturnValue_4) == 0x000158, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_AddComponent_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_Add_IntInt_ReturnValue_3) == 0x000160, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, K2Node_DynamicCast_AsAps_Street_Prop_Base) == 0x000168, "Member 'Apartment_single_modular_C_UpdateBuilding::K2Node_DynamicCast_AsAps_Street_Prop_Base' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, K2Node_DynamicCast_bSuccess) == 0x000170, "Member 'Apartment_single_modular_C_UpdateBuilding::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_Array_Length_ReturnValue) == 0x000174, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_Less_IntInt_ReturnValue) == 0x000178, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_Array_Length_ReturnValue_1) == 0x00017C, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_Greater_IntInt_ReturnValue) == 0x000180, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, Temp_struct_Variable) == 0x000190, "Member 'Apartment_single_modular_C_UpdateBuilding::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_AddComponent_ReturnValue_5) == 0x0001C0, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_AddComponent_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_Add_IntInt_ReturnValue_4) == 0x0001C8, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, K2Node_DynamicCast_AsAps_Sign_Prop_Base) == 0x0001D0, "Member 'Apartment_single_modular_C_UpdateBuilding::K2Node_DynamicCast_AsAps_Sign_Prop_Base' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, K2Node_DynamicCast_bSuccess_1) == 0x0001D8, "Member 'Apartment_single_modular_C_UpdateBuilding::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_Multiply_IntFloat_ReturnValue_3) == 0x0001DC, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_Multiply_IntFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_MakeVector_ReturnValue_2) == 0x0001E0, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_MakeTransform_ReturnValue_3) == 0x0001F0, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_MakeTransform_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_AddComponent_ReturnValue_6) == 0x000220, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_AddComponent_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, K2Node_DynamicCast_AsAps_Roofprop_Base) == 0x000228, "Member 'Apartment_single_modular_C_UpdateBuilding::K2Node_DynamicCast_AsAps_Roofprop_Base' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, K2Node_DynamicCast_bSuccess_2) == 0x000230, "Member 'Apartment_single_modular_C_UpdateBuilding::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_IsValidClass_ReturnValue_1) == 0x000231, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_IsValidClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_Add_FloatFloat_ReturnValue) == 0x000234, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_SetStaticMesh_ReturnValue_2) == 0x000238, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_SetStaticMesh_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_Multiply_IntFloat_ReturnValue_4) == 0x00023C, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_Multiply_IntFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000240, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000244, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_MakeVector_ReturnValue_3) == 0x000248, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_MakeVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_MakeTransform_ReturnValue_4) == 0x000260, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_MakeTransform_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000290, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_AddComponent_ReturnValue_7) == 0x000298, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_AddComponent_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, Temp_int_Array_Index_Variable) == 0x0002A0, "Member 'Apartment_single_modular_C_UpdateBuilding::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_Array_Random_OutItem) == 0x0002A8, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_Array_Random_OutIndex) == 0x0002B0, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_Array_Get_Item_1) == 0x0002B8, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_SetStaticMesh_ReturnValue_3) == 0x0002C0, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_SetStaticMesh_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0002C1, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0002C2, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_Add_IntInt_ReturnValue_5) == 0x0002C4, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_SetStaticMesh_ReturnValue_4) == 0x0002C8, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_SetStaticMesh_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_Multiply_IntFloat_ReturnValue_5) == 0x0002CC, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_Multiply_IntFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_MakeVector_ReturnValue_4) == 0x0002D0, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_MakeVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x0002DC, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_MakeTransform_ReturnValue_5) == 0x0002E0, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_MakeTransform_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_AddComponent_ReturnValue_8) == 0x000310, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_AddComponent_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_SetStaticMesh_ReturnValue_5) == 0x000318, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_SetStaticMesh_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_UpdateBuilding, CallFunc_SetStaticMesh_ReturnValue_6) == 0x000319, "Member 'Apartment_single_modular_C_UpdateBuilding::CallFunc_SetStaticMesh_ReturnValue_6' has a wrong offset!");

// Function Apartment_single_modular.Apartment_single_modular_C.Randomize
// 0x0110 (0x0110 - 0x0000)
struct Apartment_single_modular_C_Randomize final
{
public:
	TArray<class UClass*>                         K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ConstParm, ReferenceParm)
	class UClass*                                 CallFunc_Array_Random_OutItem;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBool_ReturnValue;                   // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25CE[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMesh*>                    K2Node_MakeArray_Array_1;                          // 0x0020(0x0010)(ConstParm, ReferenceParm)
	TArray<class UClass*>                         K2Node_MakeArray_Array_2;                          // 0x0030(0x0010)(ConstParm, ReferenceParm)
	class UClass*                                 CallFunc_Array_Random_OutItem_1;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex_1;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25CF[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         K2Node_MakeArray_Array_3;                          // 0x0058(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Variable;                                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25D0[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_Array_Random_OutItem_2;                   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex_2;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25D1[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25D2[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMesh*>                    K2Node_MakeArray_Array_4;                          // 0x0088(0x0010)(ConstParm, ReferenceParm)
	TArray<class UStaticMesh*>                    K2Node_MakeArray_Array_5;                          // 0x0098(0x0010)(ConstParm, ReferenceParm)
	class UStaticMesh*                            CallFunc_Array_Random_OutItem_3;                   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex_3;                  // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25D3[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CallFunc_Array_Random_OutItem_4;                   // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex_4;                  // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25D4[0x4];                                     // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMesh*>                    K2Node_MakeArray_Array_6;                          // 0x00C8(0x0010)(ConstParm, ReferenceParm)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25D5[0x4];                                     // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CallFunc_Array_Random_OutItem_5;                   // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex_5;                  // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBool_ReturnValue_1;                 // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25D6[0x3];                                     // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             K2Node_MakeArray_Array_7;                          // 0x00F0(0x0010)(ConstParm, ReferenceParm)
	class UMaterialInterface*                     CallFunc_Array_Random_OutItem_6;                   // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex_6;                  // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue_1;       // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Apartment_single_modular_C_Randomize) == 0x000008, "Wrong alignment on Apartment_single_modular_C_Randomize");
static_assert(sizeof(Apartment_single_modular_C_Randomize) == 0x000110, "Wrong size on Apartment_single_modular_C_Randomize");
static_assert(offsetof(Apartment_single_modular_C_Randomize, K2Node_MakeArray_Array) == 0x000000, "Member 'Apartment_single_modular_C_Randomize::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_Randomize, CallFunc_Array_Random_OutItem) == 0x000010, "Member 'Apartment_single_modular_C_Randomize::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(Apartment_single_modular_C_Randomize, CallFunc_Array_Random_OutIndex) == 0x000018, "Member 'Apartment_single_modular_C_Randomize::CallFunc_Array_Random_OutIndex' has a wrong offset!");
