#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Aps_Roofprop_Terrace

#include "Basic.hpp"

#include "Aps_Roofprop_base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Aps_Roofprop_Terrace.Aps_Roofprop_Terrace_C
// 0x0028 (0x0258 - 0x0230)
class AAps_Roofprop_Terrace_C final : public AAps_Roofprop_base_C
{
public:
	class UStaticMeshComponent*                   StaticMesh4;                                       // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh3;                                       // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh2;                                       // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Aps_Roofprop_Terrace_C">();
	}
	static class AAps_Roofprop_Terrace_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAps_Roofprop_Terrace_C>();
	}
};
static_assert(alignof(AAps_Roofprop_Terrace_C) == 0x000008, "Wrong alignment on AAps_Roofprop_Terrace_C");
static_assert(sizeof(AAps_Roofprop_Terrace_C) == 0x000258, "Wrong size on AAps_Roofprop_Terrace_C");
static_assert(offsetof(AAps_Roofprop_Terrace_C, StaticMesh4) == 0x000230, "Member 'AAps_Roofprop_Terrace_C::StaticMesh4' has a wrong offset!");
static_assert(offsetof(AAps_Roofprop_Terrace_C, StaticMesh3) == 0x000238, "Member 'AAps_Roofprop_Terrace_C::StaticMesh3' has a wrong offset!");
static_assert(offsetof(AAps_Roofprop_Terrace_C, StaticMesh2) == 0x000240, "Member 'AAps_Roofprop_Terrace_C::StaticMesh2' has a wrong offset!");
static_assert(offsetof(AAps_Roofprop_Terrace_C, StaticMesh1) == 0x000248, "Member 'AAps_Roofprop_Terrace_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(AAps_Roofprop_Terrace_C, StaticMesh) == 0x000250, "Member 'AAps_Roofprop_Terrace_C::StaticMesh' has a wrong offset!");

}

