#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Attachment_Barrel_base

#include "Basic.hpp"

#include "AttachmentBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Attachment_Barrel_base.Attachment_Barrel_base_C
// 0x0010 (0x0260 - 0x0250)
class AAttachment_Barrel_base_C : public AAttachmentBase_C
{
public:
	class USoundBase*                             SoundReplacement;                                  // 0x0250(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HideMuzzleflash_;                                  // 0x0258(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Silence_;                                          // 0x0259(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Attachment_Barrel_base_C">();
	}
	static class AAttachment_Barrel_base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAttachment_Barrel_base_C>();
	}
};
static_assert(alignof(AAttachment_Barrel_base_C) == 0x000008, "Wrong alignment on AAttachment_Barrel_base_C");
static_assert(sizeof(AAttachment_Barrel_base_C) == 0x000260, "Wrong size on AAttachment_Barrel_base_C");
static_assert(offsetof(AAttachment_Barrel_base_C, SoundReplacement) == 0x000250, "Member 'AAttachment_Barrel_base_C::SoundReplacement' has a wrong offset!");
static_assert(offsetof(AAttachment_Barrel_base_C, HideMuzzleflash_) == 0x000258, "Member 'AAttachment_Barrel_base_C::HideMuzzleflash_' has a wrong offset!");
static_assert(offsetof(AAttachment_Barrel_base_C, Silence_) == 0x000259, "Member 'AAttachment_Barrel_base_C::Silence_' has a wrong offset!");

}

