#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Block_subway

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Block_subway.Block_subway_C
// 0x00E8 (0x0308 - 0x0220)
class ABlock_subway_C final : public AActor
{
public:
	class UStaticMeshComponent*                   StaticMesh27;                                      // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh26;                                      // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh25;                                      // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh24;                                      // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh23;                                      // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh22;                                      // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh21;                                      // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh20;                                      // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh19;                                      // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh18;                                      // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh17;                                      // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh16;                                      // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh11;                                      // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh15;                                      // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh14;                                      // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh13;                                      // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh12;                                      // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh10;                                      // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh9;                                       // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh8;                                       // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh7;                                       // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SidewalkLeft4;                                     // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SidewalkLeft3;                                     // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SidewalkLeft2;                                     // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh3;                                       // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh2;                                       // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SidewalkLeft1;                                     // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Block_subway_C">();
	}
	static class ABlock_subway_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABlock_subway_C>();
	}
};
static_assert(alignof(ABlock_subway_C) == 0x000008, "Wrong alignment on ABlock_subway_C");
static_assert(sizeof(ABlock_subway_C) == 0x000308, "Wrong size on ABlock_subway_C");
static_assert(offsetof(ABlock_subway_C, StaticMesh27) == 0x000220, "Member 'ABlock_subway_C::StaticMesh27' has a wrong offset!");
static_assert(offsetof(ABlock_subway_C, StaticMesh26) == 0x000228, "Member 'ABlock_subway_C::StaticMesh26' has a wrong offset!");
static_assert(offsetof(ABlock_subway_C, StaticMesh25) == 0x000230, "Member 'ABlock_subway_C::StaticMesh25' has a wrong offset!");
static_assert(offsetof(ABlock_subway_C, StaticMesh24) == 0x000238, "Member 'ABlock_subway_C::StaticMesh24' has a wrong offset!");
static_assert(offsetof(ABlock_subway_C, StaticMesh23) == 0x000240, "Member 'ABlock_subway_C::StaticMesh23' has a wrong offset!");
static_assert(offsetof(ABlock_subway_C, StaticMesh22) == 0x000248, "Member 'ABlock_subway_C::StaticMesh22' has a wrong offset!");
static_assert(offsetof(ABlock_subway_C, StaticMesh21) == 0x000250, "Member 'ABlock_subway_C::StaticMesh21' has a wrong offset!");
static_assert(offsetof(ABlock_subway_C, StaticMesh20) == 0x000258, "Member 'ABlock_subway_C::StaticMesh20' has a wrong offset!");
static_assert(offsetof(ABlock_subway_C, StaticMesh19) == 0x000260, "Member 'ABlock_subway_C::StaticMesh19' has a wrong offset!");
static_assert(offsetof(ABlock_subway_C, StaticMesh18) == 0x000268, "Member 'ABlock_subway_C::StaticMesh18' has a wrong offset!");
static_assert(offsetof(ABlock_subway_C, StaticMesh17) == 0x000270, "Member 'ABlock_subway_C::StaticMesh17' has a wrong offset!");
static_assert(offsetof(ABlock_subway_C, StaticMesh16) == 0x000278, "Member 'ABlock_subway_C::StaticMesh16' has a wrong offset!");
static_assert(offsetof(ABlock_subway_C, StaticMesh11) == 0x000280, "Member 'ABlock_subway_C::StaticMesh11' has a wrong offset!");
static_assert(offsetof(ABlock_subway_C, StaticMesh15) == 0x000288, "Member 'ABlock_subway_C::StaticMesh15' has a wrong offset!");
static_assert(offsetof(ABlock_subway_C, StaticMesh14) == 0x000290, "Member 'ABlock_subway_C::StaticMesh14' has a wrong offset!");
static_assert(offsetof(ABlock_subway_C, StaticMesh13) == 0x000298, "Member 'ABlock_subway_C::StaticMesh13' has a wrong offset!");
static_assert(offsetof(ABlock_subway_C, StaticMesh12) == 0x0002A0, "Member 'ABlock_subway_C::StaticMesh12' has a wrong offset!");
static_assert(offsetof(ABlock_subway_C, StaticMesh10) == 0x0002A8, "Member 'ABlock_subway_C::StaticMesh10' has a wrong offset!");
static_assert(offsetof(ABlock_subway_C, StaticMesh9) == 0x0002B0, "Member 'ABlock_subway_C::StaticMesh9' has a wrong offset!");
static_assert(offsetof(ABlock_subway_C, StaticMesh8) == 0x0002B8, "Member 'ABlock_subway_C::StaticMesh8' has a wrong offset!");
static_assert(offsetof(ABlock_subway_C, StaticMesh7) == 0x0002C0, "Member 'ABlock_subway_C::StaticMesh7' has a wrong offset!");
static_assert(offsetof(ABlock_subway_C, SidewalkLeft4) == 0x0002C8, "Member 'ABlock_subway_C::SidewalkLeft4' has a wrong offset!");
static_assert(offsetof(ABlock_subway_C, SidewalkLeft3) == 0x0002D0, "Member 'ABlock_subway_C::SidewalkLeft3' has a wrong offset!");
static_assert(offsetof(ABlock_subway_C, SidewalkLeft2) == 0x0002D8, "Member 'ABlock_subway_C::SidewalkLeft2' has a wrong offset!");
static_assert(offsetof(ABlock_subway_C, StaticMesh3) == 0x0002E0, "Member 'ABlock_subway_C::StaticMesh3' has a wrong offset!");
static_assert(offsetof(ABlock_subway_C, StaticMesh2) == 0x0002E8, "Member 'ABlock_subway_C::StaticMesh2' has a wrong offset!");
static_assert(offsetof(ABlock_subway_C, StaticMesh1) == 0x0002F0, "Member 'ABlock_subway_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(ABlock_subway_C, SidewalkLeft1) == 0x0002F8, "Member 'ABlock_subway_C::SidewalkLeft1' has a wrong offset!");
static_assert(offsetof(ABlock_subway_C, DefaultSceneRoot) == 0x000300, "Member 'ABlock_subway_C::DefaultSceneRoot' has a wrong offset!");

}

