#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CameraController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CameraController.CameraController_C
// 0x0050 (0x0270 - 0x0220)
class ACameraController_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UInteractComponent_C*                   InteractComponent;                                 // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh3;                                       // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneCaptureComponent2D*               SceneCaptureComponent2D2;                          // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh2;                                       // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneCaptureComponent2D*               SceneCaptureComponent2D1;                          // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneCaptureComponent2D*               SceneCaptureComponent2D;                           // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void SwitchCams();
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void BndEvt__CameraController_InteractComponent_K2Node_ComponentBoundEvent_0_Interact__DelegateSignature(class AActor* Player, class UPrimitiveComponent* HitComponent);
	void CamUpdate();
	void ExecuteUbergraph_CameraController(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CameraController_C">();
	}
	static class ACameraController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACameraController_C>();
	}
};
static_assert(alignof(ACameraController_C) == 0x000008, "Wrong alignment on ACameraController_C");
static_assert(sizeof(ACameraController_C) == 0x000270, "Wrong size on ACameraController_C");
static_assert(offsetof(ACameraController_C, UberGraphFrame) == 0x000220, "Member 'ACameraController_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ACameraController_C, InteractComponent) == 0x000228, "Member 'ACameraController_C::InteractComponent' has a wrong offset!");
static_assert(offsetof(ACameraController_C, StaticMesh3) == 0x000230, "Member 'ACameraController_C::StaticMesh3' has a wrong offset!");
static_assert(offsetof(ACameraController_C, SceneCaptureComponent2D2) == 0x000238, "Member 'ACameraController_C::SceneCaptureComponent2D2' has a wrong offset!");
static_assert(offsetof(ACameraController_C, StaticMesh2) == 0x000240, "Member 'ACameraController_C::StaticMesh2' has a wrong offset!");
static_assert(offsetof(ACameraController_C, SceneCaptureComponent2D1) == 0x000248, "Member 'ACameraController_C::SceneCaptureComponent2D1' has a wrong offset!");
static_assert(offsetof(ACameraController_C, StaticMesh1) == 0x000250, "Member 'ACameraController_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(ACameraController_C, SceneCaptureComponent2D) == 0x000258, "Member 'ACameraController_C::SceneCaptureComponent2D' has a wrong offset!");
static_assert(offsetof(ACameraController_C, StaticMesh) == 0x000260, "Member 'ACameraController_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ACameraController_C, DefaultSceneRoot) == 0x000268, "Member 'ACameraController_C::DefaultSceneRoot' has a wrong offset!");

}

