#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DamageComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function DamageComponent.DamageComponent_C.Damage__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct DamageComponent_C_Damage__DelegateSignature final
{
public:
	int32                                         Amount;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Bone;                                              // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StartLocation;                                     // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Instigator;                                        // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DamageComponent_C_Damage__DelegateSignature) == 0x000008, "Wrong alignment on DamageComponent_C_Damage__DelegateSignature");
static_assert(sizeof(DamageComponent_C_Damage__DelegateSignature) == 0x000030, "Wrong size on DamageComponent_C_Damage__DelegateSignature");
static_assert(offsetof(DamageComponent_C_Damage__DelegateSignature, Amount) == 0x000000, "Member 'DamageComponent_C_Damage__DelegateSignature::Amount' has a wrong offset!");
static_assert(offsetof(DamageComponent_C_Damage__DelegateSignature, Bone) == 0x000004, "Member 'DamageComponent_C_Damage__DelegateSignature::Bone' has a wrong offset!");
static_assert(offsetof(DamageComponent_C_Damage__DelegateSignature, HitLocation) == 0x00000C, "Member 'DamageComponent_C_Damage__DelegateSignature::HitLocation' has a wrong offset!");
static_assert(offsetof(DamageComponent_C_Damage__DelegateSignature, StartLocation) == 0x000018, "Member 'DamageComponent_C_Damage__DelegateSignature::StartLocation' has a wrong offset!");
static_assert(offsetof(DamageComponent_C_Damage__DelegateSignature, Instigator) == 0x000028, "Member 'DamageComponent_C_Damage__DelegateSignature::Instigator' has a wrong offset!");

}

