#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DrillBP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function DrillBP.DrillBP_C.ExecuteUbergraph_DrillBP
// 0x0020 (0x0020 - 0x0000)
struct DrillBP_C_ExecuteUbergraph_DrillBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DrillBP_C_ExecuteUbergraph_DrillBP) == 0x000008, "Wrong alignment on DrillBP_C_ExecuteUbergraph_DrillBP");
static_assert(sizeof(DrillBP_C_ExecuteUbergraph_DrillBP) == 0x000020, "Wrong size on DrillBP_C_ExecuteUbergraph_DrillBP");
static_assert(offsetof(DrillBP_C_ExecuteUbergraph_DrillBP, EntryPoint) == 0x000000, "Member 'DrillBP_C_ExecuteUbergraph_DrillBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(DrillBP_C_ExecuteUbergraph_DrillBP, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'DrillBP_C_ExecuteUbergraph_DrillBP::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(DrillBP_C_ExecuteUbergraph_DrillBP, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'DrillBP_C_ExecuteUbergraph_DrillBP::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

}

