#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EquippedToolSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ShopItemCategory_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EquippedToolSlot.EquippedToolSlot_C
// 0x0068 (0x02C8 - 0x0260)
class UEquippedToolSlot_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_85;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ItemName;                                          // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_158;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<EShopItemCategory>                     Categories;                                        // 0x0288(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	int32                                         IndexReference;                                    // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARobberController_C*                    As_Robber_Controller;                              // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Item;                                              // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ToolActor;                                         // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x02B8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_EquippedToolSlot(int32 EntryPoint);
	void CancelDrag();
	void DragItemFromCategory(EShopItemCategory Category);
	void Remove();
	void RemoveloadoutCategory();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateBoxSize();
	void RefreshInventory();
	void SetNewItem(class UClass* ItemInfo);
	void UpdateItem();
	void ResetBrush();
	void Construct();
	void PreviewItem(class UClass* ItemInfo, int32 SalePrice);
	void ChangeCategory(EShopItemCategory Category);
	bool OnDragOver(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	bool OnDrop(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	void UpdateItemInfo();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EquippedToolSlot_C">();
	}
	static class UEquippedToolSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEquippedToolSlot_C>();
	}
};
static_assert(alignof(UEquippedToolSlot_C) == 0x000008, "Wrong alignment on UEquippedToolSlot_C");
static_assert(sizeof(UEquippedToolSlot_C) == 0x0002C8, "Wrong size on UEquippedToolSlot_C");
static_assert(offsetof(UEquippedToolSlot_C, UberGraphFrame) == 0x000260, "Member 'UEquippedToolSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEquippedToolSlot_C, FadeIn) == 0x000268, "Member 'UEquippedToolSlot_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UEquippedToolSlot_C, Border_85) == 0x000270, "Member 'UEquippedToolSlot_C::Border_85' has a wrong offset!");
static_assert(offsetof(UEquippedToolSlot_C, ItemName) == 0x000278, "Member 'UEquippedToolSlot_C::ItemName' has a wrong offset!");
static_assert(offsetof(UEquippedToolSlot_C, SizeBox_158) == 0x000280, "Member 'UEquippedToolSlot_C::SizeBox_158' has a wrong offset!");
static_assert(offsetof(UEquippedToolSlot_C, Categories) == 0x000288, "Member 'UEquippedToolSlot_C::Categories' has a wrong offset!");
static_assert(offsetof(UEquippedToolSlot_C, IndexReference) == 0x000298, "Member 'UEquippedToolSlot_C::IndexReference' has a wrong offset!");
static_assert(offsetof(UEquippedToolSlot_C, As_Robber_Controller) == 0x0002A0, "Member 'UEquippedToolSlot_C::As_Robber_Controller' has a wrong offset!");
static_assert(offsetof(UEquippedToolSlot_C, Item) == 0x0002A8, "Member 'UEquippedToolSlot_C::Item' has a wrong offset!");
static_assert(offsetof(UEquippedToolSlot_C, ToolActor) == 0x0002B0, "Member 'UEquippedToolSlot_C::ToolActor' has a wrong offset!");
static_assert(offsetof(UEquippedToolSlot_C, Location) == 0x0002B8, "Member 'UEquippedToolSlot_C::Location' has a wrong offset!");

}

