#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Equipmentshelf_equipment_Empty

#include "Basic.hpp"

#include "Equipmentshelf_equipment_base_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Equipmentshelf_equipment_Empty.Equipmentshelf_equipment_Empty_C
// 0x0038 (0x0278 - 0x0240)
class AEquipmentshelf_equipment_Empty_C final : public AEquipmentshelf_equipment_base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_Prop_CardboardBox_04;                           // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Prop_CardboardBox_03;                           // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Prop_CardboardBox_02;                           // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Prop_CardboardBox_01;                           // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMesh*>                    Meshes;                                            // 0x0268(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_Equipmentshelf_equipment_Empty(int32 EntryPoint);
	void ReceiveBeginPlay();
	void RandomizeProps();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Equipmentshelf_equipment_Empty_C">();
	}
	static class AEquipmentshelf_equipment_Empty_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEquipmentshelf_equipment_Empty_C>();
	}
};
static_assert(alignof(AEquipmentshelf_equipment_Empty_C) == 0x000008, "Wrong alignment on AEquipmentshelf_equipment_Empty_C");
static_assert(sizeof(AEquipmentshelf_equipment_Empty_C) == 0x000278, "Wrong size on AEquipmentshelf_equipment_Empty_C");
static_assert(offsetof(AEquipmentshelf_equipment_Empty_C, UberGraphFrame) == 0x000240, "Member 'AEquipmentshelf_equipment_Empty_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AEquipmentshelf_equipment_Empty_C, SM_Prop_CardboardBox_04) == 0x000248, "Member 'AEquipmentshelf_equipment_Empty_C::SM_Prop_CardboardBox_04' has a wrong offset!");
static_assert(offsetof(AEquipmentshelf_equipment_Empty_C, SM_Prop_CardboardBox_03) == 0x000250, "Member 'AEquipmentshelf_equipment_Empty_C::SM_Prop_CardboardBox_03' has a wrong offset!");
static_assert(offsetof(AEquipmentshelf_equipment_Empty_C, SM_Prop_CardboardBox_02) == 0x000258, "Member 'AEquipmentshelf_equipment_Empty_C::SM_Prop_CardboardBox_02' has a wrong offset!");
static_assert(offsetof(AEquipmentshelf_equipment_Empty_C, SM_Prop_CardboardBox_01) == 0x000260, "Member 'AEquipmentshelf_equipment_Empty_C::SM_Prop_CardboardBox_01' has a wrong offset!");
static_assert(offsetof(AEquipmentshelf_equipment_Empty_C, Meshes) == 0x000268, "Member 'AEquipmentshelf_equipment_Empty_C::Meshes' has a wrong offset!");

}

