#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FindingSessionUI

#include "Basic.hpp"

#include "SteamCore_structs.hpp"
#include "AdvancedSessions_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function FindingSessionUI.FindingSessionUI_C.ExecuteUbergraph_FindingSessionUI
// 0x0240 (0x0240 - 0x0000)
struct FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLobbyMatchList                        Temp_struct_Variable;                              // 0x0008(0x0004)(NoDestructor)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USteamCoreMatchmakingAsyncActionRequestLobbyList* CallFunc_RequestLobbyListAsync_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class USteamCoreMatchmakingAsyncActionJoinLobby* CallFunc_JoinLobbyAsync_ReturnValue;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FJoinLobbyData& Data, bool bWasSuccessful)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJoinLobbyData                         K2Node_CustomEvent_Data;                           // 0x0060(0x0010)(ConstParm, NoDestructor)
	bool                                          K2Node_CustomEvent_bWasSuccessful;                 // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FJoinLobbyData                         Temp_struct_Variable_1;                            // 0x0078(0x0010)(NoDestructor)
	class UJoiningGameUI_C*                       CallFunc_Create_ReturnValue;                       // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FLobbyMatchList& Data, bool bWasSuccessful)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0094(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamID                               CallFunc_GetSteamID_Pure_ReturnValue;              // 0x00A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URobberGI_C*                            K2Node_DynamicCast_AsRobber_GI;                    // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLobbyMatchList                        K2Node_CustomEvent_Data_1;                         // 0x00D4(0x0004)(ConstParm, NoDestructor)
	bool                                          K2Node_CustomEvent_bWasSuccessful_1;               // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_SearchingLobbies_;              // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DA[0x2];                                       // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInViewport_ReturnValue_1;               // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2[0x2];                                       // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00E4(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumLobbyMembers_ReturnValue;           // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDestroySessionCallbackProxy*           CallFunc_DestroySession_ReturnValue;               // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumLobbyMembers_ReturnValue_1;         // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_3;             // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13E[0x2];                                      // 0x013E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBPUniqueNetId                         CallFunc_GetUniqueNetID_UniqueNetId;               // 0x0140(0x0020)()
	bool                                          CallFunc_IsPlayerInSession_bIsInSession;           // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamID                               CallFunc_GetLobbyOwner_ReturnValue;                // 0x0168(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_BreakSteamID_ReturnValue;                 // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FSteamID>                       K2Node_Select_Default;                             // 0x01B0(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Variable;                                 // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamID                               CallFunc_Array_Random_OutItem;                     // 0x01C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamID                               CallFunc_GetLobbyByIndex_ReturnValue;              // 0x01D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetLobbyData_ReturnValue;                 // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetLobbyData_ReturnValue_1;               // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20A[0x2];                                      // 0x020A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumLobbyMembers_ReturnValue_2;         // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLobbyMemberLimit_ReturnValue;          // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamID                               CallFunc_GetLobbyOwner_ReturnValue_1;              // 0x0218(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Equal_ReturnValue;                        // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_222[0x6];                                      // 0x0222(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetLobbyData_ReturnValue_2;               // 0x0228(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23A[0x2];                                      // 0x023A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI) == 0x000008, "Wrong alignment on FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI");
static_assert(sizeof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI) == 0x000240, "Wrong size on FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, EntryPoint) == 0x000000, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::EntryPoint' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, Temp_bool_Variable) == 0x000004, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, Temp_struct_Variable) == 0x000008, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_RequestLobbyListAsync_ReturnValue) == 0x000010, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_RequestLobbyListAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_JoinLobbyAsync_ReturnValue) == 0x000040, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_JoinLobbyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, K2Node_CreateDelegate_OutputDelegate_2) == 0x000048, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_IsValid_ReturnValue_1) == 0x000058, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, K2Node_CustomEvent_Data) == 0x000060, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::K2Node_CustomEvent_Data' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, K2Node_CustomEvent_bWasSuccessful) == 0x000070, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::K2Node_CustomEvent_bWasSuccessful' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, Temp_bool_Variable_1) == 0x000071, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, Temp_struct_Variable_1) == 0x000078, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_Create_ReturnValue) == 0x000088, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, Temp_bool_Variable_2) == 0x000090, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, K2Node_CreateDelegate_OutputDelegate_3) == 0x000094, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_GetSteamID_Pure_ReturnValue) == 0x0000A8, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_GetSteamID_Pure_ReturnValue' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_IsInViewport_ReturnValue) == 0x0000B0, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_Array_Length_ReturnValue) == 0x0000B4, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_Greater_IntInt_ReturnValue) == 0x0000B8, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_GetGameInstance_ReturnValue) == 0x0000C0, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, K2Node_DynamicCast_AsRobber_GI) == 0x0000C8, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::K2Node_DynamicCast_AsRobber_GI' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, K2Node_CustomEvent_Data_1) == 0x0000D4, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::K2Node_CustomEvent_Data_1' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, K2Node_CustomEvent_bWasSuccessful_1) == 0x0000D8, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::K2Node_CustomEvent_bWasSuccessful_1' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, K2Node_CustomEvent_SearchingLobbies_) == 0x0000D9, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::K2Node_CustomEvent_SearchingLobbies_' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_Array_Length_ReturnValue_1) == 0x0000DC, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0000E0, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_IsInViewport_ReturnValue_1) == 0x0000E1, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_IsInViewport_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, K2Node_Event_MyGeometry) == 0x0000E4, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, K2Node_Event_InDeltaTime) == 0x00011C, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_GetNumLobbyMembers_ReturnValue) == 0x000120, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_GetNumLobbyMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_Greater_IntInt_ReturnValue_2) == 0x000124, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_GetPlayerController_ReturnValue) == 0x000128, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_DestroySession_ReturnValue) == 0x000130, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_DestroySession_ReturnValue' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_GetNumLobbyMembers_ReturnValue_1) == 0x000138, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_GetNumLobbyMembers_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_Greater_IntInt_ReturnValue_3) == 0x00013C, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_Greater_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_IsValid_ReturnValue_2) == 0x00013D, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_GetUniqueNetID_UniqueNetId) == 0x000140, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_GetUniqueNetID_UniqueNetId' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_IsPlayerInSession_bIsInSession) == 0x000160, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_IsPlayerInSession_bIsInSession' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_GetLobbyOwner_ReturnValue) == 0x000168, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_GetLobbyOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_BreakSteamID_ReturnValue) == 0x000170, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_BreakSteamID_ReturnValue' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_Concat_StrStr_ReturnValue) == 0x000180, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000190, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0001A0, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, K2Node_Select_Default) == 0x0001B0, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, Temp_int_Variable) == 0x0001C0, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_Array_Random_OutItem) == 0x0001C8, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_Array_Random_OutIndex) == 0x0001D0, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_GetLobbyByIndex_ReturnValue) == 0x0001D8, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_GetLobbyByIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_Array_Add_ReturnValue) == 0x0001E0, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_Array_Add_ReturnValue_1) == 0x0001E4, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_GetLobbyData_ReturnValue) == 0x0001E8, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_GetLobbyData_ReturnValue' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_GetLobbyData_ReturnValue_1) == 0x0001F8, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_GetLobbyData_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000208, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000209, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_GetNumLobbyMembers_ReturnValue_2) == 0x00020C, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_GetNumLobbyMembers_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_GetLobbyMemberLimit_ReturnValue) == 0x000210, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_GetLobbyMemberLimit_ReturnValue' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_GetLobbyOwner_ReturnValue_1) == 0x000218, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_GetLobbyOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000220, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_Equal_ReturnValue) == 0x000221, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_Equal_ReturnValue' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_GetLobbyData_ReturnValue_2) == 0x000228, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_GetLobbyData_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_EqualEqual_StrStr_ReturnValue_2) == 0x000238, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_EqualEqual_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000239, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI, CallFunc_Add_IntInt_ReturnValue) == 0x00023C, "Member 'FindingSessionUI_C_ExecuteUbergraph_FindingSessionUI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function FindingSessionUI.FindingSessionUI_C.Tick
// 0x003C (0x003C - 0x0000)
struct FindingSessionUI_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FindingSessionUI_C_Tick) == 0x000004, "Wrong alignment on FindingSessionUI_C_Tick");
static_assert(sizeof(FindingSessionUI_C_Tick) == 0x00003C, "Wrong size on FindingSessionUI_C_Tick");
static_assert(offsetof(FindingSessionUI_C_Tick, MyGeometry) == 0x000000, "Member 'FindingSessionUI_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_Tick, InDeltaTime) == 0x000038, "Member 'FindingSessionUI_C_Tick::InDeltaTime' has a wrong offset!");

// Function FindingSessionUI.FindingSessionUI_C.JoinSteamLobby
// 0x0001 (0x0001 - 0x0000)
struct FindingSessionUI_C_JoinSteamLobby final
{
public:
	bool                                          SearchingLobbies_;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FindingSessionUI_C_JoinSteamLobby) == 0x000001, "Wrong alignment on FindingSessionUI_C_JoinSteamLobby");
static_assert(sizeof(FindingSessionUI_C_JoinSteamLobby) == 0x000001, "Wrong size on FindingSessionUI_C_JoinSteamLobby");
static_assert(offsetof(FindingSessionUI_C_JoinSteamLobby, SearchingLobbies_) == 0x000000, "Member 'FindingSessionUI_C_JoinSteamLobby::SearchingLobbies_' has a wrong offset!");

// Function FindingSessionUI.FindingSessionUI_C.OnCallback_6CBB3ED848E3919BD8A0BA8FE448B377
// 0x0018 (0x0018 - 0x0000)
struct FindingSessionUI_C_OnCallback_6CBB3ED848E3919BD8A0BA8FE448B377 final
{
public:
	struct FJoinLobbyData                         Data;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	bool                                          bWasSuccessful;                                    // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FindingSessionUI_C_OnCallback_6CBB3ED848E3919BD8A0BA8FE448B377) == 0x000008, "Wrong alignment on FindingSessionUI_C_OnCallback_6CBB3ED848E3919BD8A0BA8FE448B377");
static_assert(sizeof(FindingSessionUI_C_OnCallback_6CBB3ED848E3919BD8A0BA8FE448B377) == 0x000018, "Wrong size on FindingSessionUI_C_OnCallback_6CBB3ED848E3919BD8A0BA8FE448B377");
static_assert(offsetof(FindingSessionUI_C_OnCallback_6CBB3ED848E3919BD8A0BA8FE448B377, Data) == 0x000000, "Member 'FindingSessionUI_C_OnCallback_6CBB3ED848E3919BD8A0BA8FE448B377::Data' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_OnCallback_6CBB3ED848E3919BD8A0BA8FE448B377, bWasSuccessful) == 0x000010, "Member 'FindingSessionUI_C_OnCallback_6CBB3ED848E3919BD8A0BA8FE448B377::bWasSuccessful' has a wrong offset!");

// Function FindingSessionUI.FindingSessionUI_C.OnCallback_0841270945399718EF8851AB7EA24E54
// 0x0008 (0x0008 - 0x0000)
struct FindingSessionUI_C_OnCallback_0841270945399718EF8851AB7EA24E54 final
{
public:
	struct FLobbyMatchList                        Data;                                              // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	bool                                          bWasSuccessful;                                    // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FindingSessionUI_C_OnCallback_0841270945399718EF8851AB7EA24E54) == 0x000004, "Wrong alignment on FindingSessionUI_C_OnCallback_0841270945399718EF8851AB7EA24E54");
static_assert(sizeof(FindingSessionUI_C_OnCallback_0841270945399718EF8851AB7EA24E54) == 0x000008, "Wrong size on FindingSessionUI_C_OnCallback_0841270945399718EF8851AB7EA24E54");
static_assert(offsetof(FindingSessionUI_C_OnCallback_0841270945399718EF8851AB7EA24E54, Data) == 0x000000, "Member 'FindingSessionUI_C_OnCallback_0841270945399718EF8851AB7EA24E54::Data' has a wrong offset!");
static_assert(offsetof(FindingSessionUI_C_OnCallback_0841270945399718EF8851AB7EA24E54, bWasSuccessful) == 0x000004, "Member 'FindingSessionUI_C_OnCallback_0841270945399718EF8851AB7EA24E54::bWasSuccessful' has a wrong offset!");

}

