#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameAnalytics

#include "Basic.hpp"

#include "GameAnalytics_structs.hpp"


namespace SDK::Params
{

// Function GameAnalytics.GameAnalytics.AddAdEvent
// 0x0028 (0x0028 - 0x0000)
struct GameAnalytics_AddAdEvent final
{
public:
	EGAAdAction                                   Action;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGAAdType                                     AdType;                                            // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AdSdkName;                                         // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AdPlacement;                                       // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameAnalytics_AddAdEvent) == 0x000008, "Wrong alignment on GameAnalytics_AddAdEvent");
static_assert(sizeof(GameAnalytics_AddAdEvent) == 0x000028, "Wrong size on GameAnalytics_AddAdEvent");
static_assert(offsetof(GameAnalytics_AddAdEvent, Action) == 0x000000, "Member 'GameAnalytics_AddAdEvent::Action' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddAdEvent, AdType) == 0x000001, "Member 'GameAnalytics_AddAdEvent::AdType' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddAdEvent, AdSdkName) == 0x000008, "Member 'GameAnalytics_AddAdEvent::AdSdkName' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddAdEvent, AdPlacement) == 0x000018, "Member 'GameAnalytics_AddAdEvent::AdPlacement' has a wrong offset!");

// Function GameAnalytics.GameAnalytics.AddAdEventWithDuration
// 0x0030 (0x0030 - 0x0000)
struct GameAnalytics_AddAdEventWithDuration final
{
public:
	EGAAdAction                                   Action;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGAAdType                                     AdType;                                            // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AdSdkName;                                         // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AdPlacement;                                       // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Duration;                                          // 0x0028(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameAnalytics_AddAdEventWithDuration) == 0x000008, "Wrong alignment on GameAnalytics_AddAdEventWithDuration");
static_assert(sizeof(GameAnalytics_AddAdEventWithDuration) == 0x000030, "Wrong size on GameAnalytics_AddAdEventWithDuration");
static_assert(offsetof(GameAnalytics_AddAdEventWithDuration, Action) == 0x000000, "Member 'GameAnalytics_AddAdEventWithDuration::Action' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddAdEventWithDuration, AdType) == 0x000001, "Member 'GameAnalytics_AddAdEventWithDuration::AdType' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddAdEventWithDuration, AdSdkName) == 0x000008, "Member 'GameAnalytics_AddAdEventWithDuration::AdSdkName' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddAdEventWithDuration, AdPlacement) == 0x000018, "Member 'GameAnalytics_AddAdEventWithDuration::AdPlacement' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddAdEventWithDuration, Duration) == 0x000028, "Member 'GameAnalytics_AddAdEventWithDuration::Duration' has a wrong offset!");

// Function GameAnalytics.GameAnalytics.AddAdEventWithDurationAndFields
// 0x0040 (0x0040 - 0x0000)
struct GameAnalytics_AddAdEventWithDurationAndFields final
{
public:
	EGAAdAction                                   Action;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGAAdType                                     AdType;                                            // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AdSdkName;                                         // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AdPlacement;                                       // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Duration;                                          // 0x0028(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGameAnalyticsCustomEventField> CustomFields;                                      // 0x0030(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameAnalytics_AddAdEventWithDurationAndFields) == 0x000008, "Wrong alignment on GameAnalytics_AddAdEventWithDurationAndFields");
static_assert(sizeof(GameAnalytics_AddAdEventWithDurationAndFields) == 0x000040, "Wrong size on GameAnalytics_AddAdEventWithDurationAndFields");
static_assert(offsetof(GameAnalytics_AddAdEventWithDurationAndFields, Action) == 0x000000, "Member 'GameAnalytics_AddAdEventWithDurationAndFields::Action' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddAdEventWithDurationAndFields, AdType) == 0x000001, "Member 'GameAnalytics_AddAdEventWithDurationAndFields::AdType' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddAdEventWithDurationAndFields, AdSdkName) == 0x000008, "Member 'GameAnalytics_AddAdEventWithDurationAndFields::AdSdkName' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddAdEventWithDurationAndFields, AdPlacement) == 0x000018, "Member 'GameAnalytics_AddAdEventWithDurationAndFields::AdPlacement' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddAdEventWithDurationAndFields, Duration) == 0x000028, "Member 'GameAnalytics_AddAdEventWithDurationAndFields::Duration' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddAdEventWithDurationAndFields, CustomFields) == 0x000030, "Member 'GameAnalytics_AddAdEventWithDurationAndFields::CustomFields' has a wrong offset!");

// Function GameAnalytics.GameAnalytics.AddAdEventWithDurationAndMergeFields
// 0x0040 (0x0040 - 0x0000)
struct GameAnalytics_AddAdEventWithDurationAndMergeFields final
{
public:
	EGAAdAction                                   Action;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGAAdType                                     AdType;                                            // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AdSdkName;                                         // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AdPlacement;                                       // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Duration;                                          // 0x0028(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGameAnalyticsCustomEventField> CustomFields;                                      // 0x0030(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameAnalytics_AddAdEventWithDurationAndMergeFields) == 0x000008, "Wrong alignment on GameAnalytics_AddAdEventWithDurationAndMergeFields");
static_assert(sizeof(GameAnalytics_AddAdEventWithDurationAndMergeFields) == 0x000040, "Wrong size on GameAnalytics_AddAdEventWithDurationAndMergeFields");
static_assert(offsetof(GameAnalytics_AddAdEventWithDurationAndMergeFields, Action) == 0x000000, "Member 'GameAnalytics_AddAdEventWithDurationAndMergeFields::Action' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddAdEventWithDurationAndMergeFields, AdType) == 0x000001, "Member 'GameAnalytics_AddAdEventWithDurationAndMergeFields::AdType' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddAdEventWithDurationAndMergeFields, AdSdkName) == 0x000008, "Member 'GameAnalytics_AddAdEventWithDurationAndMergeFields::AdSdkName' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddAdEventWithDurationAndMergeFields, AdPlacement) == 0x000018, "Member 'GameAnalytics_AddAdEventWithDurationAndMergeFields::AdPlacement' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddAdEventWithDurationAndMergeFields, Duration) == 0x000028, "Member 'GameAnalytics_AddAdEventWithDurationAndMergeFields::Duration' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddAdEventWithDurationAndMergeFields, CustomFields) == 0x000030, "Member 'GameAnalytics_AddAdEventWithDurationAndMergeFields::CustomFields' has a wrong offset!");

// Function GameAnalytics.GameAnalytics.AddAdEventWithFields
// 0x0038 (0x0038 - 0x0000)
struct GameAnalytics_AddAdEventWithFields final
{
public:
	EGAAdAction                                   Action;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGAAdType                                     AdType;                                            // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AdSdkName;                                         // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AdPlacement;                                       // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGameAnalyticsCustomEventField> CustomFields;                                      // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameAnalytics_AddAdEventWithFields) == 0x000008, "Wrong alignment on GameAnalytics_AddAdEventWithFields");
static_assert(sizeof(GameAnalytics_AddAdEventWithFields) == 0x000038, "Wrong size on GameAnalytics_AddAdEventWithFields");
static_assert(offsetof(GameAnalytics_AddAdEventWithFields, Action) == 0x000000, "Member 'GameAnalytics_AddAdEventWithFields::Action' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddAdEventWithFields, AdType) == 0x000001, "Member 'GameAnalytics_AddAdEventWithFields::AdType' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddAdEventWithFields, AdSdkName) == 0x000008, "Member 'GameAnalytics_AddAdEventWithFields::AdSdkName' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddAdEventWithFields, AdPlacement) == 0x000018, "Member 'GameAnalytics_AddAdEventWithFields::AdPlacement' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddAdEventWithFields, CustomFields) == 0x000028, "Member 'GameAnalytics_AddAdEventWithFields::CustomFields' has a wrong offset!");

// Function GameAnalytics.GameAnalytics.AddAdEventWithMergeFields
// 0x0038 (0x0038 - 0x0000)
struct GameAnalytics_AddAdEventWithMergeFields final
{
public:
	EGAAdAction                                   Action;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGAAdType                                     AdType;                                            // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AdSdkName;                                         // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AdPlacement;                                       // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGameAnalyticsCustomEventField> CustomFields;                                      // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameAnalytics_AddAdEventWithMergeFields) == 0x000008, "Wrong alignment on GameAnalytics_AddAdEventWithMergeFields");
static_assert(sizeof(GameAnalytics_AddAdEventWithMergeFields) == 0x000038, "Wrong size on GameAnalytics_AddAdEventWithMergeFields");
static_assert(offsetof(GameAnalytics_AddAdEventWithMergeFields, Action) == 0x000000, "Member 'GameAnalytics_AddAdEventWithMergeFields::Action' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddAdEventWithMergeFields, AdType) == 0x000001, "Member 'GameAnalytics_AddAdEventWithMergeFields::AdType' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddAdEventWithMergeFields, AdSdkName) == 0x000008, "Member 'GameAnalytics_AddAdEventWithMergeFields::AdSdkName' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddAdEventWithMergeFields, AdPlacement) == 0x000018, "Member 'GameAnalytics_AddAdEventWithMergeFields::AdPlacement' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddAdEventWithMergeFields, CustomFields) == 0x000028, "Member 'GameAnalytics_AddAdEventWithMergeFields::CustomFields' has a wrong offset!");

// Function GameAnalytics.GameAnalytics.AddAdEventWithNoAdReason
// 0x0030 (0x0030 - 0x0000)
struct GameAnalytics_AddAdEventWithNoAdReason final
{
public:
	EGAAdAction                                   Action;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGAAdType                                     AdType;                                            // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AdSdkName;                                         // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AdPlacement;                                       // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGAAdError                                    NoAdReason;                                        // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GameAnalytics_AddAdEventWithNoAdReason) == 0x000008, "Wrong alignment on GameAnalytics_AddAdEventWithNoAdReason");
static_assert(sizeof(GameAnalytics_AddAdEventWithNoAdReason) == 0x000030, "Wrong size on GameAnalytics_AddAdEventWithNoAdReason");
static_assert(offsetof(GameAnalytics_AddAdEventWithNoAdReason, Action) == 0x000000, "Member 'GameAnalytics_AddAdEventWithNoAdReason::Action' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddAdEventWithNoAdReason, AdType) == 0x000001, "Member 'GameAnalytics_AddAdEventWithNoAdReason::AdType' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddAdEventWithNoAdReason, AdSdkName) == 0x000008, "Member 'GameAnalytics_AddAdEventWithNoAdReason::AdSdkName' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddAdEventWithNoAdReason, AdPlacement) == 0x000018, "Member 'GameAnalytics_AddAdEventWithNoAdReason::AdPlacement' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddAdEventWithNoAdReason, NoAdReason) == 0x000028, "Member 'GameAnalytics_AddAdEventWithNoAdReason::NoAdReason' has a wrong offset!");

// Function GameAnalytics.GameAnalytics.AddAdEventWithNoAdReasonAndFields
// 0x0040 (0x0040 - 0x0000)
struct GameAnalytics_AddAdEventWithNoAdReasonAndFields final
{
public:
	EGAAdAction                                   Action;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGAAdType                                     AdType;                                            // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AdSdkName;                                         // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AdPlacement;                                       // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGAAdError                                    NoAdReason;                                        // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameAnalyticsCustomEventField> CustomFields;                                      // 0x0030(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameAnalytics_AddAdEventWithNoAdReasonAndFields) == 0x000008, "Wrong alignment on GameAnalytics_AddAdEventWithNoAdReasonAndFields");
static_assert(sizeof(GameAnalytics_AddAdEventWithNoAdReasonAndFields) == 0x000040, "Wrong size on GameAnalytics_AddAdEventWithNoAdReasonAndFields");
static_assert(offsetof(GameAnalytics_AddAdEventWithNoAdReasonAndFields, Action) == 0x000000, "Member 'GameAnalytics_AddAdEventWithNoAdReasonAndFields::Action' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddAdEventWithNoAdReasonAndFields, AdType) == 0x000001, "Member 'GameAnalytics_AddAdEventWithNoAdReasonAndFields::AdType' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddAdEventWithNoAdReasonAndFields, AdSdkName) == 0x000008, "Member 'GameAnalytics_AddAdEventWithNoAdReasonAndFields::AdSdkName' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddAdEventWithNoAdReasonAndFields, AdPlacement) == 0x000018, "Member 'GameAnalytics_AddAdEventWithNoAdReasonAndFields::AdPlacement' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddAdEventWithNoAdReasonAndFields, NoAdReason) == 0x000028, "Member 'GameAnalytics_AddAdEventWithNoAdReasonAndFields::NoAdReason' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddAdEventWithNoAdReasonAndFields, CustomFields) == 0x000030, "Member 'GameAnalytics_AddAdEventWithNoAdReasonAndFields::CustomFields' has a wrong offset!");

// Function GameAnalytics.GameAnalytics.AddAdEventWithNoAdReasonAndMergeFields
// 0x0040 (0x0040 - 0x0000)
struct GameAnalytics_AddAdEventWithNoAdReasonAndMergeFields final
{
public:
	EGAAdAction                                   Action;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGAAdType                                     AdType;                                            // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AdSdkName;                                         // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AdPlacement;                                       // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGAAdError                                    NoAdReason;                                        // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameAnalyticsCustomEventField> CustomFields;                                      // 0x0030(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameAnalytics_AddAdEventWithNoAdReasonAndMergeFields) == 0x000008, "Wrong alignment on GameAnalytics_AddAdEventWithNoAdReasonAndMergeFields");
static_assert(sizeof(GameAnalytics_AddAdEventWithNoAdReasonAndMergeFields) == 0x000040, "Wrong size on GameAnalytics_AddAdEventWithNoAdReasonAndMergeFields");
static_assert(offsetof(GameAnalytics_AddAdEventWithNoAdReasonAndMergeFields, Action) == 0x000000, "Member 'GameAnalytics_AddAdEventWithNoAdReasonAndMergeFields::Action' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddAdEventWithNoAdReasonAndMergeFields, AdType) == 0x000001, "Member 'GameAnalytics_AddAdEventWithNoAdReasonAndMergeFields::AdType' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddAdEventWithNoAdReasonAndMergeFields, AdSdkName) == 0x000008, "Member 'GameAnalytics_AddAdEventWithNoAdReasonAndMergeFields::AdSdkName' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddAdEventWithNoAdReasonAndMergeFields, AdPlacement) == 0x000018, "Member 'GameAnalytics_AddAdEventWithNoAdReasonAndMergeFields::AdPlacement' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddAdEventWithNoAdReasonAndMergeFields, NoAdReason) == 0x000028, "Member 'GameAnalytics_AddAdEventWithNoAdReasonAndMergeFields::NoAdReason' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddAdEventWithNoAdReasonAndMergeFields, CustomFields) == 0x000030, "Member 'GameAnalytics_AddAdEventWithNoAdReasonAndMergeFields::CustomFields' has a wrong offset!");

// Function GameAnalytics.GameAnalytics.AddBusinessEvent
// 0x0048 (0x0048 - 0x0000)
struct GameAnalytics_AddBusinessEvent final
{
public:
	class FString                                 Currency;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Amount;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ItemType;                                          // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ItemId;                                            // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CartType;                                          // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameAnalytics_AddBusinessEvent) == 0x000008, "Wrong alignment on GameAnalytics_AddBusinessEvent");
static_assert(sizeof(GameAnalytics_AddBusinessEvent) == 0x000048, "Wrong size on GameAnalytics_AddBusinessEvent");
static_assert(offsetof(GameAnalytics_AddBusinessEvent, Currency) == 0x000000, "Member 'GameAnalytics_AddBusinessEvent::Currency' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEvent, Amount) == 0x000010, "Member 'GameAnalytics_AddBusinessEvent::Amount' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEvent, ItemType) == 0x000018, "Member 'GameAnalytics_AddBusinessEvent::ItemType' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEvent, ItemId) == 0x000028, "Member 'GameAnalytics_AddBusinessEvent::ItemId' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEvent, CartType) == 0x000038, "Member 'GameAnalytics_AddBusinessEvent::CartType' has a wrong offset!");

// Function GameAnalytics.GameAnalytics.AddBusinessEventAndAutoFetchReceipt
// 0x0048 (0x0048 - 0x0000)
struct GameAnalytics_AddBusinessEventAndAutoFetchReceipt final
{
public:
	class FString                                 Currency;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Amount;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ItemType;                                          // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ItemId;                                            // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CartType;                                          // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameAnalytics_AddBusinessEventAndAutoFetchReceipt) == 0x000008, "Wrong alignment on GameAnalytics_AddBusinessEventAndAutoFetchReceipt");
static_assert(sizeof(GameAnalytics_AddBusinessEventAndAutoFetchReceipt) == 0x000048, "Wrong size on GameAnalytics_AddBusinessEventAndAutoFetchReceipt");
static_assert(offsetof(GameAnalytics_AddBusinessEventAndAutoFetchReceipt, Currency) == 0x000000, "Member 'GameAnalytics_AddBusinessEventAndAutoFetchReceipt::Currency' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventAndAutoFetchReceipt, Amount) == 0x000010, "Member 'GameAnalytics_AddBusinessEventAndAutoFetchReceipt::Amount' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventAndAutoFetchReceipt, ItemType) == 0x000018, "Member 'GameAnalytics_AddBusinessEventAndAutoFetchReceipt::ItemType' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventAndAutoFetchReceipt, ItemId) == 0x000028, "Member 'GameAnalytics_AddBusinessEventAndAutoFetchReceipt::ItemId' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventAndAutoFetchReceipt, CartType) == 0x000038, "Member 'GameAnalytics_AddBusinessEventAndAutoFetchReceipt::CartType' has a wrong offset!");

// Function GameAnalytics.GameAnalytics.AddBusinessEventAndAutoFetchReceiptWithFields
// 0x0058 (0x0058 - 0x0000)
struct GameAnalytics_AddBusinessEventAndAutoFetchReceiptWithFields final
{
public:
	class FString                                 Currency;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Amount;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ItemType;                                          // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ItemId;                                            // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CartType;                                          // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGameAnalyticsCustomEventField> CustomFields;                                      // 0x0048(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameAnalytics_AddBusinessEventAndAutoFetchReceiptWithFields) == 0x000008, "Wrong alignment on GameAnalytics_AddBusinessEventAndAutoFetchReceiptWithFields");
static_assert(sizeof(GameAnalytics_AddBusinessEventAndAutoFetchReceiptWithFields) == 0x000058, "Wrong size on GameAnalytics_AddBusinessEventAndAutoFetchReceiptWithFields");
static_assert(offsetof(GameAnalytics_AddBusinessEventAndAutoFetchReceiptWithFields, Currency) == 0x000000, "Member 'GameAnalytics_AddBusinessEventAndAutoFetchReceiptWithFields::Currency' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventAndAutoFetchReceiptWithFields, Amount) == 0x000010, "Member 'GameAnalytics_AddBusinessEventAndAutoFetchReceiptWithFields::Amount' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventAndAutoFetchReceiptWithFields, ItemType) == 0x000018, "Member 'GameAnalytics_AddBusinessEventAndAutoFetchReceiptWithFields::ItemType' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventAndAutoFetchReceiptWithFields, ItemId) == 0x000028, "Member 'GameAnalytics_AddBusinessEventAndAutoFetchReceiptWithFields::ItemId' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventAndAutoFetchReceiptWithFields, CartType) == 0x000038, "Member 'GameAnalytics_AddBusinessEventAndAutoFetchReceiptWithFields::CartType' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventAndAutoFetchReceiptWithFields, CustomFields) == 0x000048, "Member 'GameAnalytics_AddBusinessEventAndAutoFetchReceiptWithFields::CustomFields' has a wrong offset!");

// Function GameAnalytics.GameAnalytics.AddBusinessEventAndAutoFetchReceiptWithMergeFields
// 0x0058 (0x0058 - 0x0000)
struct GameAnalytics_AddBusinessEventAndAutoFetchReceiptWithMergeFields final
{
public:
	class FString                                 Currency;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Amount;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ItemType;                                          // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ItemId;                                            // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CartType;                                          // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGameAnalyticsCustomEventField> CustomFields;                                      // 0x0048(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameAnalytics_AddBusinessEventAndAutoFetchReceiptWithMergeFields) == 0x000008, "Wrong alignment on GameAnalytics_AddBusinessEventAndAutoFetchReceiptWithMergeFields");
static_assert(sizeof(GameAnalytics_AddBusinessEventAndAutoFetchReceiptWithMergeFields) == 0x000058, "Wrong size on GameAnalytics_AddBusinessEventAndAutoFetchReceiptWithMergeFields");
static_assert(offsetof(GameAnalytics_AddBusinessEventAndAutoFetchReceiptWithMergeFields, Currency) == 0x000000, "Member 'GameAnalytics_AddBusinessEventAndAutoFetchReceiptWithMergeFields::Currency' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventAndAutoFetchReceiptWithMergeFields, Amount) == 0x000010, "Member 'GameAnalytics_AddBusinessEventAndAutoFetchReceiptWithMergeFields::Amount' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventAndAutoFetchReceiptWithMergeFields, ItemType) == 0x000018, "Member 'GameAnalytics_AddBusinessEventAndAutoFetchReceiptWithMergeFields::ItemType' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventAndAutoFetchReceiptWithMergeFields, ItemId) == 0x000028, "Member 'GameAnalytics_AddBusinessEventAndAutoFetchReceiptWithMergeFields::ItemId' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventAndAutoFetchReceiptWithMergeFields, CartType) == 0x000038, "Member 'GameAnalytics_AddBusinessEventAndAutoFetchReceiptWithMergeFields::CartType' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventAndAutoFetchReceiptWithMergeFields, CustomFields) == 0x000048, "Member 'GameAnalytics_AddBusinessEventAndAutoFetchReceiptWithMergeFields::CustomFields' has a wrong offset!");

// Function GameAnalytics.GameAnalytics.AddBusinessEventAndroid
// 0x0068 (0x0068 - 0x0000)
struct GameAnalytics_AddBusinessEventAndroid final
{
public:
	class FString                                 Currency;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Amount;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ItemType;                                          // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ItemId;                                            // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CartType;                                          // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Receipt;                                           // 0x0048(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Signature;                                         // 0x0058(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameAnalytics_AddBusinessEventAndroid) == 0x000008, "Wrong alignment on GameAnalytics_AddBusinessEventAndroid");
static_assert(sizeof(GameAnalytics_AddBusinessEventAndroid) == 0x000068, "Wrong size on GameAnalytics_AddBusinessEventAndroid");
static_assert(offsetof(GameAnalytics_AddBusinessEventAndroid, Currency) == 0x000000, "Member 'GameAnalytics_AddBusinessEventAndroid::Currency' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventAndroid, Amount) == 0x000010, "Member 'GameAnalytics_AddBusinessEventAndroid::Amount' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventAndroid, ItemType) == 0x000018, "Member 'GameAnalytics_AddBusinessEventAndroid::ItemType' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventAndroid, ItemId) == 0x000028, "Member 'GameAnalytics_AddBusinessEventAndroid::ItemId' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventAndroid, CartType) == 0x000038, "Member 'GameAnalytics_AddBusinessEventAndroid::CartType' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventAndroid, Receipt) == 0x000048, "Member 'GameAnalytics_AddBusinessEventAndroid::Receipt' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventAndroid, Signature) == 0x000058, "Member 'GameAnalytics_AddBusinessEventAndroid::Signature' has a wrong offset!");

// Function GameAnalytics.GameAnalytics.AddBusinessEventAndroidWithFields
// 0x0078 (0x0078 - 0x0000)
struct GameAnalytics_AddBusinessEventAndroidWithFields final
{
public:
	class FString                                 Currency;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Amount;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ItemType;                                          // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ItemId;                                            // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CartType;                                          // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Receipt;                                           // 0x0048(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Signature;                                         // 0x0058(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGameAnalyticsCustomEventField> CustomFields;                                      // 0x0068(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameAnalytics_AddBusinessEventAndroidWithFields) == 0x000008, "Wrong alignment on GameAnalytics_AddBusinessEventAndroidWithFields");
static_assert(sizeof(GameAnalytics_AddBusinessEventAndroidWithFields) == 0x000078, "Wrong size on GameAnalytics_AddBusinessEventAndroidWithFields");
static_assert(offsetof(GameAnalytics_AddBusinessEventAndroidWithFields, Currency) == 0x000000, "Member 'GameAnalytics_AddBusinessEventAndroidWithFields::Currency' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventAndroidWithFields, Amount) == 0x000010, "Member 'GameAnalytics_AddBusinessEventAndroidWithFields::Amount' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventAndroidWithFields, ItemType) == 0x000018, "Member 'GameAnalytics_AddBusinessEventAndroidWithFields::ItemType' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventAndroidWithFields, ItemId) == 0x000028, "Member 'GameAnalytics_AddBusinessEventAndroidWithFields::ItemId' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventAndroidWithFields, CartType) == 0x000038, "Member 'GameAnalytics_AddBusinessEventAndroidWithFields::CartType' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventAndroidWithFields, Receipt) == 0x000048, "Member 'GameAnalytics_AddBusinessEventAndroidWithFields::Receipt' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventAndroidWithFields, Signature) == 0x000058, "Member 'GameAnalytics_AddBusinessEventAndroidWithFields::Signature' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventAndroidWithFields, CustomFields) == 0x000068, "Member 'GameAnalytics_AddBusinessEventAndroidWithFields::CustomFields' has a wrong offset!");

// Function GameAnalytics.GameAnalytics.AddBusinessEventAndroidWithMergeFields
// 0x0078 (0x0078 - 0x0000)
struct GameAnalytics_AddBusinessEventAndroidWithMergeFields final
{
public:
	class FString                                 Currency;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Amount;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ItemType;                                          // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ItemId;                                            // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CartType;                                          // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Receipt;                                           // 0x0048(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Signature;                                         // 0x0058(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGameAnalyticsCustomEventField> CustomFields;                                      // 0x0068(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameAnalytics_AddBusinessEventAndroidWithMergeFields) == 0x000008, "Wrong alignment on GameAnalytics_AddBusinessEventAndroidWithMergeFields");
static_assert(sizeof(GameAnalytics_AddBusinessEventAndroidWithMergeFields) == 0x000078, "Wrong size on GameAnalytics_AddBusinessEventAndroidWithMergeFields");
static_assert(offsetof(GameAnalytics_AddBusinessEventAndroidWithMergeFields, Currency) == 0x000000, "Member 'GameAnalytics_AddBusinessEventAndroidWithMergeFields::Currency' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventAndroidWithMergeFields, Amount) == 0x000010, "Member 'GameAnalytics_AddBusinessEventAndroidWithMergeFields::Amount' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventAndroidWithMergeFields, ItemType) == 0x000018, "Member 'GameAnalytics_AddBusinessEventAndroidWithMergeFields::ItemType' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventAndroidWithMergeFields, ItemId) == 0x000028, "Member 'GameAnalytics_AddBusinessEventAndroidWithMergeFields::ItemId' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventAndroidWithMergeFields, CartType) == 0x000038, "Member 'GameAnalytics_AddBusinessEventAndroidWithMergeFields::CartType' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventAndroidWithMergeFields, Receipt) == 0x000048, "Member 'GameAnalytics_AddBusinessEventAndroidWithMergeFields::Receipt' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventAndroidWithMergeFields, Signature) == 0x000058, "Member 'GameAnalytics_AddBusinessEventAndroidWithMergeFields::Signature' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventAndroidWithMergeFields, CustomFields) == 0x000068, "Member 'GameAnalytics_AddBusinessEventAndroidWithMergeFields::CustomFields' has a wrong offset!");

// Function GameAnalytics.GameAnalytics.AddBusinessEventIOS
// 0x0058 (0x0058 - 0x0000)
struct GameAnalytics_AddBusinessEventIOS final
{
public:
	class FString                                 Currency;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Amount;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ItemType;                                          // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ItemId;                                            // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CartType;                                          // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Receipt;                                           // 0x0048(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameAnalytics_AddBusinessEventIOS) == 0x000008, "Wrong alignment on GameAnalytics_AddBusinessEventIOS");
static_assert(sizeof(GameAnalytics_AddBusinessEventIOS) == 0x000058, "Wrong size on GameAnalytics_AddBusinessEventIOS");
static_assert(offsetof(GameAnalytics_AddBusinessEventIOS, Currency) == 0x000000, "Member 'GameAnalytics_AddBusinessEventIOS::Currency' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventIOS, Amount) == 0x000010, "Member 'GameAnalytics_AddBusinessEventIOS::Amount' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventIOS, ItemType) == 0x000018, "Member 'GameAnalytics_AddBusinessEventIOS::ItemType' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventIOS, ItemId) == 0x000028, "Member 'GameAnalytics_AddBusinessEventIOS::ItemId' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventIOS, CartType) == 0x000038, "Member 'GameAnalytics_AddBusinessEventIOS::CartType' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventIOS, Receipt) == 0x000048, "Member 'GameAnalytics_AddBusinessEventIOS::Receipt' has a wrong offset!");

// Function GameAnalytics.GameAnalytics.AddBusinessEventIOSWithFields
// 0x0068 (0x0068 - 0x0000)
struct GameAnalytics_AddBusinessEventIOSWithFields final
{
public:
	class FString                                 Currency;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Amount;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ItemType;                                          // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ItemId;                                            // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CartType;                                          // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Receipt;                                           // 0x0048(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGameAnalyticsCustomEventField> CustomFields;                                      // 0x0058(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameAnalytics_AddBusinessEventIOSWithFields) == 0x000008, "Wrong alignment on GameAnalytics_AddBusinessEventIOSWithFields");
static_assert(sizeof(GameAnalytics_AddBusinessEventIOSWithFields) == 0x000068, "Wrong size on GameAnalytics_AddBusinessEventIOSWithFields");
static_assert(offsetof(GameAnalytics_AddBusinessEventIOSWithFields, Currency) == 0x000000, "Member 'GameAnalytics_AddBusinessEventIOSWithFields::Currency' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventIOSWithFields, Amount) == 0x000010, "Member 'GameAnalytics_AddBusinessEventIOSWithFields::Amount' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventIOSWithFields, ItemType) == 0x000018, "Member 'GameAnalytics_AddBusinessEventIOSWithFields::ItemType' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventIOSWithFields, ItemId) == 0x000028, "Member 'GameAnalytics_AddBusinessEventIOSWithFields::ItemId' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventIOSWithFields, CartType) == 0x000038, "Member 'GameAnalytics_AddBusinessEventIOSWithFields::CartType' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventIOSWithFields, Receipt) == 0x000048, "Member 'GameAnalytics_AddBusinessEventIOSWithFields::Receipt' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventIOSWithFields, CustomFields) == 0x000058, "Member 'GameAnalytics_AddBusinessEventIOSWithFields::CustomFields' has a wrong offset!");

// Function GameAnalytics.GameAnalytics.AddBusinessEventIOSWithMergeFields
// 0x0068 (0x0068 - 0x0000)
struct GameAnalytics_AddBusinessEventIOSWithMergeFields final
{
public:
	class FString                                 Currency;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Amount;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ItemType;                                          // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ItemId;                                            // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CartType;                                          // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Receipt;                                           // 0x0048(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGameAnalyticsCustomEventField> CustomFields;                                      // 0x0058(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameAnalytics_AddBusinessEventIOSWithMergeFields) == 0x000008, "Wrong alignment on GameAnalytics_AddBusinessEventIOSWithMergeFields");
static_assert(sizeof(GameAnalytics_AddBusinessEventIOSWithMergeFields) == 0x000068, "Wrong size on GameAnalytics_AddBusinessEventIOSWithMergeFields");
static_assert(offsetof(GameAnalytics_AddBusinessEventIOSWithMergeFields, Currency) == 0x000000, "Member 'GameAnalytics_AddBusinessEventIOSWithMergeFields::Currency' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventIOSWithMergeFields, Amount) == 0x000010, "Member 'GameAnalytics_AddBusinessEventIOSWithMergeFields::Amount' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventIOSWithMergeFields, ItemType) == 0x000018, "Member 'GameAnalytics_AddBusinessEventIOSWithMergeFields::ItemType' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventIOSWithMergeFields, ItemId) == 0x000028, "Member 'GameAnalytics_AddBusinessEventIOSWithMergeFields::ItemId' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventIOSWithMergeFields, CartType) == 0x000038, "Member 'GameAnalytics_AddBusinessEventIOSWithMergeFields::CartType' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventIOSWithMergeFields, Receipt) == 0x000048, "Member 'GameAnalytics_AddBusinessEventIOSWithMergeFields::Receipt' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventIOSWithMergeFields, CustomFields) == 0x000058, "Member 'GameAnalytics_AddBusinessEventIOSWithMergeFields::CustomFields' has a wrong offset!");

// Function GameAnalytics.GameAnalytics.AddBusinessEventWithFields
// 0x0058 (0x0058 - 0x0000)
struct GameAnalytics_AddBusinessEventWithFields final
{
public:
	class FString                                 Currency;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Amount;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ItemType;                                          // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ItemId;                                            // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CartType;                                          // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGameAnalyticsCustomEventField> CustomFields;                                      // 0x0048(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameAnalytics_AddBusinessEventWithFields) == 0x000008, "Wrong alignment on GameAnalytics_AddBusinessEventWithFields");
static_assert(sizeof(GameAnalytics_AddBusinessEventWithFields) == 0x000058, "Wrong size on GameAnalytics_AddBusinessEventWithFields");
static_assert(offsetof(GameAnalytics_AddBusinessEventWithFields, Currency) == 0x000000, "Member 'GameAnalytics_AddBusinessEventWithFields::Currency' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventWithFields, Amount) == 0x000010, "Member 'GameAnalytics_AddBusinessEventWithFields::Amount' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventWithFields, ItemType) == 0x000018, "Member 'GameAnalytics_AddBusinessEventWithFields::ItemType' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventWithFields, ItemId) == 0x000028, "Member 'GameAnalytics_AddBusinessEventWithFields::ItemId' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventWithFields, CartType) == 0x000038, "Member 'GameAnalytics_AddBusinessEventWithFields::CartType' has a wrong offset!");
static_assert(offsetof(GameAnalytics_AddBusinessEventWithFields, CustomFields) == 0x000048, "Member 'GameAnalytics_AddBusinessEventWithFields::CustomFields' has a wrong offset!");

// Function GameAnalytics.GameAnalytics.AddBusinessEventWithMergeFields
// 0x0058 (0x0058 - 0x0000)
struct GameAnalytics_AddBusinessEventWithMergeFields final
{
public:
	class FString                                 Currency;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Amount;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ItemType;                                          // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ItemId;                                            // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CartType;                                          // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGameAnalyticsCustomEventField> CustomFields;                                      // 0x0048(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameAnalytics_AddBusinessEventWithMergeFields) == 0x000008, "Wrong alignment on GameAnalytics_AddBusinessEventWithMergeFields");
