#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameOverUI

#include "Basic.hpp"


namespace SDK::Params
{

// Function GameOverUI.GameOverUI_C.ExecuteUbergraph_GameOverUI
// 0x00A8 (0x00A8 - 0x0000)
struct GameOverUI_C_ExecuteUbergraph_GameOverUI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerCharacter_C*>             CallFunc_GetAllActorsOfClass_OutActors;            // 0x0008(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayerController_ReturnValue;      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARobberController_C*                    K2Node_DynamicCast_AsRobber_Controller;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class APlayerCharacter_C*>             CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x0088(0x0010)(ReferenceParm)
	class APlayerCharacter_C*                     CallFunc_Array_Get_Item;                           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GameOverUI_C_ExecuteUbergraph_GameOverUI) == 0x000008, "Wrong alignment on GameOverUI_C_ExecuteUbergraph_GameOverUI");
static_assert(sizeof(GameOverUI_C_ExecuteUbergraph_GameOverUI) == 0x0000A8, "Wrong size on GameOverUI_C_ExecuteUbergraph_GameOverUI");
static_assert(offsetof(GameOverUI_C_ExecuteUbergraph_GameOverUI, EntryPoint) == 0x000000, "Member 'GameOverUI_C_ExecuteUbergraph_GameOverUI::EntryPoint' has a wrong offset!");
static_assert(offsetof(GameOverUI_C_ExecuteUbergraph_GameOverUI, CallFunc_GetAllActorsOfClass_OutActors) == 0x000008, "Member 'GameOverUI_C_ExecuteUbergraph_GameOverUI::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(GameOverUI_C_ExecuteUbergraph_GameOverUI, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'GameOverUI_C_ExecuteUbergraph_GameOverUI::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameOverUI_C_ExecuteUbergraph_GameOverUI, CallFunc_Greater_IntInt_ReturnValue) == 0x00001C, "Member 'GameOverUI_C_ExecuteUbergraph_GameOverUI::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameOverUI_C_ExecuteUbergraph_GameOverUI, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'GameOverUI_C_ExecuteUbergraph_GameOverUI::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GameOverUI_C_ExecuteUbergraph_GameOverUI, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'GameOverUI_C_ExecuteUbergraph_GameOverUI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameOverUI_C_ExecuteUbergraph_GameOverUI, Temp_int_Array_Index_Variable) == 0x000028, "Member 'GameOverUI_C_ExecuteUbergraph_GameOverUI::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GameOverUI_C_ExecuteUbergraph_GameOverUI, CallFunc_IsServer_ReturnValue) == 0x00002C, "Member 'GameOverUI_C_ExecuteUbergraph_GameOverUI::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameOverUI_C_ExecuteUbergraph_GameOverUI, CallFunc_GetPlayerController_ReturnValue) == 0x000030, "Member 'GameOverUI_C_ExecuteUbergraph_GameOverUI::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameOverUI_C_ExecuteUbergraph_GameOverUI, CallFunc_IsLocalPlayerController_ReturnValue) == 0x000038, "Member 'GameOverUI_C_ExecuteUbergraph_GameOverUI::CallFunc_IsLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameOverUI_C_ExecuteUbergraph_GameOverUI, CallFunc_BooleanAND_ReturnValue) == 0x000039, "Member 'GameOverUI_C_ExecuteUbergraph_GameOverUI::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameOverUI_C_ExecuteUbergraph_GameOverUI, CallFunc_GetPlayerController_ReturnValue_1) == 0x000040, "Member 'GameOverUI_C_ExecuteUbergraph_GameOverUI::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GameOverUI_C_ExecuteUbergraph_GameOverUI, K2Node_DynamicCast_AsRobber_Controller) == 0x000048, "Member 'GameOverUI_C_ExecuteUbergraph_GameOverUI::K2Node_DynamicCast_AsRobber_Controller' has a wrong offset!");
static_assert(offsetof(GameOverUI_C_ExecuteUbergraph_GameOverUI, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'GameOverUI_C_ExecuteUbergraph_GameOverUI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GameOverUI_C_ExecuteUbergraph_GameOverUI, CallFunc_GetPlayerName_ReturnValue) == 0x000058, "Member 'GameOverUI_C_ExecuteUbergraph_GameOverUI::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameOverUI_C_ExecuteUbergraph_GameOverUI, CallFunc_Concat_StrStr_ReturnValue) == 0x000068, "Member 'GameOverUI_C_ExecuteUbergraph_GameOverUI::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameOverUI_C_ExecuteUbergraph_GameOverUI, Temp_bool_IsClosed_Variable) == 0x000078, "Member 'GameOverUI_C_ExecuteUbergraph_GameOverUI::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(GameOverUI_C_ExecuteUbergraph_GameOverUI, Temp_bool_Has_Been_Initd_Variable) == 0x000079, "Member 'GameOverUI_C_ExecuteUbergraph_GameOverUI::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(GameOverUI_C_ExecuteUbergraph_GameOverUI, CallFunc_GetPlayerController_ReturnValue_2) == 0x000080, "Member 'GameOverUI_C_ExecuteUbergraph_GameOverUI::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GameOverUI_C_ExecuteUbergraph_GameOverUI, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x000088, "Member 'GameOverUI_C_ExecuteUbergraph_GameOverUI::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");
static_assert(offsetof(GameOverUI_C_ExecuteUbergraph_GameOverUI, CallFunc_Array_Get_Item) == 0x000098, "Member 'GameOverUI_C_ExecuteUbergraph_GameOverUI::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GameOverUI_C_ExecuteUbergraph_GameOverUI, CallFunc_Array_Length_ReturnValue_1) == 0x0000A0, "Member 'GameOverUI_C_ExecuteUbergraph_GameOverUI::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GameOverUI_C_ExecuteUbergraph_GameOverUI, CallFunc_Less_IntInt_ReturnValue) == 0x0000A4, "Member 'GameOverUI_C_ExecuteUbergraph_GameOverUI::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function GameOverUI.GameOverUI_C.GetText_0
// 0x0078 (0x0078 - 0x0000)
struct GameOverUI_C_GetText_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0020(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0038(0x0018)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocalPlayerController_ReturnValue;      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0060(0x0018)()
};
static_assert(alignof(GameOverUI_C_GetText_0) == 0x000008, "Wrong alignment on GameOverUI_C_GetText_0");
static_assert(sizeof(GameOverUI_C_GetText_0) == 0x000078, "Wrong size on GameOverUI_C_GetText_0");
static_assert(offsetof(GameOverUI_C_GetText_0, ReturnValue) == 0x000000, "Member 'GameOverUI_C_GetText_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(GameOverUI_C_GetText_0, Temp_bool_Variable) == 0x000018, "Member 'GameOverUI_C_GetText_0::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GameOverUI_C_GetText_0, Temp_text_Variable) == 0x000020, "Member 'GameOverUI_C_GetText_0::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(GameOverUI_C_GetText_0, Temp_text_Variable_1) == 0x000038, "Member 'GameOverUI_C_GetText_0::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(GameOverUI_C_GetText_0, CallFunc_GetPlayerController_ReturnValue) == 0x000050, "Member 'GameOverUI_C_GetText_0::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameOverUI_C_GetText_0, CallFunc_IsServer_ReturnValue) == 0x000058, "Member 'GameOverUI_C_GetText_0::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameOverUI_C_GetText_0, CallFunc_IsLocalPlayerController_ReturnValue) == 0x000059, "Member 'GameOverUI_C_GetText_0::CallFunc_IsLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameOverUI_C_GetText_0, CallFunc_BooleanAND_ReturnValue) == 0x00005A, "Member 'GameOverUI_C_GetText_0::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameOverUI_C_GetText_0, K2Node_Select_Default) == 0x000060, "Member 'GameOverUI_C_GetText_0::K2Node_Select_Default' has a wrong offset!");

}

