#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GuardPhone

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GuardPhone.GuardPhone_C.ExecuteUbergraph_GuardPhone
// 0x0078 (0x0078 - 0x0000)
struct GuardPhone_C_ExecuteUbergraph_GuardPhone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_Player;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_Pickuplocation;         // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_ComponentBoundEvent_PickupRotation;         // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_ComponentBoundEvent_HitLocation;            // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_Text;                           // 0x0048(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0060(0x0018)()
};
static_assert(alignof(GuardPhone_C_ExecuteUbergraph_GuardPhone) == 0x000008, "Wrong alignment on GuardPhone_C_ExecuteUbergraph_GuardPhone");
static_assert(sizeof(GuardPhone_C_ExecuteUbergraph_GuardPhone) == 0x000078, "Wrong size on GuardPhone_C_ExecuteUbergraph_GuardPhone");
static_assert(offsetof(GuardPhone_C_ExecuteUbergraph_GuardPhone, EntryPoint) == 0x000000, "Member 'GuardPhone_C_ExecuteUbergraph_GuardPhone::EntryPoint' has a wrong offset!");
static_assert(offsetof(GuardPhone_C_ExecuteUbergraph_GuardPhone, K2Node_ComponentBoundEvent_Player) == 0x000008, "Member 'GuardPhone_C_ExecuteUbergraph_GuardPhone::K2Node_ComponentBoundEvent_Player' has a wrong offset!");
static_assert(offsetof(GuardPhone_C_ExecuteUbergraph_GuardPhone, K2Node_ComponentBoundEvent_Pickuplocation) == 0x000010, "Member 'GuardPhone_C_ExecuteUbergraph_GuardPhone::K2Node_ComponentBoundEvent_Pickuplocation' has a wrong offset!");
static_assert(offsetof(GuardPhone_C_ExecuteUbergraph_GuardPhone, K2Node_ComponentBoundEvent_PickupRotation) == 0x00001C, "Member 'GuardPhone_C_ExecuteUbergraph_GuardPhone::K2Node_ComponentBoundEvent_PickupRotation' has a wrong offset!");
static_assert(offsetof(GuardPhone_C_ExecuteUbergraph_GuardPhone, K2Node_ComponentBoundEvent_HitLocation) == 0x000028, "Member 'GuardPhone_C_ExecuteUbergraph_GuardPhone::K2Node_ComponentBoundEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(GuardPhone_C_ExecuteUbergraph_GuardPhone, CallFunc_Subtract_IntInt_ReturnValue) == 0x000034, "Member 'GuardPhone_C_ExecuteUbergraph_GuardPhone::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GuardPhone_C_ExecuteUbergraph_GuardPhone, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'GuardPhone_C_ExecuteUbergraph_GuardPhone::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GuardPhone_C_ExecuteUbergraph_GuardPhone, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00003C, "Member 'GuardPhone_C_ExecuteUbergraph_GuardPhone::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GuardPhone_C_ExecuteUbergraph_GuardPhone, K2Node_CustomEvent_Text) == 0x000048, "Member 'GuardPhone_C_ExecuteUbergraph_GuardPhone::K2Node_CustomEvent_Text' has a wrong offset!");
static_assert(offsetof(GuardPhone_C_ExecuteUbergraph_GuardPhone, CallFunc_Conv_IntToText_ReturnValue) == 0x000060, "Member 'GuardPhone_C_ExecuteUbergraph_GuardPhone::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function GuardPhone.GuardPhone_C.CountdownText
// 0x0018 (0x0018 - 0x0000)
struct GuardPhone_C_CountdownText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GuardPhone_C_CountdownText) == 0x000008, "Wrong alignment on GuardPhone_C_CountdownText");
static_assert(sizeof(GuardPhone_C_CountdownText) == 0x000018, "Wrong size on GuardPhone_C_CountdownText");
static_assert(offsetof(GuardPhone_C_CountdownText, Text) == 0x000000, "Member 'GuardPhone_C_CountdownText::Text' has a wrong offset!");

// Function GuardPhone.GuardPhone_C.BndEvt__GuardPhone_PickupItemComponent_K2Node_ComponentBoundEvent_0_PickUpItem__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct GuardPhone_C_BndEvt__GuardPhone_PickupItemComponent_K2Node_ComponentBoundEvent_0_PickUpItem__DelegateSignature final
{
public:
	class AActor*                                 Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Pickuplocation;                                    // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               PickupRotation;                                    // 0x0014(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                HitLocation;                                       // 0x0020(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GuardPhone_C_BndEvt__GuardPhone_PickupItemComponent_K2Node_ComponentBoundEvent_0_PickUpItem__DelegateSignature) == 0x000008, "Wrong alignment on GuardPhone_C_BndEvt__GuardPhone_PickupItemComponent_K2Node_ComponentBoundEvent_0_PickUpItem__DelegateSignature");
static_assert(sizeof(GuardPhone_C_BndEvt__GuardPhone_PickupItemComponent_K2Node_ComponentBoundEvent_0_PickUpItem__DelegateSignature) == 0x000030, "Wrong size on GuardPhone_C_BndEvt__GuardPhone_PickupItemComponent_K2Node_ComponentBoundEvent_0_PickUpItem__DelegateSignature");
static_assert(offsetof(GuardPhone_C_BndEvt__GuardPhone_PickupItemComponent_K2Node_ComponentBoundEvent_0_PickUpItem__DelegateSignature, Player) == 0x000000, "Member 'GuardPhone_C_BndEvt__GuardPhone_PickupItemComponent_K2Node_ComponentBoundEvent_0_PickUpItem__DelegateSignature::Player' has a wrong offset!");
static_assert(offsetof(GuardPhone_C_BndEvt__GuardPhone_PickupItemComponent_K2Node_ComponentBoundEvent_0_PickUpItem__DelegateSignature, Pickuplocation) == 0x000008, "Member 'GuardPhone_C_BndEvt__GuardPhone_PickupItemComponent_K2Node_ComponentBoundEvent_0_PickUpItem__DelegateSignature::Pickuplocation' has a wrong offset!");
static_assert(offsetof(GuardPhone_C_BndEvt__GuardPhone_PickupItemComponent_K2Node_ComponentBoundEvent_0_PickUpItem__DelegateSignature, PickupRotation) == 0x000014, "Member 'GuardPhone_C_BndEvt__GuardPhone_PickupItemComponent_K2Node_ComponentBoundEvent_0_PickUpItem__DelegateSignature::PickupRotation' has a wrong offset!");
static_assert(offsetof(GuardPhone_C_BndEvt__GuardPhone_PickupItemComponent_K2Node_ComponentBoundEvent_0_PickUpItem__DelegateSignature, HitLocation) == 0x000020, "Member 'GuardPhone_C_BndEvt__GuardPhone_PickupItemComponent_K2Node_ComponentBoundEvent_0_PickUpItem__DelegateSignature::HitLocation' has a wrong offset!");

}

