#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HeistCoins_Popup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HeistCoins_Popup.HeistCoins_Popup_C
// 0x0028 (0x0288 - 0x0260)
class UHeistCoins_Popup_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_1;                                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_94;                                      // 0x0278(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Amount;                                            // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_HeistCoins_Popup(int32 EntryPoint);
	void BndEvt__HeistCoins_Button_1_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	class FText GetText_0();
	struct FSlateBrush GetBrush_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HeistCoins_Popup_C">();
	}
	static class UHeistCoins_Popup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHeistCoins_Popup_C>();
	}
};
static_assert(alignof(UHeistCoins_Popup_C) == 0x000008, "Wrong alignment on UHeistCoins_Popup_C");
static_assert(sizeof(UHeistCoins_Popup_C) == 0x000288, "Wrong size on UHeistCoins_Popup_C");
static_assert(offsetof(UHeistCoins_Popup_C, UberGraphFrame) == 0x000260, "Member 'UHeistCoins_Popup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHeistCoins_Popup_C, Button_1) == 0x000268, "Member 'UHeistCoins_Popup_C::Button_1' has a wrong offset!");
static_assert(offsetof(UHeistCoins_Popup_C, Image_0) == 0x000270, "Member 'UHeistCoins_Popup_C::Image_0' has a wrong offset!");
static_assert(offsetof(UHeistCoins_Popup_C, TextBlock_94) == 0x000278, "Member 'UHeistCoins_Popup_C::TextBlock_94' has a wrong offset!");
static_assert(offsetof(UHeistCoins_Popup_C, Amount) == 0x000280, "Member 'UHeistCoins_Popup_C::Amount' has a wrong offset!");

}

