#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HighlightInRangeComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SpottedHighlightcomponent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass HighlightInRangeComponent.HighlightInRangeComponent_C
// 0x0010 (0x00D0 - 0x00C0)
class UHighlightInRangeComponent_C final : public USpottedHighlightcomponent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_HighlightInRangeComponent_C;        // 0x00C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         HighlightRange;                                    // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          MustBeVisible_;                                    // 0x00CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          IsHeld_;                                           // 0x00CD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          OnlyHighlightWhenHidden;                           // 0x00CE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_HighlightInRangeComponent(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HighlightInRangeComponent_C">();
	}
	static class UHighlightInRangeComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHighlightInRangeComponent_C>();
	}
};
static_assert(alignof(UHighlightInRangeComponent_C) == 0x000008, "Wrong alignment on UHighlightInRangeComponent_C");
static_assert(sizeof(UHighlightInRangeComponent_C) == 0x0000D0, "Wrong size on UHighlightInRangeComponent_C");
static_assert(offsetof(UHighlightInRangeComponent_C, UberGraphFrame_HighlightInRangeComponent_C) == 0x0000C0, "Member 'UHighlightInRangeComponent_C::UberGraphFrame_HighlightInRangeComponent_C' has a wrong offset!");
static_assert(offsetof(UHighlightInRangeComponent_C, HighlightRange) == 0x0000C8, "Member 'UHighlightInRangeComponent_C::HighlightRange' has a wrong offset!");
static_assert(offsetof(UHighlightInRangeComponent_C, MustBeVisible_) == 0x0000CC, "Member 'UHighlightInRangeComponent_C::MustBeVisible_' has a wrong offset!");
static_assert(offsetof(UHighlightInRangeComponent_C, IsHeld_) == 0x0000CD, "Member 'UHighlightInRangeComponent_C::IsHeld_' has a wrong offset!");
static_assert(offsetof(UHighlightInRangeComponent_C, OnlyHighlightWhenHidden) == 0x0000CE, "Member 'UHighlightInRangeComponent_C::OnlyHighlightWhenHidden' has a wrong offset!");

}

