#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HouseBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function HouseBase.HouseBase_C.UserConstructionScript
// 0x0050 (0x0050 - 0x0000)
struct HouseBase_C_UserConstructionScript final
{
public:
	class UStaticMesh*                            ThisRandomWall;                                    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           CallFunc_GetComponentsByTag_ReturnValue;           // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UStaticMesh*                            CallFunc_Array_Random_OutItem;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HouseBase_C_UserConstructionScript) == 0x000008, "Wrong alignment on HouseBase_C_UserConstructionScript");
static_assert(sizeof(HouseBase_C_UserConstructionScript) == 0x000050, "Wrong size on HouseBase_C_UserConstructionScript");
static_assert(offsetof(HouseBase_C_UserConstructionScript, ThisRandomWall) == 0x000000, "Member 'HouseBase_C_UserConstructionScript::ThisRandomWall' has a wrong offset!");
static_assert(offsetof(HouseBase_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000008, "Member 'HouseBase_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(HouseBase_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'HouseBase_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(HouseBase_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'HouseBase_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HouseBase_C_UserConstructionScript, CallFunc_GetComponentsByTag_ReturnValue) == 0x000018, "Member 'HouseBase_C_UserConstructionScript::CallFunc_GetComponentsByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(HouseBase_C_UserConstructionScript, CallFunc_Array_Random_OutItem) == 0x000028, "Member 'HouseBase_C_UserConstructionScript::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(HouseBase_C_UserConstructionScript, CallFunc_Array_Random_OutIndex) == 0x000030, "Member 'HouseBase_C_UserConstructionScript::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(HouseBase_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000038, "Member 'HouseBase_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(HouseBase_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000040, "Member 'HouseBase_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(HouseBase_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'HouseBase_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(HouseBase_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'HouseBase_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

