#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HUDUI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HUDUI.HUDUI_C
// 0x0118 (0x0378 - 0x0260)
class UHUDUI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       InstructionSwitch;                                 // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ExitWarningAreaAnim;                               // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       EnterWarningAreaAnim;                              // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HitmarkerAnim;                                     // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UProgressBar*                           ArmorHealth;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_41;                                         // 0x0290(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBackgroundBlur*                        DownedBlur;                                        // 0x0298(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GunSlot1;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GunSlot2;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Gunslot3;                                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HitmarkerImage;                                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_96;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_171;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_467;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImmunityVignette;                                  // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                PowerBoxProgressUI;                                // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PowerboxText;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_144;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RestrictedAreaText;                                // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_0;                                       // 0x0308(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_1;                                       // 0x0310(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_3;                                       // 0x0318(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_48;                                      // 0x0320(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_63;                                      // 0x0328(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_0;                                     // 0x0330(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class APlayerCharacter_C*                     OwnerPlayer;                                       // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         TotalTake;                                         // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARobberTruck_C*                         Truck;                                             // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARestrictedAreaVolume_C*                WarningArea;                                       // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WarningOnScreen_;                                  // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 InstructionText;                                   // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class APowerbox_C*                            Powerbox;                                          // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_HUDUI(int32 EntryPoint);
	void PowerboxSabotage();
	void PowerboxFinish();
	void ShowPowerboxProgress(class APowerbox_C* Powerbox_0);
	void BindPowerbox();
	void AnnounceNewInstructionWidget(const class FString& Title);
	void SetupGunIcons();
	void SwitchGunHighlight(int32 Number);
	void SetupBindSwitch();
	void EnterWarning(class ARestrictedAreaVolume_C* Area, bool Exit_);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void ChangeState(int32 State);
	void Hitmarker(const struct FLinearColor& Color);
	void Construct();
	void OverrideInstruction();
	void NewInstruction();
	class FText GetText_0();
	struct FLinearColor GetColorAndOpacity_0();
	ESlateVisibility Get_DownedBlur_Visibility_0();
	ESlateVisibility GetVisibility_0();
	ESlateVisibility GetVisibility_1();
	float Get_ArmorHealth_Percent_0();
	ESlateVisibility Get_ArmorHealth_Visibility_0();
	void SetStyle(class UTexture2D* Background_image, class UTexture2D* Fill_image);
	ESlateVisibility GetVisibility_2();
	class FText GetText_1();
	ESlateVisibility GetVisibility_3();
	class FText GetText_2();
	struct FSlateColor Get_RestrictedAreaText_ColorAndOpacity_0();
	ESlateVisibility LoadedGunVisibility();
	float GetPercent_0();
	ESlateVisibility Get_ImmunityVignette_Visibility_0();
	void GetCurrentInstruction(struct FInstructionStruct* Instruction);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HUDUI_C">();
	}
	static class UHUDUI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUDUI_C>();
	}
};
static_assert(alignof(UHUDUI_C) == 0x000008, "Wrong alignment on UHUDUI_C");
static_assert(sizeof(UHUDUI_C) == 0x000378, "Wrong size on UHUDUI_C");
static_assert(offsetof(UHUDUI_C, UberGraphFrame) == 0x000260, "Member 'UHUDUI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHUDUI_C, InstructionSwitch) == 0x000268, "Member 'UHUDUI_C::InstructionSwitch' has a wrong offset!");
static_assert(offsetof(UHUDUI_C, ExitWarningAreaAnim) == 0x000270, "Member 'UHUDUI_C::ExitWarningAreaAnim' has a wrong offset!");
static_assert(offsetof(UHUDUI_C, EnterWarningAreaAnim) == 0x000278, "Member 'UHUDUI_C::EnterWarningAreaAnim' has a wrong offset!");
static_assert(offsetof(UHUDUI_C, HitmarkerAnim) == 0x000280, "Member 'UHUDUI_C::HitmarkerAnim' has a wrong offset!");
static_assert(offsetof(UHUDUI_C, ArmorHealth) == 0x000288, "Member 'UHUDUI_C::ArmorHealth' has a wrong offset!");
static_assert(offsetof(UHUDUI_C, Border_41) == 0x000290, "Member 'UHUDUI_C::Border_41' has a wrong offset!");
static_assert(offsetof(UHUDUI_C, DownedBlur) == 0x000298, "Member 'UHUDUI_C::DownedBlur' has a wrong offset!");
static_assert(offsetof(UHUDUI_C, GunSlot1) == 0x0002A0, "Member 'UHUDUI_C::GunSlot1' has a wrong offset!");
static_assert(offsetof(UHUDUI_C, GunSlot2) == 0x0002A8, "Member 'UHUDUI_C::GunSlot2' has a wrong offset!");
static_assert(offsetof(UHUDUI_C, Gunslot3) == 0x0002B0, "Member 'UHUDUI_C::Gunslot3' has a wrong offset!");
static_assert(offsetof(UHUDUI_C, HitmarkerImage) == 0x0002B8, "Member 'UHUDUI_C::HitmarkerImage' has a wrong offset!");
static_assert(offsetof(UHUDUI_C, Image) == 0x0002C0, "Member 'UHUDUI_C::Image' has a wrong offset!");
static_assert(offsetof(UHUDUI_C, Image_96) == 0x0002C8, "Member 'UHUDUI_C::Image_96' has a wrong offset!");
static_assert(offsetof(UHUDUI_C, Image_171) == 0x0002D0, "Member 'UHUDUI_C::Image_171' has a wrong offset!");
static_assert(offsetof(UHUDUI_C, Image_467) == 0x0002D8, "Member 'UHUDUI_C::Image_467' has a wrong offset!");
static_assert(offsetof(UHUDUI_C, ImmunityVignette) == 0x0002E0, "Member 'UHUDUI_C::ImmunityVignette' has a wrong offset!");
static_assert(offsetof(UHUDUI_C, PowerBoxProgressUI) == 0x0002E8, "Member 'UHUDUI_C::PowerBoxProgressUI' has a wrong offset!");
static_assert(offsetof(UHUDUI_C, PowerboxText) == 0x0002F0, "Member 'UHUDUI_C::PowerboxText' has a wrong offset!");
static_assert(offsetof(UHUDUI_C, ProgressBar_144) == 0x0002F8, "Member 'UHUDUI_C::ProgressBar_144' has a wrong offset!");
static_assert(offsetof(UHUDUI_C, RestrictedAreaText) == 0x000300, "Member 'UHUDUI_C::RestrictedAreaText' has a wrong offset!");
static_assert(offsetof(UHUDUI_C, TextBlock_0) == 0x000308, "Member 'UHUDUI_C::TextBlock_0' has a wrong offset!");
static_assert(offsetof(UHUDUI_C, TextBlock_1) == 0x000310, "Member 'UHUDUI_C::TextBlock_1' has a wrong offset!");
static_assert(offsetof(UHUDUI_C, TextBlock_3) == 0x000318, "Member 'UHUDUI_C::TextBlock_3' has a wrong offset!");
static_assert(offsetof(UHUDUI_C, TextBlock_48) == 0x000320, "Member 'UHUDUI_C::TextBlock_48' has a wrong offset!");
static_assert(offsetof(UHUDUI_C, TextBlock_63) == 0x000328, "Member 'UHUDUI_C::TextBlock_63' has a wrong offset!");
static_assert(offsetof(UHUDUI_C, VerticalBox_0) == 0x000330, "Member 'UHUDUI_C::VerticalBox_0' has a wrong offset!");
static_assert(offsetof(UHUDUI_C, OwnerPlayer) == 0x000338, "Member 'UHUDUI_C::OwnerPlayer' has a wrong offset!");
static_assert(offsetof(UHUDUI_C, TotalTake) == 0x000340, "Member 'UHUDUI_C::TotalTake' has a wrong offset!");
static_assert(offsetof(UHUDUI_C, Truck) == 0x000348, "Member 'UHUDUI_C::Truck' has a wrong offset!");
static_assert(offsetof(UHUDUI_C, WarningArea) == 0x000350, "Member 'UHUDUI_C::WarningArea' has a wrong offset!");
static_assert(offsetof(UHUDUI_C, WarningOnScreen_) == 0x000358, "Member 'UHUDUI_C::WarningOnScreen_' has a wrong offset!");
static_assert(offsetof(UHUDUI_C, InstructionText) == 0x000360, "Member 'UHUDUI_C::InstructionText' has a wrong offset!");
static_assert(offsetof(UHUDUI_C, Powerbox) == 0x000370, "Member 'UHUDUI_C::Powerbox' has a wrong offset!");

}

