#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InstructionOverlapper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass InstructionOverlapper.InstructionOverlapper_C
// 0x0020 (0x0240 - 0x0220)
class AInstructionOverlapper_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UInstructioncomponent_C*                Instructioncomponent;                              // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ExecuteUbergraph_InstructionOverlapper(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"InstructionOverlapper_C">();
	}
	static class AInstructionOverlapper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AInstructionOverlapper_C>();
	}
};
static_assert(alignof(AInstructionOverlapper_C) == 0x000008, "Wrong alignment on AInstructionOverlapper_C");
static_assert(sizeof(AInstructionOverlapper_C) == 0x000240, "Wrong size on AInstructionOverlapper_C");
static_assert(offsetof(AInstructionOverlapper_C, UberGraphFrame) == 0x000220, "Member 'AInstructionOverlapper_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AInstructionOverlapper_C, Instructioncomponent) == 0x000228, "Member 'AInstructionOverlapper_C::Instructioncomponent' has a wrong offset!");
static_assert(offsetof(AInstructionOverlapper_C, Box) == 0x000230, "Member 'AInstructionOverlapper_C::Box' has a wrong offset!");
static_assert(offsetof(AInstructionOverlapper_C, DefaultSceneRoot) == 0x000238, "Member 'AInstructionOverlapper_C::DefaultSceneRoot' has a wrong offset!");

}

