#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InventoryItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "RarityNum_structs.hpp"
#include "ShopItemCategory_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass InventoryItem.InventoryItem_C
// 0x0030 (0x0290 - 0x0260)
class UInventoryItem_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ZoomOnItem;                                        // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_126;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Rarity;                                            // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_141;                                     // 0x0280(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 ItemInfo;                                          // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_InventoryItem(int32 EntryPoint);
	void OnDragCancelled(const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void PreviewItem(class UClass* ItemInfo_0, int32 SalePrice);
	void CancelDrag();
	void DragItemFromCategory(EShopItemCategory Category);
	void ChangeCategory(EShopItemCategory Category);
	void RemoveloadoutCategory();
	void RefreshInventory();
	void Remove();
	class FText GetText_0();
	void OnDragDetected(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation** Operation);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FSlateBrush GetBrush_0();
	struct FLinearColor Get_Rarity_ColorAndOpacity_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"InventoryItem_C">();
	}
	static class UInventoryItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInventoryItem_C>();
	}
};
static_assert(alignof(UInventoryItem_C) == 0x000008, "Wrong alignment on UInventoryItem_C");
static_assert(sizeof(UInventoryItem_C) == 0x000290, "Wrong size on UInventoryItem_C");
static_assert(offsetof(UInventoryItem_C, UberGraphFrame) == 0x000260, "Member 'UInventoryItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UInventoryItem_C, ZoomOnItem) == 0x000268, "Member 'UInventoryItem_C::ZoomOnItem' has a wrong offset!");
static_assert(offsetof(UInventoryItem_C, Image_126) == 0x000270, "Member 'UInventoryItem_C::Image_126' has a wrong offset!");
static_assert(offsetof(UInventoryItem_C, Rarity) == 0x000278, "Member 'UInventoryItem_C::Rarity' has a wrong offset!");
static_assert(offsetof(UInventoryItem_C, TextBlock_141) == 0x000280, "Member 'UInventoryItem_C::TextBlock_141' has a wrong offset!");
static_assert(offsetof(UInventoryItem_C, ItemInfo) == 0x000288, "Member 'UInventoryItem_C::ItemInfo' has a wrong offset!");

}

