#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JewelryStand

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass JewelryStand.JewelryStand_C
// 0x0048 (0x0268 - 0x0220)
class AJewelryStand_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ULookatInfoComponent_C*                 Lookatinfo;                                        // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractComponent_C*                   InteractComponent;                                 // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh;                                              // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            FilledMesh;                                        // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UStaticMesh*                            EmptyMesh;                                         // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UClass*                                 JewelryActor;                                      // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Istaken_;                                          // 0x0260(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void UserConstructionScript();
	void BndEvt__JewelryStand_InteractComponent_K2Node_ComponentBoundEvent_0_Interact__DelegateSignature(class AActor* Player, class UPrimitiveComponent* HitComponent);
	void SpawnJewelry(class APlayerCharacter_C* Player);
	void SetMesh();
	void ExecuteUbergraph_JewelryStand(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"JewelryStand_C">();
	}
	static class AJewelryStand_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJewelryStand_C>();
	}
};
static_assert(alignof(AJewelryStand_C) == 0x000008, "Wrong alignment on AJewelryStand_C");
static_assert(sizeof(AJewelryStand_C) == 0x000268, "Wrong size on AJewelryStand_C");
static_assert(offsetof(AJewelryStand_C, UberGraphFrame) == 0x000220, "Member 'AJewelryStand_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AJewelryStand_C, Lookatinfo) == 0x000228, "Member 'AJewelryStand_C::Lookatinfo' has a wrong offset!");
static_assert(offsetof(AJewelryStand_C, InteractComponent) == 0x000230, "Member 'AJewelryStand_C::InteractComponent' has a wrong offset!");
static_assert(offsetof(AJewelryStand_C, Mesh) == 0x000238, "Member 'AJewelryStand_C::Mesh' has a wrong offset!");
static_assert(offsetof(AJewelryStand_C, DefaultSceneRoot) == 0x000240, "Member 'AJewelryStand_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AJewelryStand_C, FilledMesh) == 0x000248, "Member 'AJewelryStand_C::FilledMesh' has a wrong offset!");
static_assert(offsetof(AJewelryStand_C, EmptyMesh) == 0x000250, "Member 'AJewelryStand_C::EmptyMesh' has a wrong offset!");
static_assert(offsetof(AJewelryStand_C, JewelryActor) == 0x000258, "Member 'AJewelryStand_C::JewelryActor' has a wrong offset!");
static_assert(offsetof(AJewelryStand_C, Istaken_) == 0x000260, "Member 'AJewelryStand_C::Istaken_' has a wrong offset!");

}

