#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoadoutUI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ShopItemCategory_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LoadoutUI.LoadoutUI_C
// 0x0098 (0x02F8 - 0x0260)
class ULoadoutUI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       MoveIn;                                            // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Appearence;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         CategoryBox_1;                                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEquippedInventorySlot_C*               EquippedInventorySlot;                             // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEquippedInventorySlot_C*               EquippedInventorySlot_1;                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEquippedInventorySlot_C*               EquippedInventorySlot_2;                           // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             InventoryScroll;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               InventoryWrap;                                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         LoadoutBox;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                LoadoutDown;                                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                LoadoutUp;                                         // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_3;                                       // 0x02C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Tools;                                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Weapons;                                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ARobberController_C*                    As_Robber_Controller;                              // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EShopItemCategory                             CurrentCategory;                                   // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EShopItemCategory>                     CurrentCatArray;                                   // 0x02E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_LoadoutUI(int32 EntryPoint);
	void ViewAppearance();
	void ViewTools();
	void BndEvt__LoadoutUI_LoadoutDown_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__LoadoutUI_LoadoutUp_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void UnhighlightAll();
	void HighlightButton(class UButton* Button);
	void ViewDefault();
	void AddCategories(const TArray<EShopItemCategory>& Categories);
	void ChangeCategory(EShopItemCategory Category);
	void ShowweaponUI();
	void HideLoadoutCategories();
	void RemoveAllWorldPostitionInventoryItems();
	void ShowInventoryCategory(EShopItemCategory Category);
	void BndEvt__LoadoutUI_Appearence_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__LoadoutUI_Weapons_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__LoadoutUI_Tools_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void RefreshInventory();
	void ShowFullInventory();
	void Remove();
	void Construct();
	void PreviewItem(class UClass* ItemInfo, int32 SalePrice);
	void CancelDrag();
	void DragItemFromCategory(EShopItemCategory Category);
	void RemoveloadoutCategory();
	class FText GetText_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LoadoutUI_C">();
	}
	static class ULoadoutUI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULoadoutUI_C>();
	}
};
static_assert(alignof(ULoadoutUI_C) == 0x000008, "Wrong alignment on ULoadoutUI_C");
static_assert(sizeof(ULoadoutUI_C) == 0x0002F8, "Wrong size on ULoadoutUI_C");
static_assert(offsetof(ULoadoutUI_C, UberGraphFrame) == 0x000260, "Member 'ULoadoutUI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULoadoutUI_C, MoveIn) == 0x000268, "Member 'ULoadoutUI_C::MoveIn' has a wrong offset!");
static_assert(offsetof(ULoadoutUI_C, Appearence) == 0x000270, "Member 'ULoadoutUI_C::Appearence' has a wrong offset!");
static_assert(offsetof(ULoadoutUI_C, CategoryBox_1) == 0x000278, "Member 'ULoadoutUI_C::CategoryBox_1' has a wrong offset!");
static_assert(offsetof(ULoadoutUI_C, EquippedInventorySlot) == 0x000280, "Member 'ULoadoutUI_C::EquippedInventorySlot' has a wrong offset!");
static_assert(offsetof(ULoadoutUI_C, EquippedInventorySlot_1) == 0x000288, "Member 'ULoadoutUI_C::EquippedInventorySlot_1' has a wrong offset!");
static_assert(offsetof(ULoadoutUI_C, EquippedInventorySlot_2) == 0x000290, "Member 'ULoadoutUI_C::EquippedInventorySlot_2' has a wrong offset!");
static_assert(offsetof(ULoadoutUI_C, InventoryScroll) == 0x000298, "Member 'ULoadoutUI_C::InventoryScroll' has a wrong offset!");
static_assert(offsetof(ULoadoutUI_C, InventoryWrap) == 0x0002A0, "Member 'ULoadoutUI_C::InventoryWrap' has a wrong offset!");
static_assert(offsetof(ULoadoutUI_C, LoadoutBox) == 0x0002A8, "Member 'ULoadoutUI_C::LoadoutBox' has a wrong offset!");
static_assert(offsetof(ULoadoutUI_C, LoadoutDown) == 0x0002B0, "Member 'ULoadoutUI_C::LoadoutDown' has a wrong offset!");
static_assert(offsetof(ULoadoutUI_C, LoadoutUp) == 0x0002B8, "Member 'ULoadoutUI_C::LoadoutUp' has a wrong offset!");
static_assert(offsetof(ULoadoutUI_C, TextBlock_3) == 0x0002C0, "Member 'ULoadoutUI_C::TextBlock_3' has a wrong offset!");
static_assert(offsetof(ULoadoutUI_C, Tools) == 0x0002C8, "Member 'ULoadoutUI_C::Tools' has a wrong offset!");
static_assert(offsetof(ULoadoutUI_C, Weapons) == 0x0002D0, "Member 'ULoadoutUI_C::Weapons' has a wrong offset!");
static_assert(offsetof(ULoadoutUI_C, As_Robber_Controller) == 0x0002D8, "Member 'ULoadoutUI_C::As_Robber_Controller' has a wrong offset!");
static_assert(offsetof(ULoadoutUI_C, CurrentCategory) == 0x0002E0, "Member 'ULoadoutUI_C::CurrentCategory' has a wrong offset!");
static_assert(offsetof(ULoadoutUI_C, CurrentCatArray) == 0x0002E8, "Member 'ULoadoutUI_C::CurrentCatArray' has a wrong offset!");

}

