#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoadoutUI

#include "Basic.hpp"

#include "ShopItemCategory_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function LoadoutUI.LoadoutUI_C.ExecuteUbergraph_LoadoutUI
// 0x0360 (0x0360 - 0x0000)
struct LoadoutUI_C_ExecuteUbergraph_LoadoutUI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULoadoutWeaponsUI_C*                    CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryCategoryTitle_C*              CallFunc_Create_ReturnValue_1;                     // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULoadoutToolsUI_C*                      CallFunc_Create_ReturnValue_2;                     // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryCategoryTitle_C*              CallFunc_Create_ReturnValue_3;                     // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EShopItemCategory                             K2Node_Event_Category_1;                           // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Event_ItemInfo;                             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SalePrice;                            // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARobberController_C*                    K2Node_DynamicCast_AsRobber_Controller;            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventoryItem_C*                       CallFunc_Create_ReturnValue_4;                     // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainMenuPlayer_C*                      K2Node_DynamicCast_AsMain_Menu_Player;             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainMenuPlayer_C*                      K2Node_DynamicCast_AsMain_Menu_Player_1;           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_2;         // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EShopItemCategory                             K2Node_CustomEvent_Category;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMainMenuPlayer_C*                      K2Node_DynamicCast_AsMain_Menu_Player_2;           // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         CallFunc_GetInventoryItemsInCategory_Inventory;    // 0x0110(0x0010)(ReferenceParm)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_Array_Get_Item;                           // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWorldPositionInventoryEquipSlot_C*> CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0138(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWorldPositionInventoryEquipSlot_C*     CallFunc_Array_Get_Item_1;                         // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryItem_C*                       CallFunc_Create_ReturnValue_5;                     // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUserWidget*>                    CallFunc_GetAllWidgetsWithInterface_FoundWidgets;  // 0x0178(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UUserWidget*                            CallFunc_Array_Get_Item_2;                         // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuUIInteraface_C>   K2Node_DynamicCast_AsMenu_UIInteraface;            // 0x0198(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AA[0x2];                                      // 0x01AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_6;                   // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_Array_Get_Item_3;                         // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EShopItemCategory                             K2Node_Event_Category;                             // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EShopItemCategory>                     K2Node_CustomEvent_Categories;                     // 0x01C0(0x0010)(ConstParm, ReferenceParm)
	EShopItemCategory                             CallFunc_Array_Get_Item_4;                         // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EShopItemCategory                             CallFunc_Array_Get_Item_5;                         // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D2[0x2];                                      // 0x01D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EShopItemCategory>                     K2Node_MakeArray_Array;                            // 0x01D8(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EShopItemCategory>                     K2Node_MakeArray_Array_1;                          // 0x01F0(0x0010)(ConstParm, ReferenceParm)
	class ULoadoutAppearanceUI_C*                 CallFunc_Create_ReturnValue_6;                     // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EShopItemCategory>                     K2Node_MakeArray_Array_2;                          // 0x0208(0x0010)(ConstParm, ReferenceParm)
	class UButton*                                K2Node_CustomEvent_Button;                         // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UButton*>                        K2Node_MakeArray_Array_3;                          // 0x0220(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UButton*                                CallFunc_Array_Get_Item_6;                         // 0x0238(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0248(0x0088)()
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x02D8(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2ED[0x3];                                      // 0x02ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_2;                   // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         CallFunc_GetInventoryItemsInCategory_Inventory_1;  // 0x02F8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_7;               // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x030C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30D[0x3];                                      // 0x030D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UShopCategoryTab_C*                     CallFunc_Create_ReturnValue_7;                     // 0x0310(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue_1;             // 0x0318(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item_7;                         // 0x0328(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_8;               // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryCategoryTitle_C*              K2Node_DynamicCast_AsInventory_Category_Title;     // 0x0338(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0342(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_343[0x1];                                      // 0x0343(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_6;                  // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_6;                // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349[0x3];                                      // 0x0349(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_3;                   // 0x0350(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_4;                   // 0x0358(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI) == 0x000008, "Wrong alignment on LoadoutUI_C_ExecuteUbergraph_LoadoutUI");
static_assert(sizeof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI) == 0x000360, "Wrong size on LoadoutUI_C_ExecuteUbergraph_LoadoutUI");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, EntryPoint) == 0x000000, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::EntryPoint' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, Temp_int_Array_Index_Variable) == 0x000004, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_Create_ReturnValue) == 0x000018, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, Temp_int_Loop_Counter_Variable_1) == 0x000020, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_Add_IntInt_ReturnValue_1) == 0x000024, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, Temp_int_Array_Index_Variable_2) == 0x000028, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, Temp_int_Loop_Counter_Variable_2) == 0x00002C, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_Add_IntInt_ReturnValue_2) == 0x000030, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_Create_ReturnValue_1) == 0x000038, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, Temp_int_Array_Index_Variable_3) == 0x000040, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, Temp_int_Loop_Counter_Variable_3) == 0x000044, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_Add_IntInt_ReturnValue_3) == 0x000048, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, Temp_int_Array_Index_Variable_4) == 0x00004C, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_Create_ReturnValue_2) == 0x000050, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, Temp_int_Loop_Counter_Variable_4) == 0x000058, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_Add_IntInt_ReturnValue_4) == 0x00005C, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, Temp_int_Array_Index_Variable_5) == 0x000060, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::Temp_int_Array_Index_Variable_5' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, Temp_int_Loop_Counter_Variable_5) == 0x000064, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::Temp_int_Loop_Counter_Variable_5' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_Add_IntInt_ReturnValue_5) == 0x000068, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_Create_ReturnValue_3) == 0x000070, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, K2Node_Event_Category_1) == 0x000078, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::K2Node_Event_Category_1' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, K2Node_Event_ItemInfo) == 0x000080, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::K2Node_Event_ItemInfo' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, K2Node_Event_SalePrice) == 0x000088, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::K2Node_Event_SalePrice' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_PlayAnimation_ReturnValue) == 0x000090, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_PlayAnimation_ReturnValue_1) == 0x000098, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_GetPlayerController_ReturnValue) == 0x0000A0, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, K2Node_DynamicCast_AsRobber_Controller) == 0x0000A8, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::K2Node_DynamicCast_AsRobber_Controller' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_Array_Length_ReturnValue) == 0x0000B4, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_Create_ReturnValue_4) == 0x0000B8, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_Create_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_GetPlayerCharacter_ReturnValue) == 0x0000C0, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, K2Node_DynamicCast_AsMain_Menu_Player) == 0x0000C8, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::K2Node_DynamicCast_AsMain_Menu_Player' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, K2Node_DynamicCast_bSuccess_1) == 0x0000D0, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_GetPlayerCharacter_ReturnValue_1) == 0x0000D8, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_GetPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, K2Node_DynamicCast_AsMain_Menu_Player_1) == 0x0000E0, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::K2Node_DynamicCast_AsMain_Menu_Player_1' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, K2Node_DynamicCast_bSuccess_2) == 0x0000E8, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_GetPlayerCharacter_ReturnValue_2) == 0x0000F0, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_GetPlayerCharacter_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, K2Node_CustomEvent_Category) == 0x0000F8, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::K2Node_CustomEvent_Category' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, K2Node_DynamicCast_AsMain_Menu_Player_2) == 0x000100, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::K2Node_DynamicCast_AsMain_Menu_Player_2' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, K2Node_DynamicCast_bSuccess_3) == 0x000108, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_GetInventoryItemsInCategory_Inventory) == 0x000110, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_GetInventoryItemsInCategory_Inventory' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_AddChild_ReturnValue) == 0x000120, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_Array_Get_Item) == 0x000128, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_Array_Length_ReturnValue_1) == 0x000130, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_Less_IntInt_ReturnValue) == 0x000134, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000138, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, Temp_bool_Has_Been_Initd_Variable) == 0x000148, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_Array_Get_Item_1) == 0x000150, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_Array_Length_ReturnValue_2) == 0x000158, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_Create_ReturnValue_5) == 0x000160, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_Create_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_Less_IntInt_ReturnValue_1) == 0x000168, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_AddChild_ReturnValue_1) == 0x000170, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_GetAllWidgetsWithInterface_FoundWidgets) == 0x000178, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_GetAllWidgetsWithInterface_FoundWidgets' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_Array_Get_Item_2) == 0x000188, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_Array_Length_ReturnValue_3) == 0x000190, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, K2Node_DynamicCast_AsMenu_UIInteraface) == 0x000198, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::K2Node_DynamicCast_AsMenu_UIInteraface' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, K2Node_DynamicCast_bSuccess_4) == 0x0001A8, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_Less_IntInt_ReturnValue_2) == 0x0001A9, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, Temp_int_Array_Index_Variable_6) == 0x0001AC, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::Temp_int_Array_Index_Variable_6' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_Array_Get_Item_3) == 0x0001B0, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, K2Node_Event_Category) == 0x0001B8, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::K2Node_Event_Category' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, K2Node_CustomEvent_Categories) == 0x0001C0, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::K2Node_CustomEvent_Categories' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_Array_Get_Item_4) == 0x0001D0, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_Array_Get_Item_5) == 0x0001D1, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_Array_Length_ReturnValue_4) == 0x0001D4, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, K2Node_MakeArray_Array) == 0x0001D8, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_Less_IntInt_ReturnValue_3) == 0x0001E8, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, K2Node_MakeArray_Array_1) == 0x0001F0, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_Create_ReturnValue_6) == 0x000200, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_Create_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, K2Node_MakeArray_Array_2) == 0x000208, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, K2Node_CustomEvent_Button) == 0x000218, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, K2Node_MakeArray_Array_3) == 0x000220, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, Temp_bool_IsClosed_Variable) == 0x000230, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_Array_Get_Item_6) == 0x000238, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_Array_Length_ReturnValue_5) == 0x000240, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, K2Node_MakeStruct_SlateBrush) == 0x000248, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_Less_IntInt_ReturnValue_4) == 0x0002D0, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_GetAllChildren_ReturnValue) == 0x0002D8, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_Array_Length_ReturnValue_6) == 0x0002E8, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_Array_Length_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_Greater_IntInt_ReturnValue) == 0x0002EC, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_AddChild_ReturnValue_2) == 0x0002F0, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_AddChild_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_GetInventoryItemsInCategory_Inventory_1) == 0x0002F8, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_GetInventoryItemsInCategory_Inventory_1' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_Array_Length_ReturnValue_7) == 0x000308, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_Array_Length_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_Greater_IntInt_ReturnValue_1) == 0x00030C, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_Create_ReturnValue_7) == 0x000310, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_Create_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_GetAllChildren_ReturnValue_1) == 0x000318, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_GetAllChildren_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_Array_Get_Item_7) == 0x000328, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_Array_Get_Item_7' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_Array_Length_ReturnValue_8) == 0x000330, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_Array_Length_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, K2Node_DynamicCast_AsInventory_Category_Title) == 0x000338, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::K2Node_DynamicCast_AsInventory_Category_Title' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, K2Node_DynamicCast_bSuccess_5) == 0x000340, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_Less_IntInt_ReturnValue_5) == 0x000341, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_Less_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000342, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, Temp_int_Loop_Counter_Variable_6) == 0x000344, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::Temp_int_Loop_Counter_Variable_6' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_Less_IntInt_ReturnValue_6) == 0x000348, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_Less_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_Add_IntInt_ReturnValue_6) == 0x00034C, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_Add_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_AddChild_ReturnValue_3) == 0x000350, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_AddChild_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_ExecuteUbergraph_LoadoutUI, CallFunc_AddChild_ReturnValue_4) == 0x000358, "Member 'LoadoutUI_C_ExecuteUbergraph_LoadoutUI::CallFunc_AddChild_ReturnValue_4' has a wrong offset!");

// Function LoadoutUI.LoadoutUI_C.HighlightButton
// 0x0008 (0x0008 - 0x0000)
struct LoadoutUI_C_HighlightButton final
{
public:
	class UButton*                                Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoadoutUI_C_HighlightButton) == 0x000008, "Wrong alignment on LoadoutUI_C_HighlightButton");
static_assert(sizeof(LoadoutUI_C_HighlightButton) == 0x000008, "Wrong size on LoadoutUI_C_HighlightButton");
static_assert(offsetof(LoadoutUI_C_HighlightButton, Button) == 0x000000, "Member 'LoadoutUI_C_HighlightButton::Button' has a wrong offset!");

// Function LoadoutUI.LoadoutUI_C.AddCategories
// 0x0010 (0x0010 - 0x0000)
struct LoadoutUI_C_AddCategories final
{
public:
	TArray<EShopItemCategory>                     Categories;                                        // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(LoadoutUI_C_AddCategories) == 0x000008, "Wrong alignment on LoadoutUI_C_AddCategories");
static_assert(sizeof(LoadoutUI_C_AddCategories) == 0x000010, "Wrong size on LoadoutUI_C_AddCategories");
static_assert(offsetof(LoadoutUI_C_AddCategories, Categories) == 0x000000, "Member 'LoadoutUI_C_AddCategories::Categories' has a wrong offset!");

// Function LoadoutUI.LoadoutUI_C.ChangeCategory
// 0x0001 (0x0001 - 0x0000)
struct LoadoutUI_C_ChangeCategory final
{
public:
	EShopItemCategory                             Category;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoadoutUI_C_ChangeCategory) == 0x000001, "Wrong alignment on LoadoutUI_C_ChangeCategory");
static_assert(sizeof(LoadoutUI_C_ChangeCategory) == 0x000001, "Wrong size on LoadoutUI_C_ChangeCategory");
static_assert(offsetof(LoadoutUI_C_ChangeCategory, Category) == 0x000000, "Member 'LoadoutUI_C_ChangeCategory::Category' has a wrong offset!");

// Function LoadoutUI.LoadoutUI_C.ShowInventoryCategory
// 0x0001 (0x0001 - 0x0000)
struct LoadoutUI_C_ShowInventoryCategory final
{
public:
	EShopItemCategory                             Category;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoadoutUI_C_ShowInventoryCategory) == 0x000001, "Wrong alignment on LoadoutUI_C_ShowInventoryCategory");
static_assert(sizeof(LoadoutUI_C_ShowInventoryCategory) == 0x000001, "Wrong size on LoadoutUI_C_ShowInventoryCategory");
static_assert(offsetof(LoadoutUI_C_ShowInventoryCategory, Category) == 0x000000, "Member 'LoadoutUI_C_ShowInventoryCategory::Category' has a wrong offset!");

// Function LoadoutUI.LoadoutUI_C.PreviewItem
// 0x0010 (0x0010 - 0x0000)
struct LoadoutUI_C_PreviewItem final
{
public:
	class UClass*                                 ItemInfo;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SalePrice;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoadoutUI_C_PreviewItem) == 0x000008, "Wrong alignment on LoadoutUI_C_PreviewItem");
static_assert(sizeof(LoadoutUI_C_PreviewItem) == 0x000010, "Wrong size on LoadoutUI_C_PreviewItem");
static_assert(offsetof(LoadoutUI_C_PreviewItem, ItemInfo) == 0x000000, "Member 'LoadoutUI_C_PreviewItem::ItemInfo' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_PreviewItem, SalePrice) == 0x000008, "Member 'LoadoutUI_C_PreviewItem::SalePrice' has a wrong offset!");

// Function LoadoutUI.LoadoutUI_C.DragItemFromCategory
// 0x0001 (0x0001 - 0x0000)
struct LoadoutUI_C_DragItemFromCategory final
{
public:
	EShopItemCategory                             Category;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoadoutUI_C_DragItemFromCategory) == 0x000001, "Wrong alignment on LoadoutUI_C_DragItemFromCategory");
static_assert(sizeof(LoadoutUI_C_DragItemFromCategory) == 0x000001, "Wrong size on LoadoutUI_C_DragItemFromCategory");
static_assert(offsetof(LoadoutUI_C_DragItemFromCategory, Category) == 0x000000, "Member 'LoadoutUI_C_DragItemFromCategory::Category' has a wrong offset!");

// Function LoadoutUI.LoadoutUI_C.GetText_0
// 0x0058 (0x0058 - 0x0000)
struct LoadoutUI_C_GetText_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0018)()
};
static_assert(alignof(LoadoutUI_C_GetText_0) == 0x000008, "Wrong alignment on LoadoutUI_C_GetText_0");
static_assert(sizeof(LoadoutUI_C_GetText_0) == 0x000058, "Wrong size on LoadoutUI_C_GetText_0");
static_assert(offsetof(LoadoutUI_C_GetText_0, ReturnValue) == 0x000000, "Member 'LoadoutUI_C_GetText_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_GetText_0, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'LoadoutUI_C_GetText_0::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_GetText_0, CallFunc_Conv_IntToString_ReturnValue) == 0x000020, "Member 'LoadoutUI_C_GetText_0::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoadoutUI_C_GetText_0, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'LoadoutUI_C_GetText_0::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
