#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MapPreviewUI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MapPreviewUI.MapPreviewUI_C
// 0x0070 (0x02D0 - 0x0260)
class UMapPreviewUI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_134;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                CoinBuyButton;                                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_124;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircularThrobber*                      LoadingBar;                                        // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MediaImage;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                PreviewMapButton;                                  // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_4;                                       // 0x0298(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_330;                                     // 0x02A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Vignette;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMediaPlayer*                           MediaPlayer;                                       // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 MapInfo;                                           // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UMapSelectUI_C*                         Parent;                                            // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         SalePrice;                                         // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MapPreviewUI(int32 EntryPoint);
	void BndEvt__MapPreviewUI_PreviewMapButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void BndEvt__MapPreviewUI_CoinBuyButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__MapPreviewUI_Button_134_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void MediaOpened(const class FString& OpenedUrl);
	class FText GetText_0();
	class FText GetText_1();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MapPreviewUI_C">();
	}
	static class UMapPreviewUI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMapPreviewUI_C>();
	}
};
static_assert(alignof(UMapPreviewUI_C) == 0x000008, "Wrong alignment on UMapPreviewUI_C");
static_assert(sizeof(UMapPreviewUI_C) == 0x0002D0, "Wrong size on UMapPreviewUI_C");
static_assert(offsetof(UMapPreviewUI_C, UberGraphFrame) == 0x000260, "Member 'UMapPreviewUI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMapPreviewUI_C, Button_134) == 0x000268, "Member 'UMapPreviewUI_C::Button_134' has a wrong offset!");
static_assert(offsetof(UMapPreviewUI_C, CoinBuyButton) == 0x000270, "Member 'UMapPreviewUI_C::CoinBuyButton' has a wrong offset!");
static_assert(offsetof(UMapPreviewUI_C, Image_124) == 0x000278, "Member 'UMapPreviewUI_C::Image_124' has a wrong offset!");
static_assert(offsetof(UMapPreviewUI_C, LoadingBar) == 0x000280, "Member 'UMapPreviewUI_C::LoadingBar' has a wrong offset!");
static_assert(offsetof(UMapPreviewUI_C, MediaImage) == 0x000288, "Member 'UMapPreviewUI_C::MediaImage' has a wrong offset!");
static_assert(offsetof(UMapPreviewUI_C, PreviewMapButton) == 0x000290, "Member 'UMapPreviewUI_C::PreviewMapButton' has a wrong offset!");
static_assert(offsetof(UMapPreviewUI_C, TextBlock_4) == 0x000298, "Member 'UMapPreviewUI_C::TextBlock_4' has a wrong offset!");
static_assert(offsetof(UMapPreviewUI_C, TextBlock_330) == 0x0002A0, "Member 'UMapPreviewUI_C::TextBlock_330' has a wrong offset!");
static_assert(offsetof(UMapPreviewUI_C, Vignette) == 0x0002A8, "Member 'UMapPreviewUI_C::Vignette' has a wrong offset!");
static_assert(offsetof(UMapPreviewUI_C, MediaPlayer) == 0x0002B0, "Member 'UMapPreviewUI_C::MediaPlayer' has a wrong offset!");
static_assert(offsetof(UMapPreviewUI_C, MapInfo) == 0x0002B8, "Member 'UMapPreviewUI_C::MapInfo' has a wrong offset!");
static_assert(offsetof(UMapPreviewUI_C, Parent) == 0x0002C0, "Member 'UMapPreviewUI_C::Parent' has a wrong offset!");
static_assert(offsetof(UMapPreviewUI_C, SalePrice) == 0x0002C8, "Member 'UMapPreviewUI_C::SalePrice' has a wrong offset!");

}

