#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MenuWeaponBoard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "ShopItemCategory_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MenuWeaponBoard.MenuWeaponBoard_C
// 0x00B0 (0x02D0 - 0x0220)
class AMenuWeaponBoard_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow;                                             // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   SecondaryWeapon;                                   // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   PrimaryWeapon;                                     // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ModifyingWeapon;                                   // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_258[0x8];                                      // 0x0258(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             DefaultPrimarylocation;                            // 0x0260(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTransform                             DefaultScondaryLocation;                           // 0x0290(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ModifyingWeapon_;                                  // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_MenuWeaponBoard(int32 EntryPoint);
	void ReceiveBeginPlay();
	void RemoveloadoutCategory();
	void Remove();
	void ModifyWeapon(class UClass* Info);
	void RefreshInventory();
	void LoadWeaponItems();
	void PreviewItem(class UClass* ItemInfo, int32 SalePrice);
	void CancelDrag();
	void DragItemFromCategory(EShopItemCategory Category);
	void ChangeCategory(EShopItemCategory Category);
	void UserConstructionScript();
	void FindGun(class UClass* Class_0, class AGunBase_C** Gun_actor, class UChildActorComponent** Child);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MenuWeaponBoard_C">();
	}
	static class AMenuWeaponBoard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMenuWeaponBoard_C>();
	}
};
static_assert(alignof(AMenuWeaponBoard_C) == 0x000010, "Wrong alignment on AMenuWeaponBoard_C");
static_assert(sizeof(AMenuWeaponBoard_C) == 0x0002D0, "Wrong size on AMenuWeaponBoard_C");
static_assert(offsetof(AMenuWeaponBoard_C, UberGraphFrame) == 0x000220, "Member 'AMenuWeaponBoard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AMenuWeaponBoard_C, Arrow) == 0x000228, "Member 'AMenuWeaponBoard_C::Arrow' has a wrong offset!");
static_assert(offsetof(AMenuWeaponBoard_C, SecondaryWeapon) == 0x000230, "Member 'AMenuWeaponBoard_C::SecondaryWeapon' has a wrong offset!");
static_assert(offsetof(AMenuWeaponBoard_C, PrimaryWeapon) == 0x000238, "Member 'AMenuWeaponBoard_C::PrimaryWeapon' has a wrong offset!");
static_assert(offsetof(AMenuWeaponBoard_C, StaticMesh) == 0x000240, "Member 'AMenuWeaponBoard_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AMenuWeaponBoard_C, DefaultSceneRoot) == 0x000248, "Member 'AMenuWeaponBoard_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AMenuWeaponBoard_C, ModifyingWeapon) == 0x000250, "Member 'AMenuWeaponBoard_C::ModifyingWeapon' has a wrong offset!");
static_assert(offsetof(AMenuWeaponBoard_C, DefaultPrimarylocation) == 0x000260, "Member 'AMenuWeaponBoard_C::DefaultPrimarylocation' has a wrong offset!");
static_assert(offsetof(AMenuWeaponBoard_C, DefaultScondaryLocation) == 0x000290, "Member 'AMenuWeaponBoard_C::DefaultScondaryLocation' has a wrong offset!");
static_assert(offsetof(AMenuWeaponBoard_C, ModifyingWeapon_) == 0x0002C0, "Member 'AMenuWeaponBoard_C::ModifyingWeapon_' has a wrong offset!");

}

