#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MenuPlayerPreview

#include "Basic.hpp"

#include "ShopItemCategory_structs.hpp"


namespace SDK::Params
{

// Function MenuPlayerPreview.MenuPlayerPreview_C.ExecuteUbergraph_MenuPlayerPreview
// 0x00A0 (0x00A0 - 0x0000)
struct MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EShopItemCategory                             K2Node_Event_Category_1;                           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EShopItemCategory                             K2Node_Event_Category;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Event_ItemInfo;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SalePrice;                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_Array_Get_Item_1;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARobberController_C*                    K2Node_DynamicCast_AsRobber_Controller;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerNameInfo_C*                      CallFunc_Create_ReturnValue;                       // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_Array_Get_Item_2;                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_Array_Get_Item_3;                         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsArmor_Light;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0074(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayLength_ReturnValue;                // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEmoteBPBase_C*                         K2Node_DynamicCast_AsEmote_BPBase;                 // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidClass_ReturnValue_1;               // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview) == 0x000008, "Wrong alignment on MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview");
static_assert(sizeof(MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview) == 0x0000A0, "Wrong size on MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview");
static_assert(offsetof(MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview, EntryPoint) == 0x000000, "Member 'MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview::EntryPoint' has a wrong offset!");
static_assert(offsetof(MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview, K2Node_Event_Category_1) == 0x000004, "Member 'MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview::K2Node_Event_Category_1' has a wrong offset!");
static_assert(offsetof(MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview, K2Node_Event_Category) == 0x000005, "Member 'MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview::K2Node_Event_Category' has a wrong offset!");
static_assert(offsetof(MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview, K2Node_Event_ItemInfo) == 0x000008, "Member 'MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview::K2Node_Event_ItemInfo' has a wrong offset!");
static_assert(offsetof(MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview, K2Node_Event_SalePrice) == 0x000010, "Member 'MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview::K2Node_Event_SalePrice' has a wrong offset!");
static_assert(offsetof(MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview, CallFunc_Array_Get_Item) == 0x000020, "Member 'MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview, CallFunc_IsValidClass_ReturnValue) == 0x000028, "Member 'MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000029, "Member 'MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview, CallFunc_HasAuthority_ReturnValue) == 0x00002A, "Member 'MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview, CallFunc_Array_Get_Item_1) == 0x000030, "Member 'MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview, CallFunc_GetController_ReturnValue) == 0x000038, "Member 'MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview, K2Node_DynamicCast_AsRobber_Controller) == 0x000040, "Member 'MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview::K2Node_DynamicCast_AsRobber_Controller' has a wrong offset!");
static_assert(offsetof(MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview, CallFunc_Create_ReturnValue) == 0x000050, "Member 'MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview, CallFunc_Array_Get_Item_2) == 0x000058, "Member 'MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview, CallFunc_Array_Get_Item_3) == 0x000060, "Member 'MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview, K2Node_ClassDynamicCast_AsArmor_Light) == 0x000068, "Member 'MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview::K2Node_ClassDynamicCast_AsArmor_Light' has a wrong offset!");
static_assert(offsetof(MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview, K2Node_ClassDynamicCast_bSuccess) == 0x000070, "Member 'MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview, K2Node_CreateDelegate_OutputDelegate) == 0x000074, "Member 'MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview, CallFunc_IsValid_ReturnValue_1) == 0x000084, "Member 'MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview, CallFunc_IsInViewport_ReturnValue) == 0x000085, "Member 'MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview, CallFunc_GetPlayLength_ReturnValue) == 0x000088, "Member 'MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview::CallFunc_GetPlayLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview, K2Node_DynamicCast_AsEmote_BPBase) == 0x000090, "Member 'MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview::K2Node_DynamicCast_AsEmote_BPBase' has a wrong offset!");
static_assert(offsetof(MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview, CallFunc_IsValid_ReturnValue_2) == 0x000099, "Member 'MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview, CallFunc_IsValidClass_ReturnValue_1) == 0x00009A, "Member 'MenuPlayerPreview_C_ExecuteUbergraph_MenuPlayerPreview::CallFunc_IsValidClass_ReturnValue_1' has a wrong offset!");

// Function MenuPlayerPreview.MenuPlayerPreview_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct MenuPlayerPreview_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MenuPlayerPreview_C_ReceiveTick) == 0x000004, "Wrong alignment on MenuPlayerPreview_C_ReceiveTick");
static_assert(sizeof(MenuPlayerPreview_C_ReceiveTick) == 0x000004, "Wrong size on MenuPlayerPreview_C_ReceiveTick");
static_assert(offsetof(MenuPlayerPreview_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'MenuPlayerPreview_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function MenuPlayerPreview.MenuPlayerPreview_C.PreviewItem
// 0x0010 (0x0010 - 0x0000)
struct MenuPlayerPreview_C_PreviewItem final
{
public:
	class UClass*                                 ItemInfo;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SalePrice;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MenuPlayerPreview_C_PreviewItem) == 0x000008, "Wrong alignment on MenuPlayerPreview_C_PreviewItem");
static_assert(sizeof(MenuPlayerPreview_C_PreviewItem) == 0x000010, "Wrong size on MenuPlayerPreview_C_PreviewItem");
static_assert(offsetof(MenuPlayerPreview_C_PreviewItem, ItemInfo) == 0x000000, "Member 'MenuPlayerPreview_C_PreviewItem::ItemInfo' has a wrong offset!");
static_assert(offsetof(MenuPlayerPreview_C_PreviewItem, SalePrice) == 0x000008, "Member 'MenuPlayerPreview_C_PreviewItem::SalePrice' has a wrong offset!");

// Function MenuPlayerPreview.MenuPlayerPreview_C.DragItemFromCategory
// 0x0001 (0x0001 - 0x0000)
struct MenuPlayerPreview_C_DragItemFromCategory final
{
public:
	EShopItemCategory                             Category;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MenuPlayerPreview_C_DragItemFromCategory) == 0x000001, "Wrong alignment on MenuPlayerPreview_C_DragItemFromCategory");
static_assert(sizeof(MenuPlayerPreview_C_DragItemFromCategory) == 0x000001, "Wrong size on MenuPlayerPreview_C_DragItemFromCategory");
static_assert(offsetof(MenuPlayerPreview_C_DragItemFromCategory, Category) == 0x000000, "Member 'MenuPlayerPreview_C_DragItemFromCategory::Category' has a wrong offset!");

// Function MenuPlayerPreview.MenuPlayerPreview_C.ChangeCategory
// 0x0001 (0x0001 - 0x0000)
struct MenuPlayerPreview_C_ChangeCategory final
{
public:
	EShopItemCategory                             Category;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MenuPlayerPreview_C_ChangeCategory) == 0x000001, "Wrong alignment on MenuPlayerPreview_C_ChangeCategory");
static_assert(sizeof(MenuPlayerPreview_C_ChangeCategory) == 0x000001, "Wrong size on MenuPlayerPreview_C_ChangeCategory");
static_assert(offsetof(MenuPlayerPreview_C_ChangeCategory, Category) == 0x000000, "Member 'MenuPlayerPreview_C_ChangeCategory::Category' has a wrong offset!");

}

