#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MenuCamera

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MenuCamera.MenuCamera_C
// 0x0028 (0x0248 - 0x0220)
class AMenuCamera_C final : public AActor
{
public:
	class UCameraComponent*                       Camera;                                            // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FString                                 Name_0;                                            // 0x0230(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         TransitionTime;                                    // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MenuCamera_C">();
	}
	static class AMenuCamera_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMenuCamera_C>();
	}
};
static_assert(alignof(AMenuCamera_C) == 0x000008, "Wrong alignment on AMenuCamera_C");
static_assert(sizeof(AMenuCamera_C) == 0x000248, "Wrong size on AMenuCamera_C");
static_assert(offsetof(AMenuCamera_C, Camera) == 0x000220, "Member 'AMenuCamera_C::Camera' has a wrong offset!");
static_assert(offsetof(AMenuCamera_C, DefaultSceneRoot) == 0x000228, "Member 'AMenuCamera_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AMenuCamera_C, Name_0) == 0x000230, "Member 'AMenuCamera_C::Name_0' has a wrong offset!");
static_assert(offsetof(AMenuCamera_C, TransitionTime) == 0x000240, "Member 'AMenuCamera_C::TransitionTime' has a wrong offset!");

}

