#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Money_base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PickupItem_base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Money_base.Money_base_C
// 0x0010 (0x0268 - 0x0258)
class AMoney_base_C final : public APickupItem_base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Money_base_C;                       // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         Value;                                             // 0x0260(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Exp;                                               // 0x0264(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Money_base(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Money_base_C">();
	}
	static class AMoney_base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMoney_base_C>();
	}
};
static_assert(alignof(AMoney_base_C) == 0x000008, "Wrong alignment on AMoney_base_C");
static_assert(sizeof(AMoney_base_C) == 0x000268, "Wrong size on AMoney_base_C");
static_assert(offsetof(AMoney_base_C, UberGraphFrame_Money_base_C) == 0x000258, "Member 'AMoney_base_C::UberGraphFrame_Money_base_C' has a wrong offset!");
static_assert(offsetof(AMoney_base_C, Value) == 0x000260, "Member 'AMoney_base_C::Value' has a wrong offset!");
static_assert(offsetof(AMoney_base_C, Exp) == 0x000264, "Member 'AMoney_base_C::Exp' has a wrong offset!");

}

