#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_Police_base

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function NPC_Police_base.NPC_Police_base_C.ExecuteUbergraph_NPC_Police_base
// 0x06E8 (0x06E8 - 0x0000)
struct NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_1;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0020(0x0010)(ConstParm, ReferenceParm)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x0038(0x0010)(ConstParm, ReferenceParm)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_ComponentBoundEvent_Pawn;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Target;                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IPoliceTargetInterface_C> K2Node_DynamicCast_AsPolice_Target_Interface;      // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckIfDowned__Downed_;                   // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPathFollowingResult                          Temp_byte_Variable_1;                              // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77[0x1];                                       // 0x0077(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Player;                         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APoliceGunBase_C*                       K2Node_DynamicCast_AsPolice_Gun_Base;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IPlayerInterface_C>    K2Node_DynamicCast_AsPlayer_Interface;             // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_2;               // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Radius;                         // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation; // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue; // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_FindNon_DownedPlayer_Player;              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindNon_DownedPlayer_Found_;              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIAsyncTaskBlueprintProxy*             CallFunc_CreateMoveToProxyObject_ReturnValue;      // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckIfPointIsOnPlayerLevel_OnLevel_;     // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F3[0x1];                                       // 0x00F3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Amount;                 // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_Bone;                   // 0x0104(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_HitLocation;            // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_StartLocation;          // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_Instigator;             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           CallFunc_GetComponentsByTag_ReturnValue;           // 0x0138(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          CallFunc_GetAIController_ReturnValue;              // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckCover_Will_take_cover_;              // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_CheckCover_Cover_location;                // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Location_1;                     // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0194(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIAsyncTaskBlueprintProxy*             CallFunc_CreateMoveToProxyObject_ReturnValue_1;    // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          CallFunc_GetAIController_ReturnValue_1;            // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               K2Node_CustomEvent_Rotation;                       // 0x01CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x01D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x01E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x01F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x0208(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0214(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x0220(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22D[0x3];                                      // 0x022D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_235[0x3];                                      // 0x0235(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0240(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x024C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0258(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x02E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E3[0x1];                                      // 0x02E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x02EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x02F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0304(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0310(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0330(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x034C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0358(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0364(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0365(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue_1;       // 0x0366(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_3;               // 0x0367(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_Bone;                           // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x0370(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x037C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x037D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x037E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37F[0x1];                                      // 0x037F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0380(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          CallFunc_GetAIController_ReturnValue_2;            // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_6;                  // 0x0419(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_7;                  // 0x041A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_8;                  // 0x041B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_9;                  // 0x041C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_10;                 // 0x041D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_11;                 // 0x041E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_12;                 // 0x041F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_421[0x3];                                      // 0x0421(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0434(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x043C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_44C[0x4];                                      // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0450(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0461(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_13;                 // 0x0462(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_463[0x1];                                      // 0x0463(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* Player)>         K2Node_CreateDelegate_OutputDelegate_4;            // 0x0464(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_474[0x4];                                      // 0x0474(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0478(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0488(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0494(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_495[0x3];                                      // 0x0495(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0498(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AAIController*                          CallFunc_GetAIController_ReturnValue_3;            // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue_1;     // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0529(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52A[0x2];                                      // 0x052A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x052C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0538(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit_1;                 // 0x0544(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue_1;            // 0x05CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x05CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x05CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5CF[0x1];                                      // 0x05CF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x05D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x05D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x05D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x05E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x05F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x05FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0618(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0628(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x062C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0630(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0634(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0640(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue_2;     // 0x064C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x064D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64E[0x2];                                      // 0x064E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0650(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_654[0x4];                                      // 0x0654(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0658(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x0660(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x066C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0678(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOverlappingActor_ReturnValue;           // 0x0679(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_67A[0x6];                                      // 0x067A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAllActorsWithInterface_OutActors;      // 0x0680(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0698(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69C[0x4];                                      // 0x069C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class INPCInterface_C>       K2Node_DynamicCast_AsNPCInterface;                 // 0x06A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x06B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x06B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x06B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B3[0x1];                                      // 0x06B3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x06B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x06B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B9[0x3];                                      // 0x06B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x06BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x06C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C1[0x7];                                      // 0x06C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGuardmanager_C*                        CallFunc_GetActorOfClass_ReturnValue;              // 0x06C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x06D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARobberGameState_C*                     K2Node_DynamicCast_AsRobber_Game_State;            // 0x06D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x06E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue_2;       // 0x06E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue_3;       // 0x06E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base) == 0x000008, "Wrong alignment on NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base");
static_assert(sizeof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base) == 0x0006E8, "Wrong size on NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, EntryPoint) == 0x000000, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::EntryPoint' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, K2Node_CustomEvent_MovementResult_1) == 0x000004, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::K2Node_CustomEvent_MovementResult_1' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, K2Node_CustomEvent_MovementResult) == 0x000005, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::K2Node_CustomEvent_MovementResult' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, Temp_byte_Variable) == 0x000018, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, Temp_object_Variable) == 0x000020, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, Temp_bool_Variable) == 0x000030, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, Temp_object_Variable_1) == 0x000038, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, Temp_bool_IsClosed_Variable) == 0x000048, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, K2Node_ComponentBoundEvent_Pawn) == 0x000050, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::K2Node_ComponentBoundEvent_Pawn' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, K2Node_CustomEvent_Target) == 0x000058, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, K2Node_DynamicCast_AsPolice_Target_Interface) == 0x000060, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::K2Node_DynamicCast_AsPolice_Target_Interface' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_IsValid_ReturnValue) == 0x000071, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_CheckIfDowned__Downed_) == 0x000072, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_CheckIfDowned__Downed_' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_DoesImplementInterface_ReturnValue) == 0x000073, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, Temp_byte_Variable_1) == 0x000074, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000075, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000076, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, K2Node_CustomEvent_Player) == 0x000078, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::K2Node_CustomEvent_Player' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, K2Node_DynamicCast_AsPolice_Gun_Base) == 0x000080, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::K2Node_DynamicCast_AsPolice_Gun_Base' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, K2Node_DynamicCast_AsPlayer_Interface) == 0x000090, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::K2Node_DynamicCast_AsPlayer_Interface' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, K2Node_DynamicCast_bSuccess_2) == 0x0000A0, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, K2Node_CustomEvent_MovementResult_2) == 0x0000A1, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::K2Node_CustomEvent_MovementResult_2' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, K2Node_CustomEvent_Radius) == 0x0000A4, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::K2Node_CustomEvent_Radius' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_IsValid_ReturnValue_1) == 0x0000A8, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000AC, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000BC, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation) == 0x0000C8, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue) == 0x0000D4, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_FindNon_DownedPlayer_Player) == 0x0000D8, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_FindNon_DownedPlayer_Player' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_FindNon_DownedPlayer_Found_) == 0x0000E0, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_FindNon_DownedPlayer_Found_' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_CreateMoveToProxyObject_ReturnValue) == 0x0000E8, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_CreateMoveToProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_IsValid_ReturnValue_2) == 0x0000F0, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_CheckIfPointIsOnPlayerLevel_OnLevel_) == 0x0000F1, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_CheckIfPointIsOnPlayerLevel_OnLevel_' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_IsValid_ReturnValue_3) == 0x0000F2, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000F4, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, K2Node_ComponentBoundEvent_Amount) == 0x000100, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::K2Node_ComponentBoundEvent_Amount' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, K2Node_ComponentBoundEvent_Bone) == 0x000104, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::K2Node_ComponentBoundEvent_Bone' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, K2Node_ComponentBoundEvent_HitLocation) == 0x00010C, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::K2Node_ComponentBoundEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, K2Node_ComponentBoundEvent_StartLocation) == 0x000118, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::K2Node_ComponentBoundEvent_StartLocation' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, K2Node_ComponentBoundEvent_Instigator) == 0x000128, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::K2Node_ComponentBoundEvent_Instigator' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, Temp_int_Array_Index_Variable) == 0x000130, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_GetComponentsByTag_ReturnValue) == 0x000138, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_GetComponentsByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_RandomUnitVector_ReturnValue) == 0x000148, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_Array_Length_ReturnValue) == 0x000154, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000158, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_RandomFloatInRange_ReturnValue) == 0x000164, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_GetAIController_ReturnValue) == 0x000168, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_GetAIController_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_CheckCover_Will_take_cover_) == 0x000170, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_CheckCover_Will_take_cover_' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_CheckCover_Cover_location) == 0x000174, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_CheckCover_Cover_location' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_BooleanOR_ReturnValue) == 0x000180, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, K2Node_CustomEvent_Location_1) == 0x000184, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::K2Node_CustomEvent_Location_1' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_BooleanOR_ReturnValue_1) == 0x000190, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, K2Node_CreateDelegate_OutputDelegate_2) == 0x000194, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_CreateMoveToProxyObject_ReturnValue_1) == 0x0001A8, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_CreateMoveToProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_IsValid_ReturnValue_4) == 0x0001B0, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_GetAIController_ReturnValue_1) == 0x0001B8, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_GetAIController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_K2_GetActorRotation_ReturnValue) == 0x0001C0, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, K2Node_CustomEvent_Rotation) == 0x0001CC, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::K2Node_CustomEvent_Rotation' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0001D8, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_RLerp_ReturnValue) == 0x0001E4, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_FindLookAtRotation_ReturnValue) == 0x0001F0, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_BreakRotator_Roll) == 0x0001FC, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_BreakRotator_Pitch) == 0x000200, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_BreakRotator_Yaw) == 0x000204, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_GetRightVector_ReturnValue) == 0x000208, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_MakeRotator_ReturnValue) == 0x000214, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_MakeRotFromX_ReturnValue) == 0x000220, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_K2_SetActorRotation_ReturnValue) == 0x00022C, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000230, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000234, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, Temp_int_Loop_Counter_Variable) == 0x000238, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_Add_IntInt_ReturnValue) == 0x00023C, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000240, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x00024C, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_LineTraceSingle_OutHit) == 0x000258, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_LineTraceSingle_ReturnValue) == 0x0002E0, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_BreakHitResult_bBlockingHit) == 0x0002E1, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_BreakHitResult_bInitialOverlap) == 0x0002E2, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_BreakHitResult_Time) == 0x0002E4, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_BreakHitResult_Distance) == 0x0002E8, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_BreakHitResult_Location) == 0x0002EC, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base, CallFunc_BreakHitResult_ImpactPoint) == 0x0002F8, "Member 'NPC_Police_base_C_ExecuteUbergraph_NPC_Police_base::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
