#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_Police_Juggernaut

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "NPC_Police_base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass NPC_Police_Juggernaut.NPC_Police_Juggernaut_C
// 0x0020 (0x0620 - 0x0600)
class ANPC_Police_Juggernaut_C final : public ANPC_Police_base_C
{
public:
	uint8                                         Pad_5F1[0x7];                                      // 0x05F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_NPC_Police_Juggernaut_C;            // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USteamStatComponent_C*                  SteamStatComponent1;                               // 0x0600(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Chr_Attach_Bombsuit_Helmet_02;                  // 0x0608(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Helmet;                                            // 0x0610(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Chr_Attach_Bombsuit_Helmet_01;                  // 0x0618(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_NPC_Police_Juggernaut(int32 EntryPoint);
	void OnDeathStats(class AActor* Player);
	void DestroyGlassMulti();
	void DestroyVisorGlass();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NPC_Police_Juggernaut_C">();
	}
	static class ANPC_Police_Juggernaut_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANPC_Police_Juggernaut_C>();
	}
};
static_assert(alignof(ANPC_Police_Juggernaut_C) == 0x000010, "Wrong alignment on ANPC_Police_Juggernaut_C");
static_assert(sizeof(ANPC_Police_Juggernaut_C) == 0x000620, "Wrong size on ANPC_Police_Juggernaut_C");
static_assert(offsetof(ANPC_Police_Juggernaut_C, UberGraphFrame_NPC_Police_Juggernaut_C) == 0x0005F8, "Member 'ANPC_Police_Juggernaut_C::UberGraphFrame_NPC_Police_Juggernaut_C' has a wrong offset!");
static_assert(offsetof(ANPC_Police_Juggernaut_C, SteamStatComponent1) == 0x000600, "Member 'ANPC_Police_Juggernaut_C::SteamStatComponent1' has a wrong offset!");
static_assert(offsetof(ANPC_Police_Juggernaut_C, SM_Chr_Attach_Bombsuit_Helmet_02) == 0x000608, "Member 'ANPC_Police_Juggernaut_C::SM_Chr_Attach_Bombsuit_Helmet_02' has a wrong offset!");
static_assert(offsetof(ANPC_Police_Juggernaut_C, Helmet) == 0x000610, "Member 'ANPC_Police_Juggernaut_C::Helmet' has a wrong offset!");
static_assert(offsetof(ANPC_Police_Juggernaut_C, SM_Chr_Attach_Bombsuit_Helmet_01) == 0x000618, "Member 'ANPC_Police_Juggernaut_C::SM_Chr_Attach_Bombsuit_Helmet_01' has a wrong offset!");

}

