#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_hair_base

#include "Basic.hpp"

#include "ClothingColorStruct_structs.hpp"


namespace SDK::Params
{

// Function NPC_hair_base.NPC_hair_base_C.ExecuteUbergraph_NPC_hair_base
// 0x0130 (0x0130 - 0x0000)
struct NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_255D[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_255E[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FClothingColorStruct                   CallFunc_Array_Get_Item;                           // 0x0020(0x0058)(HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_255F[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             CallFunc_Map_Keys_Keys;                            // 0x0080(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2560[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Array_Get_Item_1;                         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2561[0x3];                                     // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2562[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FClothingColorStruct                   CallFunc_Array_Get_Item_2;                         // 0x00B0(0x0058)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_3;                         // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             CallFunc_Map_Keys_Keys_1;                          // 0x0110(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2563[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Array_Get_Item_4;                         // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base) == 0x000008, "Wrong alignment on NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base");
static_assert(sizeof(NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base) == 0x000130, "Wrong size on NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base");
static_assert(offsetof(NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base, EntryPoint) == 0x000000, "Member 'NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base::EntryPoint' has a wrong offset!");
static_assert(offsetof(NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base, Temp_int_Array_Index_Variable) == 0x000004, "Member 'NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000014, "Member 'NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base, CallFunc_Array_Add_ReturnValue) == 0x000018, "Member 'NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base, CallFunc_Array_Get_Item) == 0x000020, "Member 'NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base, Temp_int_Loop_Counter_Variable_1) == 0x000078, "Member 'NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base, CallFunc_Map_Keys_Keys) == 0x000080, "Member 'NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base, CallFunc_Add_IntInt_ReturnValue_1) == 0x000090, "Member 'NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base, CallFunc_Array_Get_Item_1) == 0x000098, "Member 'NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000A0, "Member 'NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base, CallFunc_Array_Length_ReturnValue) == 0x0000A4, "Member 'NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base, CallFunc_Less_IntInt_ReturnValue) == 0x0000A8, "Member 'NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base, CallFunc_Array_Get_Item_2) == 0x0000B0, "Member 'NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base, CallFunc_Array_Get_Item_3) == 0x000108, "Member 'NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base, CallFunc_Array_Length_ReturnValue_1) == 0x00010C, "Member 'NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base, CallFunc_Map_Keys_Keys_1) == 0x000110, "Member 'NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base::CallFunc_Map_Keys_Keys_1' has a wrong offset!");
static_assert(offsetof(NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base, CallFunc_Less_IntInt_ReturnValue_1) == 0x000120, "Member 'NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base, CallFunc_Array_Get_Item_4) == 0x000128, "Member 'NPC_hair_base_C_ExecuteUbergraph_NPC_hair_base::CallFunc_Array_Get_Item_4' has a wrong offset!");

}

