#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPCClothing_base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ClothingColorStruct_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass NPCClothing_base.NPCClothing_base_C
// 0x0038 (0x0258 - 0x0220)
class ANPCClothing_base_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 ClothesMesh;                                       // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ACivilian_NPC_C*                        OwnerNPC;                                          // 0x0230(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<struct FClothingColorStruct>           ClothingColors;                                    // 0x0238(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	TArray<int32>                                 SelectedMats;                                      // 0x0248(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnInstance)

public:
	void SelectClothingColorRNG();
	void ReceiveBeginPlay();
	void DecideColors();
	void ApplyClothing();
	void SetCivOwner();
	void ExecuteUbergraph_NPCClothing_base(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NPCClothing_base_C">();
	}
	static class ANPCClothing_base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANPCClothing_base_C>();
	}
};
static_assert(alignof(ANPCClothing_base_C) == 0x000008, "Wrong alignment on ANPCClothing_base_C");
static_assert(sizeof(ANPCClothing_base_C) == 0x000258, "Wrong size on ANPCClothing_base_C");
static_assert(offsetof(ANPCClothing_base_C, UberGraphFrame) == 0x000220, "Member 'ANPCClothing_base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ANPCClothing_base_C, ClothesMesh) == 0x000228, "Member 'ANPCClothing_base_C::ClothesMesh' has a wrong offset!");
static_assert(offsetof(ANPCClothing_base_C, OwnerNPC) == 0x000230, "Member 'ANPCClothing_base_C::OwnerNPC' has a wrong offset!");
static_assert(offsetof(ANPCClothing_base_C, ClothingColors) == 0x000238, "Member 'ANPCClothing_base_C::ClothingColors' has a wrong offset!");
static_assert(offsetof(ANPCClothing_base_C, SelectedMats) == 0x000248, "Member 'ANPCClothing_base_C::SelectedMats' has a wrong offset!");

}

