#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OfficeBuilding_Square

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass OfficeBuilding_Square.OfficeBuilding_Square_C
// 0x0080 (0x02A0 - 0x0220)
class AOfficeBuilding_Square_C final : public AActor
{
public:
	class UInstancedStaticMeshComponent*          BuildingBaseInstance;                              // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh19;                                      // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh18;                                      // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh17;                                      // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh14;                                      // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh11;                                      // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh15;                                      // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh12;                                      // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh10;                                      // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh9;                                       // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh8;                                       // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh7;                                       // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SidewalkLeft4;                                     // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh3;                                       // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Floors;                                            // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OfficeBuilding_Square_C">();
	}
	static class AOfficeBuilding_Square_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AOfficeBuilding_Square_C>();
	}
};
static_assert(alignof(AOfficeBuilding_Square_C) == 0x000008, "Wrong alignment on AOfficeBuilding_Square_C");
static_assert(sizeof(AOfficeBuilding_Square_C) == 0x0002A0, "Wrong size on AOfficeBuilding_Square_C");
static_assert(offsetof(AOfficeBuilding_Square_C, BuildingBaseInstance) == 0x000220, "Member 'AOfficeBuilding_Square_C::BuildingBaseInstance' has a wrong offset!");
static_assert(offsetof(AOfficeBuilding_Square_C, StaticMesh19) == 0x000228, "Member 'AOfficeBuilding_Square_C::StaticMesh19' has a wrong offset!");
static_assert(offsetof(AOfficeBuilding_Square_C, StaticMesh18) == 0x000230, "Member 'AOfficeBuilding_Square_C::StaticMesh18' has a wrong offset!");
static_assert(offsetof(AOfficeBuilding_Square_C, StaticMesh17) == 0x000238, "Member 'AOfficeBuilding_Square_C::StaticMesh17' has a wrong offset!");
static_assert(offsetof(AOfficeBuilding_Square_C, StaticMesh14) == 0x000240, "Member 'AOfficeBuilding_Square_C::StaticMesh14' has a wrong offset!");
static_assert(offsetof(AOfficeBuilding_Square_C, StaticMesh11) == 0x000248, "Member 'AOfficeBuilding_Square_C::StaticMesh11' has a wrong offset!");
static_assert(offsetof(AOfficeBuilding_Square_C, StaticMesh15) == 0x000250, "Member 'AOfficeBuilding_Square_C::StaticMesh15' has a wrong offset!");
static_assert(offsetof(AOfficeBuilding_Square_C, StaticMesh12) == 0x000258, "Member 'AOfficeBuilding_Square_C::StaticMesh12' has a wrong offset!");
static_assert(offsetof(AOfficeBuilding_Square_C, StaticMesh10) == 0x000260, "Member 'AOfficeBuilding_Square_C::StaticMesh10' has a wrong offset!");
static_assert(offsetof(AOfficeBuilding_Square_C, StaticMesh9) == 0x000268, "Member 'AOfficeBuilding_Square_C::StaticMesh9' has a wrong offset!");
static_assert(offsetof(AOfficeBuilding_Square_C, StaticMesh8) == 0x000270, "Member 'AOfficeBuilding_Square_C::StaticMesh8' has a wrong offset!");
static_assert(offsetof(AOfficeBuilding_Square_C, StaticMesh7) == 0x000278, "Member 'AOfficeBuilding_Square_C::StaticMesh7' has a wrong offset!");
static_assert(offsetof(AOfficeBuilding_Square_C, SidewalkLeft4) == 0x000280, "Member 'AOfficeBuilding_Square_C::SidewalkLeft4' has a wrong offset!");
static_assert(offsetof(AOfficeBuilding_Square_C, StaticMesh3) == 0x000288, "Member 'AOfficeBuilding_Square_C::StaticMesh3' has a wrong offset!");
static_assert(offsetof(AOfficeBuilding_Square_C, DefaultSceneRoot) == 0x000290, "Member 'AOfficeBuilding_Square_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AOfficeBuilding_Square_C, Floors) == 0x000298, "Member 'AOfficeBuilding_Square_C::Floors' has a wrong offset!");

}

