#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ParkingLot

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ParkingLot.ParkingLot_C
// 0x0118 (0x0338 - 0x0220)
class AParkingLot_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SM_Env_Sidewalk_Straight_48_StaticMeshComponent0;  // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Env_Sidewalk_Straight_47_StaticMeshComponent0;  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Env_Sidewalk_Straight_4_StaticMeshComponent0;   // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Env_Sidewalk_Straight_15_StaticMeshComponent0;  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Env_Sidewalk_Straight_26_StaticMeshComponent0;  // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Env_Sidewalk_Straight_24_StaticMeshComponent0;  // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Env_Sidewalk_Straight_19_StaticMeshComponent0;  // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Env_Sidewalk_Straight_20_StaticMeshComponent0;  // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Env_Sidewalk_Straight_21_StaticMeshComponent0;  // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Env_Sidewalk_Straight_22_StaticMeshComponent0;  // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Env_Sidewalk_Straight_23_StaticMeshComponent0;  // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Env_Sidewalk_Straight_34_StaticMeshComponent0;  // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Env_Sidewalk_Straight_33_StaticMeshComponent0;  // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Env_Sidewalk_Straight_12_StaticMeshComponent0;  // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Env_Sidewalk_Straight_11_StaticMeshComponent0;  // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Env_Sidewalk_Straight_38_StaticMeshComponent0;  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Env_Sidewalk_Straight_37_StaticMeshComponent0;  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Env_Sidewalk_Straight_36_StaticMeshComponent0;  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Env_Sidewalk_Straight_35_StaticMeshComponent0;  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Env_Sidewalk_Straight_43_StaticMeshComponent0;  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Env_Sidewalk_Straight_44_StaticMeshComponent0;  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Env_Sidewalk_Straight_45_StaticMeshComponent0;  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Env_Sidewalk_Straight_46_StaticMeshComponent0;  // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Env_Sidewalk_Straight_10_StaticMeshComponent0;  // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Env_Sidewalk_Straight_9_StaticMeshComponent0;   // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Env_Sidewalk_Straight_8_StaticMeshComponent0;   // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Env_Sidewalk_Straight_42_StaticMeshComponent0;  // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Env_Sidewalk_Straight_41_StaticMeshComponent0;  // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Env_Sidewalk_Straight_40_StaticMeshComponent0;  // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Env_Sidewalk_Straight_39_StaticMeshComponent0;  // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Env_Sidewalk_Straight_5_StaticMeshComponent0;   // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Env_Sidewalk_Straight_6_StaticMeshComponent0;   // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Env_Sidewalk_Straight_7_StaticMeshComponent0;   // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Env_Sidewalk_Straight_14_StaticMeshComponent0;  // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ParkingLot_C">();
	}
	static class AParkingLot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AParkingLot_C>();
	}
};
static_assert(alignof(AParkingLot_C) == 0x000008, "Wrong alignment on AParkingLot_C");
static_assert(sizeof(AParkingLot_C) == 0x000338, "Wrong size on AParkingLot_C");
static_assert(offsetof(AParkingLot_C, SM_Env_Sidewalk_Straight_48_StaticMeshComponent0) == 0x000220, "Member 'AParkingLot_C::SM_Env_Sidewalk_Straight_48_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AParkingLot_C, SM_Env_Sidewalk_Straight_47_StaticMeshComponent0) == 0x000228, "Member 'AParkingLot_C::SM_Env_Sidewalk_Straight_47_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AParkingLot_C, SM_Env_Sidewalk_Straight_4_StaticMeshComponent0) == 0x000230, "Member 'AParkingLot_C::SM_Env_Sidewalk_Straight_4_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AParkingLot_C, SM_Env_Sidewalk_Straight_15_StaticMeshComponent0) == 0x000238, "Member 'AParkingLot_C::SM_Env_Sidewalk_Straight_15_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AParkingLot_C, SM_Env_Sidewalk_Straight_26_StaticMeshComponent0) == 0x000240, "Member 'AParkingLot_C::SM_Env_Sidewalk_Straight_26_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AParkingLot_C, SM_Env_Sidewalk_Straight_24_StaticMeshComponent0) == 0x000248, "Member 'AParkingLot_C::SM_Env_Sidewalk_Straight_24_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AParkingLot_C, SM_Env_Sidewalk_Straight_19_StaticMeshComponent0) == 0x000250, "Member 'AParkingLot_C::SM_Env_Sidewalk_Straight_19_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AParkingLot_C, SM_Env_Sidewalk_Straight_20_StaticMeshComponent0) == 0x000258, "Member 'AParkingLot_C::SM_Env_Sidewalk_Straight_20_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AParkingLot_C, SM_Env_Sidewalk_Straight_21_StaticMeshComponent0) == 0x000260, "Member 'AParkingLot_C::SM_Env_Sidewalk_Straight_21_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AParkingLot_C, SM_Env_Sidewalk_Straight_22_StaticMeshComponent0) == 0x000268, "Member 'AParkingLot_C::SM_Env_Sidewalk_Straight_22_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AParkingLot_C, SM_Env_Sidewalk_Straight_23_StaticMeshComponent0) == 0x000270, "Member 'AParkingLot_C::SM_Env_Sidewalk_Straight_23_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AParkingLot_C, SM_Env_Sidewalk_Straight_34_StaticMeshComponent0) == 0x000278, "Member 'AParkingLot_C::SM_Env_Sidewalk_Straight_34_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AParkingLot_C, SM_Env_Sidewalk_Straight_33_StaticMeshComponent0) == 0x000280, "Member 'AParkingLot_C::SM_Env_Sidewalk_Straight_33_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AParkingLot_C, SM_Env_Sidewalk_Straight_12_StaticMeshComponent0) == 0x000288, "Member 'AParkingLot_C::SM_Env_Sidewalk_Straight_12_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AParkingLot_C, SM_Env_Sidewalk_Straight_11_StaticMeshComponent0) == 0x000290, "Member 'AParkingLot_C::SM_Env_Sidewalk_Straight_11_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AParkingLot_C, SM_Env_Sidewalk_Straight_38_StaticMeshComponent0) == 0x000298, "Member 'AParkingLot_C::SM_Env_Sidewalk_Straight_38_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AParkingLot_C, SM_Env_Sidewalk_Straight_37_StaticMeshComponent0) == 0x0002A0, "Member 'AParkingLot_C::SM_Env_Sidewalk_Straight_37_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AParkingLot_C, SM_Env_Sidewalk_Straight_36_StaticMeshComponent0) == 0x0002A8, "Member 'AParkingLot_C::SM_Env_Sidewalk_Straight_36_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AParkingLot_C, SM_Env_Sidewalk_Straight_35_StaticMeshComponent0) == 0x0002B0, "Member 'AParkingLot_C::SM_Env_Sidewalk_Straight_35_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AParkingLot_C, SM_Env_Sidewalk_Straight_43_StaticMeshComponent0) == 0x0002B8, "Member 'AParkingLot_C::SM_Env_Sidewalk_Straight_43_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AParkingLot_C, SM_Env_Sidewalk_Straight_44_StaticMeshComponent0) == 0x0002C0, "Member 'AParkingLot_C::SM_Env_Sidewalk_Straight_44_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AParkingLot_C, SM_Env_Sidewalk_Straight_45_StaticMeshComponent0) == 0x0002C8, "Member 'AParkingLot_C::SM_Env_Sidewalk_Straight_45_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AParkingLot_C, SM_Env_Sidewalk_Straight_46_StaticMeshComponent0) == 0x0002D0, "Member 'AParkingLot_C::SM_Env_Sidewalk_Straight_46_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AParkingLot_C, SM_Env_Sidewalk_Straight_10_StaticMeshComponent0) == 0x0002D8, "Member 'AParkingLot_C::SM_Env_Sidewalk_Straight_10_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AParkingLot_C, SM_Env_Sidewalk_Straight_9_StaticMeshComponent0) == 0x0002E0, "Member 'AParkingLot_C::SM_Env_Sidewalk_Straight_9_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AParkingLot_C, SM_Env_Sidewalk_Straight_8_StaticMeshComponent0) == 0x0002E8, "Member 'AParkingLot_C::SM_Env_Sidewalk_Straight_8_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AParkingLot_C, SM_Env_Sidewalk_Straight_42_StaticMeshComponent0) == 0x0002F0, "Member 'AParkingLot_C::SM_Env_Sidewalk_Straight_42_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AParkingLot_C, SM_Env_Sidewalk_Straight_41_StaticMeshComponent0) == 0x0002F8, "Member 'AParkingLot_C::SM_Env_Sidewalk_Straight_41_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AParkingLot_C, SM_Env_Sidewalk_Straight_40_StaticMeshComponent0) == 0x000300, "Member 'AParkingLot_C::SM_Env_Sidewalk_Straight_40_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AParkingLot_C, SM_Env_Sidewalk_Straight_39_StaticMeshComponent0) == 0x000308, "Member 'AParkingLot_C::SM_Env_Sidewalk_Straight_39_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AParkingLot_C, SM_Env_Sidewalk_Straight_5_StaticMeshComponent0) == 0x000310, "Member 'AParkingLot_C::SM_Env_Sidewalk_Straight_5_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AParkingLot_C, SM_Env_Sidewalk_Straight_6_StaticMeshComponent0) == 0x000318, "Member 'AParkingLot_C::SM_Env_Sidewalk_Straight_6_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AParkingLot_C, SM_Env_Sidewalk_Straight_7_StaticMeshComponent0) == 0x000320, "Member 'AParkingLot_C::SM_Env_Sidewalk_Straight_7_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AParkingLot_C, SM_Env_Sidewalk_Straight_14_StaticMeshComponent0) == 0x000328, "Member 'AParkingLot_C::SM_Env_Sidewalk_Straight_14_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AParkingLot_C, SharedRoot) == 0x000330, "Member 'AParkingLot_C::SharedRoot' has a wrong offset!");

}

