#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Park_Side2

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Park_Side2.Park_Side2_C
// 0x0120 (0x0340 - 0x0220)
class APark_Side2_C final : public AActor
{
public:
	class UStaticMeshComponent*                   StaticMesh58;                                      // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh57;                                      // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh56;                                      // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh55;                                      // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh17;                                      // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh16;                                      // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh14;                                      // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh25;                                      // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh8;                                       // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh54;                                      // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh53;                                      // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh52;                                      // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh51;                                      // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh50;                                      // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh49;                                      // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh45;                                      // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh27;                                      // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh36;                                      // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh35;                                      // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh34;                                      // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh33;                                      // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh32;                                      // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh24;                                      // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh23;                                      // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh21;                                      // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh15;                                      // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh13;                                      // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh12;                                      // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh9;                                       // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh7;                                       // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SidewalkLeft4;                                     // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SidewalkLeft2;                                     // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh3;                                       // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh2;                                       // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SidewalkLeft1;                                     // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Park_Side2_C">();
	}
	static class APark_Side2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APark_Side2_C>();
	}
};
static_assert(alignof(APark_Side2_C) == 0x000008, "Wrong alignment on APark_Side2_C");
static_assert(sizeof(APark_Side2_C) == 0x000340, "Wrong size on APark_Side2_C");
static_assert(offsetof(APark_Side2_C, StaticMesh58) == 0x000220, "Member 'APark_Side2_C::StaticMesh58' has a wrong offset!");
static_assert(offsetof(APark_Side2_C, StaticMesh57) == 0x000228, "Member 'APark_Side2_C::StaticMesh57' has a wrong offset!");
static_assert(offsetof(APark_Side2_C, StaticMesh56) == 0x000230, "Member 'APark_Side2_C::StaticMesh56' has a wrong offset!");
static_assert(offsetof(APark_Side2_C, StaticMesh55) == 0x000238, "Member 'APark_Side2_C::StaticMesh55' has a wrong offset!");
static_assert(offsetof(APark_Side2_C, StaticMesh17) == 0x000240, "Member 'APark_Side2_C::StaticMesh17' has a wrong offset!");
static_assert(offsetof(APark_Side2_C, StaticMesh16) == 0x000248, "Member 'APark_Side2_C::StaticMesh16' has a wrong offset!");
static_assert(offsetof(APark_Side2_C, StaticMesh14) == 0x000250, "Member 'APark_Side2_C::StaticMesh14' has a wrong offset!");
static_assert(offsetof(APark_Side2_C, StaticMesh25) == 0x000258, "Member 'APark_Side2_C::StaticMesh25' has a wrong offset!");
static_assert(offsetof(APark_Side2_C, StaticMesh8) == 0x000260, "Member 'APark_Side2_C::StaticMesh8' has a wrong offset!");
static_assert(offsetof(APark_Side2_C, StaticMesh54) == 0x000268, "Member 'APark_Side2_C::StaticMesh54' has a wrong offset!");
static_assert(offsetof(APark_Side2_C, StaticMesh53) == 0x000270, "Member 'APark_Side2_C::StaticMesh53' has a wrong offset!");
static_assert(offsetof(APark_Side2_C, StaticMesh52) == 0x000278, "Member 'APark_Side2_C::StaticMesh52' has a wrong offset!");
static_assert(offsetof(APark_Side2_C, StaticMesh51) == 0x000280, "Member 'APark_Side2_C::StaticMesh51' has a wrong offset!");
static_assert(offsetof(APark_Side2_C, StaticMesh50) == 0x000288, "Member 'APark_Side2_C::StaticMesh50' has a wrong offset!");
static_assert(offsetof(APark_Side2_C, StaticMesh49) == 0x000290, "Member 'APark_Side2_C::StaticMesh49' has a wrong offset!");
static_assert(offsetof(APark_Side2_C, StaticMesh45) == 0x000298, "Member 'APark_Side2_C::StaticMesh45' has a wrong offset!");
static_assert(offsetof(APark_Side2_C, StaticMesh27) == 0x0002A0, "Member 'APark_Side2_C::StaticMesh27' has a wrong offset!");
static_assert(offsetof(APark_Side2_C, StaticMesh36) == 0x0002A8, "Member 'APark_Side2_C::StaticMesh36' has a wrong offset!");
static_assert(offsetof(APark_Side2_C, StaticMesh35) == 0x0002B0, "Member 'APark_Side2_C::StaticMesh35' has a wrong offset!");
static_assert(offsetof(APark_Side2_C, StaticMesh34) == 0x0002B8, "Member 'APark_Side2_C::StaticMesh34' has a wrong offset!");
static_assert(offsetof(APark_Side2_C, StaticMesh33) == 0x0002C0, "Member 'APark_Side2_C::StaticMesh33' has a wrong offset!");
static_assert(offsetof(APark_Side2_C, StaticMesh32) == 0x0002C8, "Member 'APark_Side2_C::StaticMesh32' has a wrong offset!");
static_assert(offsetof(APark_Side2_C, StaticMesh24) == 0x0002D0, "Member 'APark_Side2_C::StaticMesh24' has a wrong offset!");
static_assert(offsetof(APark_Side2_C, StaticMesh23) == 0x0002D8, "Member 'APark_Side2_C::StaticMesh23' has a wrong offset!");
static_assert(offsetof(APark_Side2_C, StaticMesh21) == 0x0002E0, "Member 'APark_Side2_C::StaticMesh21' has a wrong offset!");
static_assert(offsetof(APark_Side2_C, StaticMesh15) == 0x0002E8, "Member 'APark_Side2_C::StaticMesh15' has a wrong offset!");
static_assert(offsetof(APark_Side2_C, StaticMesh13) == 0x0002F0, "Member 'APark_Side2_C::StaticMesh13' has a wrong offset!");
static_assert(offsetof(APark_Side2_C, StaticMesh12) == 0x0002F8, "Member 'APark_Side2_C::StaticMesh12' has a wrong offset!");
static_assert(offsetof(APark_Side2_C, StaticMesh9) == 0x000300, "Member 'APark_Side2_C::StaticMesh9' has a wrong offset!");
static_assert(offsetof(APark_Side2_C, StaticMesh7) == 0x000308, "Member 'APark_Side2_C::StaticMesh7' has a wrong offset!");
static_assert(offsetof(APark_Side2_C, SidewalkLeft4) == 0x000310, "Member 'APark_Side2_C::SidewalkLeft4' has a wrong offset!");
static_assert(offsetof(APark_Side2_C, SidewalkLeft2) == 0x000318, "Member 'APark_Side2_C::SidewalkLeft2' has a wrong offset!");
static_assert(offsetof(APark_Side2_C, StaticMesh3) == 0x000320, "Member 'APark_Side2_C::StaticMesh3' has a wrong offset!");
static_assert(offsetof(APark_Side2_C, StaticMesh2) == 0x000328, "Member 'APark_Side2_C::StaticMesh2' has a wrong offset!");
static_assert(offsetof(APark_Side2_C, SidewalkLeft1) == 0x000330, "Member 'APark_Side2_C::SidewalkLeft1' has a wrong offset!");
static_assert(offsetof(APark_Side2_C, DefaultSceneRoot) == 0x000338, "Member 'APark_Side2_C::DefaultSceneRoot' has a wrong offset!");

}

