#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Park_Small

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Park_Small.Park_Small_C
// 0x01B0 (0x03D0 - 0x0220)
class APark_Small_C final : public AActor
{
public:
	class UStaticMeshComponent*                   StaticMesh54;                                      // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh53;                                      // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh52;                                      // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh51;                                      // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh50;                                      // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh49;                                      // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh48;                                      // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh47;                                      // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh46;                                      // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh45;                                      // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh27;                                      // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh18;                                      // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh44;                                      // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh43;                                      // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh42;                                      // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh41;                                      // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh40;                                      // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh39;                                      // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh38;                                      // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh37;                                      // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh36;                                      // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh35;                                      // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh34;                                      // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh33;                                      // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh32;                                      // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh31;                                      // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh30;                                      // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh29;                                      // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh28;                                      // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh26;                                      // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh25;                                      // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh24;                                      // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh23;                                      // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh22;                                      // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh21;                                      // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh20;                                      // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh19;                                      // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh17;                                      // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh16;                                      // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh5;                                       // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh4;                                       // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh15;                                      // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh14;                                      // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh13;                                      // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh12;                                      // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh9;                                       // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh7;                                       // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SidewalkLeft4;                                     // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SidewalkLeft3;                                     // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SidewalkLeft2;                                     // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh3;                                       // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh2;                                       // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SidewalkLeft1;                                     // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Park_Small_C">();
	}
	static class APark_Small_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APark_Small_C>();
	}
};
static_assert(alignof(APark_Small_C) == 0x000008, "Wrong alignment on APark_Small_C");
static_assert(sizeof(APark_Small_C) == 0x0003D0, "Wrong size on APark_Small_C");
static_assert(offsetof(APark_Small_C, StaticMesh54) == 0x000220, "Member 'APark_Small_C::StaticMesh54' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh53) == 0x000228, "Member 'APark_Small_C::StaticMesh53' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh52) == 0x000230, "Member 'APark_Small_C::StaticMesh52' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh51) == 0x000238, "Member 'APark_Small_C::StaticMesh51' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh50) == 0x000240, "Member 'APark_Small_C::StaticMesh50' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh49) == 0x000248, "Member 'APark_Small_C::StaticMesh49' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh48) == 0x000250, "Member 'APark_Small_C::StaticMesh48' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh47) == 0x000258, "Member 'APark_Small_C::StaticMesh47' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh46) == 0x000260, "Member 'APark_Small_C::StaticMesh46' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh45) == 0x000268, "Member 'APark_Small_C::StaticMesh45' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh27) == 0x000270, "Member 'APark_Small_C::StaticMesh27' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh18) == 0x000278, "Member 'APark_Small_C::StaticMesh18' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh44) == 0x000280, "Member 'APark_Small_C::StaticMesh44' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh43) == 0x000288, "Member 'APark_Small_C::StaticMesh43' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh42) == 0x000290, "Member 'APark_Small_C::StaticMesh42' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh41) == 0x000298, "Member 'APark_Small_C::StaticMesh41' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh40) == 0x0002A0, "Member 'APark_Small_C::StaticMesh40' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh39) == 0x0002A8, "Member 'APark_Small_C::StaticMesh39' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh38) == 0x0002B0, "Member 'APark_Small_C::StaticMesh38' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh37) == 0x0002B8, "Member 'APark_Small_C::StaticMesh37' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh36) == 0x0002C0, "Member 'APark_Small_C::StaticMesh36' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh35) == 0x0002C8, "Member 'APark_Small_C::StaticMesh35' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh34) == 0x0002D0, "Member 'APark_Small_C::StaticMesh34' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh33) == 0x0002D8, "Member 'APark_Small_C::StaticMesh33' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh32) == 0x0002E0, "Member 'APark_Small_C::StaticMesh32' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh31) == 0x0002E8, "Member 'APark_Small_C::StaticMesh31' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh30) == 0x0002F0, "Member 'APark_Small_C::StaticMesh30' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh29) == 0x0002F8, "Member 'APark_Small_C::StaticMesh29' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh28) == 0x000300, "Member 'APark_Small_C::StaticMesh28' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh26) == 0x000308, "Member 'APark_Small_C::StaticMesh26' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh25) == 0x000310, "Member 'APark_Small_C::StaticMesh25' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh24) == 0x000318, "Member 'APark_Small_C::StaticMesh24' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh23) == 0x000320, "Member 'APark_Small_C::StaticMesh23' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh22) == 0x000328, "Member 'APark_Small_C::StaticMesh22' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh21) == 0x000330, "Member 'APark_Small_C::StaticMesh21' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh20) == 0x000338, "Member 'APark_Small_C::StaticMesh20' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh19) == 0x000340, "Member 'APark_Small_C::StaticMesh19' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh17) == 0x000348, "Member 'APark_Small_C::StaticMesh17' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh16) == 0x000350, "Member 'APark_Small_C::StaticMesh16' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh5) == 0x000358, "Member 'APark_Small_C::StaticMesh5' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh4) == 0x000360, "Member 'APark_Small_C::StaticMesh4' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh15) == 0x000368, "Member 'APark_Small_C::StaticMesh15' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh14) == 0x000370, "Member 'APark_Small_C::StaticMesh14' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh13) == 0x000378, "Member 'APark_Small_C::StaticMesh13' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh12) == 0x000380, "Member 'APark_Small_C::StaticMesh12' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh9) == 0x000388, "Member 'APark_Small_C::StaticMesh9' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh7) == 0x000390, "Member 'APark_Small_C::StaticMesh7' has a wrong offset!");
static_assert(offsetof(APark_Small_C, SidewalkLeft4) == 0x000398, "Member 'APark_Small_C::SidewalkLeft4' has a wrong offset!");
static_assert(offsetof(APark_Small_C, SidewalkLeft3) == 0x0003A0, "Member 'APark_Small_C::SidewalkLeft3' has a wrong offset!");
static_assert(offsetof(APark_Small_C, SidewalkLeft2) == 0x0003A8, "Member 'APark_Small_C::SidewalkLeft2' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh3) == 0x0003B0, "Member 'APark_Small_C::StaticMesh3' has a wrong offset!");
static_assert(offsetof(APark_Small_C, StaticMesh2) == 0x0003B8, "Member 'APark_Small_C::StaticMesh2' has a wrong offset!");
static_assert(offsetof(APark_Small_C, SidewalkLeft1) == 0x0003C0, "Member 'APark_Small_C::SidewalkLeft1' has a wrong offset!");
static_assert(offsetof(APark_Small_C, DefaultSceneRoot) == 0x0003C8, "Member 'APark_Small_C::DefaultSceneRoot' has a wrong offset!");

}

