#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PauseMenu

#include "Basic.hpp"


namespace SDK::Params
{

// Function PauseMenu.PauseMenu_C.ExecuteUbergraph_PauseMenu
// 0x00B0 (0x00B0 - 0x0000)
struct PauseMenu_C_ExecuteUbergraph_PauseMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USettingsUI_C*                          CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULeaveGameConfirm_C*                    CallFunc_Create_ReturnValue_1;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARobberController_C*                    K2Node_DynamicCast_AsRobber_Controller;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class APlayerCharacter_C*>             CallFunc_GetAllActorsOfClass_OutActors;            // 0x0068(0x0010)(ReferenceParm)
	bool                                          CallFunc_SetGamePaused_ReturnValue;                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue_1;              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULoadingUI_C*                           CallFunc_Create_ReturnValue_2;                     // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USettingsUI_C*>                  CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0090(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USettingsUI_C*                          CallFunc_Array_Get_Item;                           // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PauseMenu_C_ExecuteUbergraph_PauseMenu) == 0x000008, "Wrong alignment on PauseMenu_C_ExecuteUbergraph_PauseMenu");
static_assert(sizeof(PauseMenu_C_ExecuteUbergraph_PauseMenu) == 0x0000B0, "Wrong size on PauseMenu_C_ExecuteUbergraph_PauseMenu");
static_assert(offsetof(PauseMenu_C_ExecuteUbergraph_PauseMenu, EntryPoint) == 0x000000, "Member 'PauseMenu_C_ExecuteUbergraph_PauseMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(PauseMenu_C_ExecuteUbergraph_PauseMenu, Temp_int_Array_Index_Variable) == 0x000004, "Member 'PauseMenu_C_ExecuteUbergraph_PauseMenu::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PauseMenu_C_ExecuteUbergraph_PauseMenu, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'PauseMenu_C_ExecuteUbergraph_PauseMenu::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PauseMenu_C_ExecuteUbergraph_PauseMenu, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'PauseMenu_C_ExecuteUbergraph_PauseMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PauseMenu_C_ExecuteUbergraph_PauseMenu, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'PauseMenu_C_ExecuteUbergraph_PauseMenu::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(PauseMenu_C_ExecuteUbergraph_PauseMenu, CallFunc_Create_ReturnValue) == 0x000018, "Member 'PauseMenu_C_ExecuteUbergraph_PauseMenu::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(PauseMenu_C_ExecuteUbergraph_PauseMenu, CallFunc_Create_ReturnValue_1) == 0x000020, "Member 'PauseMenu_C_ExecuteUbergraph_PauseMenu::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PauseMenu_C_ExecuteUbergraph_PauseMenu, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'PauseMenu_C_ExecuteUbergraph_PauseMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PauseMenu_C_ExecuteUbergraph_PauseMenu, CallFunc_GetPlayerController_ReturnValue_1) == 0x000030, "Member 'PauseMenu_C_ExecuteUbergraph_PauseMenu::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PauseMenu_C_ExecuteUbergraph_PauseMenu, K2Node_DynamicCast_AsRobber_Controller) == 0x000038, "Member 'PauseMenu_C_ExecuteUbergraph_PauseMenu::K2Node_DynamicCast_AsRobber_Controller' has a wrong offset!");
static_assert(offsetof(PauseMenu_C_ExecuteUbergraph_PauseMenu, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'PauseMenu_C_ExecuteUbergraph_PauseMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PauseMenu_C_ExecuteUbergraph_PauseMenu, CallFunc_GetPlayerName_ReturnValue) == 0x000048, "Member 'PauseMenu_C_ExecuteUbergraph_PauseMenu::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PauseMenu_C_ExecuteUbergraph_PauseMenu, CallFunc_Concat_StrStr_ReturnValue) == 0x000058, "Member 'PauseMenu_C_ExecuteUbergraph_PauseMenu::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(PauseMenu_C_ExecuteUbergraph_PauseMenu, CallFunc_GetAllActorsOfClass_OutActors) == 0x000068, "Member 'PauseMenu_C_ExecuteUbergraph_PauseMenu::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(PauseMenu_C_ExecuteUbergraph_PauseMenu, CallFunc_SetGamePaused_ReturnValue) == 0x000078, "Member 'PauseMenu_C_ExecuteUbergraph_PauseMenu::CallFunc_SetGamePaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(PauseMenu_C_ExecuteUbergraph_PauseMenu, CallFunc_Array_Length_ReturnValue) == 0x00007C, "Member 'PauseMenu_C_ExecuteUbergraph_PauseMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PauseMenu_C_ExecuteUbergraph_PauseMenu, CallFunc_SetGamePaused_ReturnValue_1) == 0x000080, "Member 'PauseMenu_C_ExecuteUbergraph_PauseMenu::CallFunc_SetGamePaused_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PauseMenu_C_ExecuteUbergraph_PauseMenu, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000081, "Member 'PauseMenu_C_ExecuteUbergraph_PauseMenu::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PauseMenu_C_ExecuteUbergraph_PauseMenu, CallFunc_Create_ReturnValue_2) == 0x000088, "Member 'PauseMenu_C_ExecuteUbergraph_PauseMenu::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PauseMenu_C_ExecuteUbergraph_PauseMenu, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000090, "Member 'PauseMenu_C_ExecuteUbergraph_PauseMenu::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(PauseMenu_C_ExecuteUbergraph_PauseMenu, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'PauseMenu_C_ExecuteUbergraph_PauseMenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PauseMenu_C_ExecuteUbergraph_PauseMenu, CallFunc_Array_Length_ReturnValue_1) == 0x0000A8, "Member 'PauseMenu_C_ExecuteUbergraph_PauseMenu::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PauseMenu_C_ExecuteUbergraph_PauseMenu, CallFunc_Less_IntInt_ReturnValue) == 0x0000AC, "Member 'PauseMenu_C_ExecuteUbergraph_PauseMenu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

