#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PickupItem_base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PickupItem_base.PickupItem_base_C
// 0x0028 (0x0258 - 0x0230)
class APickupItem_base_C : public AStaticMeshActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDuffelbagStuckComponent_C*             DuffelbagStuckComponent;                           // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULookatInfoComponent_C*                 LookatInfoComponent;                               // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPickupItemComponent_C*                 PickupItemComponent;                               // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USmoothSync*                            SmoothSync;                                        // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PickupItem_base(int32 EntryPoint);
	void ReceiveBeginPlay();
	void SetCollisionResponeOverlapServer();
	void BndEvt__PickupItem_base_PickupItemComponent_K2Node_ComponentBoundEvent_0_PickUpItem__DelegateSignature(class AActor* Player, const struct FVector& Pickuplocation, const struct FRotator& PickupRotation, const struct FVector& HitLocation);
	void ReceiveActorEndOverlap(class AActor* OtherActor);
	void OnPickupInterfaceCall();
	void CheckIfOverlappingPlayer(bool* Overlapping_);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PickupItem_base_C">();
	}
	static class APickupItem_base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APickupItem_base_C>();
	}
};
static_assert(alignof(APickupItem_base_C) == 0x000008, "Wrong alignment on APickupItem_base_C");
static_assert(sizeof(APickupItem_base_C) == 0x000258, "Wrong size on APickupItem_base_C");
static_assert(offsetof(APickupItem_base_C, UberGraphFrame) == 0x000230, "Member 'APickupItem_base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APickupItem_base_C, DuffelbagStuckComponent) == 0x000238, "Member 'APickupItem_base_C::DuffelbagStuckComponent' has a wrong offset!");
static_assert(offsetof(APickupItem_base_C, LookatInfoComponent) == 0x000240, "Member 'APickupItem_base_C::LookatInfoComponent' has a wrong offset!");
static_assert(offsetof(APickupItem_base_C, PickupItemComponent) == 0x000248, "Member 'APickupItem_base_C::PickupItemComponent' has a wrong offset!");
static_assert(offsetof(APickupItem_base_C, SmoothSync) == 0x000250, "Member 'APickupItem_base_C::SmoothSync' has a wrong offset!");

}

