#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PlayerAnimBP.PlayerAnimBP_C.ExecuteUbergraph_PlayerAnimBP
// 0x0180 (0x0180 - 0x0000)
struct PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_1;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_2;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_4;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_5;                             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Temp_float_Variable_6;                             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Temp_float_Variable_7;                             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_5;                              // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_6;                              // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F[0x1];                                       // 0x003F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_8;                             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_9;                             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_10;                            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_11;                            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_8;                              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ClampAngle_ReturnValue;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_9;                              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_2;                           // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_3;                           // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_4;                           // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_5;                           // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_10;                             // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_6;                           // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_7;                           // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue_1;            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCharacter_C*                     K2Node_DynamicCast_AsPlayer_Character;             // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_1;           // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0135(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0136(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_137[0x1];                                      // 0x0137(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetTargetLocationAndRotation_TargetLocation; // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetTargetLocationAndRotation_TargetRotation; // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    CallFunc_GetGrabbedComponent_ReturnValue;          // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFalling_ReturnValue;                    // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x015B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16A[0x2];                                      // 0x016A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               K2Node_Select_Default_8;                           // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP) == 0x000008, "Wrong alignment on PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP");
static_assert(sizeof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP) == 0x000180, "Wrong size on PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, EntryPoint) == 0x000000, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, Temp_float_Variable) == 0x000004, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, Temp_bool_Variable) == 0x000008, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, Temp_float_Variable_1) == 0x00000C, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, Temp_bool_Variable_1) == 0x000010, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, Temp_bool_Variable_2) == 0x000011, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, Temp_float_Variable_2) == 0x000014, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, Temp_float_Variable_3) == 0x000018, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, Temp_bool_Variable_3) == 0x00001C, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, Temp_float_Variable_4) == 0x000020, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::Temp_float_Variable_4' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, Temp_float_Variable_5) == 0x000024, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::Temp_float_Variable_5' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, Temp_bool_Variable_4) == 0x000028, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_Not_PreBool_ReturnValue) == 0x000029, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_BooleanAND_ReturnValue) == 0x00002A, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_Not_PreBool_ReturnValue_1) == 0x00002B, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, Temp_float_Variable_6) == 0x00002C, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::Temp_float_Variable_6' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_BooleanAND_ReturnValue_1) == 0x000030, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_Not_PreBool_ReturnValue_2) == 0x000031, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_Not_PreBool_ReturnValue_3) == 0x000032, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_BooleanAND_ReturnValue_2) == 0x000033, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, Temp_float_Variable_7) == 0x000034, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::Temp_float_Variable_7' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_BooleanAND_ReturnValue_3) == 0x000038, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_Not_PreBool_ReturnValue_4) == 0x000039, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, Temp_bool_Variable_5) == 0x00003A, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_BooleanOR_ReturnValue) == 0x00003B, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, Temp_bool_Variable_6) == 0x00003C, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_BooleanAND_ReturnValue_4) == 0x00003D, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_Not_PreBool_ReturnValue_5) == 0x00003E, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, Temp_float_Variable_8) == 0x000040, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::Temp_float_Variable_8' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_BooleanAND_ReturnValue_5) == 0x000044, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, Temp_float_Variable_9) == 0x000048, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::Temp_float_Variable_9' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, Temp_bool_Variable_7) == 0x00004C, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, Temp_float_Variable_10) == 0x000050, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::Temp_float_Variable_10' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, Temp_float_Variable_11) == 0x000054, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::Temp_float_Variable_11' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, Temp_bool_Variable_8) == 0x000058, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::Temp_bool_Variable_8' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00005C, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_BreakRotator_Roll) == 0x000060, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_BreakRotator_Pitch) == 0x000064, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_BreakRotator_Yaw) == 0x000068, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_BreakRotator_Roll_1) == 0x00006C, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_BreakRotator_Pitch_1) == 0x000070, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_BreakRotator_Yaw_1) == 0x000074, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000078, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_Less_FloatFloat_ReturnValue) == 0x00007C, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_Add_FloatFloat_ReturnValue) == 0x000080, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_ClampAngle_ReturnValue) == 0x000084, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_ClampAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, K2Node_Select_Default) == 0x000088, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_MakeRotator_ReturnValue) == 0x00008C, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x000098, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x00009C, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0000A0, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, K2Node_Select_Default_1) == 0x0000A4, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, Temp_bool_Variable_9) == 0x0000A8, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::Temp_bool_Variable_9' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, K2Node_Select_Default_2) == 0x0000AC, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_BooleanOR_ReturnValue_1) == 0x0000B0, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_BooleanOR_ReturnValue_2) == 0x0000B1, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, K2Node_Select_Default_3) == 0x0000B4, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_BooleanOR_ReturnValue_3) == 0x0000B8, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x0000BC, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, K2Node_Select_Default_4) == 0x0000C0, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, K2Node_Select_Default_5) == 0x0000C4, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_MakeRotator_ReturnValue_1) == 0x0000C8, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, Temp_bool_Variable_10) == 0x0000D4, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::Temp_bool_Variable_10' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, K2Node_Select_Default_6) == 0x0000D8, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, K2Node_Select_Default_7) == 0x0000DC, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::K2Node_Select_Default_7' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, K2Node_Event_DeltaTimeX) == 0x0000E0, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_TryGetPawnOwner_ReturnValue) == 0x0000E8, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_TryGetPawnOwner_ReturnValue_1) == 0x0000F0, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_TryGetPawnOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_GetActorRightVector_ReturnValue) == 0x0000F8, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_GetActorRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, K2Node_DynamicCast_AsPlayer_Character) == 0x000108, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::K2Node_DynamicCast_AsPlayer_Character' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, K2Node_DynamicCast_bSuccess) == 0x000110, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_GetVelocity_ReturnValue) == 0x000114, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_Dot_VectorVector_ReturnValue) == 0x000120, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_GetActorForwardVector_ReturnValue) == 0x000124, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_Dot_VectorVector_ReturnValue_1) == 0x000130, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_Dot_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_IsLocallyControlled_ReturnValue) == 0x000134, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_IsValid_ReturnValue) == 0x000135, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_IsValid_ReturnValue_1) == 0x000136, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_GetTargetLocationAndRotation_TargetLocation) == 0x000138, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_GetTargetLocationAndRotation_TargetLocation' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_GetTargetLocationAndRotation_TargetRotation) == 0x000144, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_GetTargetLocationAndRotation_TargetRotation' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_GetGrabbedComponent_ReturnValue) == 0x000150, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_GetGrabbedComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_IsValid_ReturnValue_2) == 0x000158, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_IsValid_ReturnValue_3) == 0x000159, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_IsFalling_ReturnValue) == 0x00015A, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_IsFalling_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_IsValid_ReturnValue_4) == 0x00015B, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_GetControlRotation_ReturnValue) == 0x00015C, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_GetControlRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x000168, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_IsValid_ReturnValue_5) == 0x000169, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, K2Node_Select_Default_8) == 0x00016C, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::K2Node_Select_Default_8' has a wrong offset!");
static_assert(offsetof(PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP, CallFunc_IsValid_ReturnValue_6) == 0x000178, "Member 'PlayerAnimBP_C_ExecuteUbergraph_PlayerAnimBP::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");

// Function PlayerAnimBP.PlayerAnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct PlayerAnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerAnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on PlayerAnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(PlayerAnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on PlayerAnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(PlayerAnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'PlayerAnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function PlayerAnimBP.PlayerAnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct PlayerAnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(PlayerAnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on PlayerAnimBP_C_AnimGraph");
static_assert(sizeof(PlayerAnimBP_C_AnimGraph) == 0x000010, "Wrong size on PlayerAnimBP_C_AnimGraph");
static_assert(offsetof(PlayerAnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'PlayerAnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

