#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerNameTag

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlayerNameTag.PlayerNameTag_C
// 0x0040 (0x02A0 - 0x0260)
class UPlayerNameTag_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Kickpopup;                                         // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_87;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_66;                                      // 0x0278(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPrimitiveComponent*                    NameTagComponentLocation;                          // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class ARobberPlayerState_C*                   PlayerState;                                       // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 Name_0;                                            // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PlayerNameTag(int32 EntryPoint);
	void Construct();
	ESlateVisibility GetVisibility_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerNameTag_C">();
	}
	static class UPlayerNameTag_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerNameTag_C>();
	}
};
static_assert(alignof(UPlayerNameTag_C) == 0x000008, "Wrong alignment on UPlayerNameTag_C");
static_assert(sizeof(UPlayerNameTag_C) == 0x0002A0, "Wrong size on UPlayerNameTag_C");
static_assert(offsetof(UPlayerNameTag_C, UberGraphFrame) == 0x000260, "Member 'UPlayerNameTag_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayerNameTag_C, Kickpopup) == 0x000268, "Member 'UPlayerNameTag_C::Kickpopup' has a wrong offset!");
static_assert(offsetof(UPlayerNameTag_C, Image_87) == 0x000270, "Member 'UPlayerNameTag_C::Image_87' has a wrong offset!");
static_assert(offsetof(UPlayerNameTag_C, TextBlock_66) == 0x000278, "Member 'UPlayerNameTag_C::TextBlock_66' has a wrong offset!");
static_assert(offsetof(UPlayerNameTag_C, NameTagComponentLocation) == 0x000280, "Member 'UPlayerNameTag_C::NameTagComponentLocation' has a wrong offset!");
static_assert(offsetof(UPlayerNameTag_C, PlayerState) == 0x000288, "Member 'UPlayerNameTag_C::PlayerState' has a wrong offset!");
static_assert(offsetof(UPlayerNameTag_C, Name_0) == 0x000290, "Member 'UPlayerNameTag_C::Name_0' has a wrong offset!");

}

