#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PoliceGunBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PoliceGunBase.PoliceGunBase_C.ExecuteUbergraph_PoliceGunBase
// 0x0290 (0x0290 - 0x0000)
struct PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_CustomEvent_Hit;                            // 0x0070(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_128[0x8];                                      // 0x0128(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_1;     // 0x0130(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0160(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x019C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABulletTrace_C*                         CallFunc_FinishSpawningActor_ReturnValue;          // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_2;     // 0x01D0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetParentActor_ReturnValue;               // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_2;                // 0x0208(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_2;                // 0x0214(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_2;                   // 0x0220(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0240(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0278(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABulletCasing_C*                        CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase) == 0x000010, "Wrong alignment on PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase");
static_assert(sizeof(PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase) == 0x000290, "Wrong size on PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase");
static_assert(offsetof(PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase, EntryPoint) == 0x000000, "Member 'PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase, CallFunc_GetForwardVector_ReturnValue) == 0x000004, "Member 'PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase, CallFunc_GetForwardVector_ReturnValue_1) == 0x000010, "Member 'PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00001C, "Member 'PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000028, "Member 'PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase, CallFunc_MakeRotFromX_ReturnValue) == 0x000034, "Member 'PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000040, "Member 'PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase, K2Node_CustomEvent_Hit) == 0x000070, "Member 'PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase::K2Node_CustomEvent_Hit' has a wrong offset!");
static_assert(offsetof(PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase, CallFunc_BreakTransform_Location) == 0x0000F8, "Member 'PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase, CallFunc_BreakTransform_Rotation) == 0x000104, "Member 'PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase, CallFunc_BreakTransform_Scale) == 0x000110, "Member 'PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase, CallFunc_Add_VectorVector_ReturnValue) == 0x00011C, "Member 'PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase, CallFunc_K2_GetComponentToWorld_ReturnValue_1) == 0x000130, "Member 'PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase::CallFunc_K2_GetComponentToWorld_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase, CallFunc_MakeTransform_ReturnValue) == 0x000160, "Member 'PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase, CallFunc_BreakTransform_Location_1) == 0x000190, "Member 'PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase, CallFunc_BreakTransform_Rotation_1) == 0x00019C, "Member 'PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase, CallFunc_BreakTransform_Scale_1) == 0x0001A8, "Member 'PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0001B8, "Member 'PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x0001C0, "Member 'PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase, CallFunc_FinishSpawningActor_ReturnValue) == 0x0001C8, "Member 'PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase, CallFunc_K2_GetComponentToWorld_ReturnValue_2) == 0x0001D0, "Member 'PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase::CallFunc_K2_GetComponentToWorld_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase, CallFunc_GetParentActor_ReturnValue) == 0x000200, "Member 'PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase::CallFunc_GetParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase, CallFunc_BreakTransform_Location_2) == 0x000208, "Member 'PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase::CallFunc_BreakTransform_Location_2' has a wrong offset!");
static_assert(offsetof(PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase, CallFunc_BreakTransform_Rotation_2) == 0x000214, "Member 'PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase::CallFunc_BreakTransform_Rotation_2' has a wrong offset!");
static_assert(offsetof(PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase, CallFunc_BreakTransform_Scale_2) == 0x000220, "Member 'PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase::CallFunc_BreakTransform_Scale_2' has a wrong offset!");
static_assert(offsetof(PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase, K2Node_DynamicCast_AsPawn) == 0x000230, "Member 'PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase, K2Node_DynamicCast_bSuccess) == 0x000238, "Member 'PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase, CallFunc_MakeTransform_ReturnValue_1) == 0x000240, "Member 'PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000270, "Member 'PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000278, "Member 'PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000288, "Member 'PoliceGunBase_C_ExecuteUbergraph_PoliceGunBase::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");

// Function PoliceGunBase.PoliceGunBase_C.Shoot
// 0x0088 (0x0088 - 0x0000)
struct PoliceGunBase_C_Shoot final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PoliceGunBase_C_Shoot) == 0x000004, "Wrong alignment on PoliceGunBase_C_Shoot");
static_assert(sizeof(PoliceGunBase_C_Shoot) == 0x000088, "Wrong size on PoliceGunBase_C_Shoot");
static_assert(offsetof(PoliceGunBase_C_Shoot, Hit) == 0x000000, "Member 'PoliceGunBase_C_Shoot::Hit' has a wrong offset!");

}

