#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RobberTruck

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass RobberTruck.RobberTruck_C
// 0x0200 (0x0420 - 0x0220)
class ARobberTruck_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USteamAchievementComponent_C*           SteamAchievementComponent;                         // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Camera;                                            // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   LeaveButton;                                       // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Plane1;                                            // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   WhiteBoardText2;                                   // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          MoneyOverlapper;                                   // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   EndOfTruck;                                        // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Item_AmmoPack_013;                              // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Item_AmmoPack_012;                              // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Item_AmmoPack_011;                              // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Box3;                                              // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Item_AmmoPack_09;                               // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   WallLamp3;                                         // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   WallLamp2;                                         // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   WallLamp1;                                         // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   WallLamp;                                          // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Clock1;                                            // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Ladder;                                            // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Socket;                                            // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   WalkWay4;                                          // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   WalkWay3;                                          // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   WalkWay5;                                          // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Clock;                                             // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Item_AmmoPack_08;                               // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Item_AmmoPack_07;                               // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Item_AmmoPack_06;                               // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Item_AmmoPack_05;                               // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Item_AmmoPack_04;                               // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Item_AmmoPack_03;                               // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Item_AmmoPack_02;                               // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Item_AmmoPack_01;                               // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Plane;                                             // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   MinTakeText;                                       // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   WhiteBoardText;                                    // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   WalkWay2;                                          // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   WalkWay1;                                          // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   WalkWay;                                           // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Vent;                                              // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Whiteboard;                                        // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FanShell;                                          // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Fan;                                               // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FanBase;                                           // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Shelf3;                                            // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Shelf2;                                            // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Shelf1;                                            // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Shelf;                                             // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Poster;                                            // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Table4;                                            // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Table3;                                            // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Table2;                                            // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Playerstart3;                                      // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Playerstart2;                                      // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Playerstart1;                                      // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   PlayerStart;                                       // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   WeaponBoard;                                       // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight2;                                       // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight1;                                       // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   TruckMesh;                                         // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalTake;                                         // 0x0408(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MinimumTake;                                       // 0x040C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         OverlappingPlayers;                                // 0x0410(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanEndGame_;                                       // 0x0414(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_415[0x3];                                      // 0x0415(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              Timer;                                             // 0x0418(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_RobberTruck(int32 EntryPoint);
	void StopTimer();
	void CountTimer(float DeltaTime);
	void CountPlayers(class APlayerCharacter_C* Player, bool EndOverlap_);
	void RemoveMoney(class AMoney_base_C* MoneyActor);
	void BndEvt__RobberTruck_MoneyOverlapper_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void CountMoney(class AMoney_base_C* MoneyActor);
	void BndEvt__RobberTruck_MoneyOverlapper_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ReceiveTick(float DeltaSeconds);
	void UserConstructionScript();
	void CheckAllMoney();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RobberTruck_C">();
	}
	static class ARobberTruck_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARobberTruck_C>();
	}
};
static_assert(alignof(ARobberTruck_C) == 0x000008, "Wrong alignment on ARobberTruck_C");
static_assert(sizeof(ARobberTruck_C) == 0x000420, "Wrong size on ARobberTruck_C");
static_assert(offsetof(ARobberTruck_C, UberGraphFrame) == 0x000220, "Member 'ARobberTruck_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, SteamAchievementComponent) == 0x000228, "Member 'ARobberTruck_C::SteamAchievementComponent' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, Camera) == 0x000230, "Member 'ARobberTruck_C::Camera' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, LeaveButton) == 0x000238, "Member 'ARobberTruck_C::LeaveButton' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, Plane1) == 0x000240, "Member 'ARobberTruck_C::Plane1' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, WhiteBoardText2) == 0x000248, "Member 'ARobberTruck_C::WhiteBoardText2' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, MoneyOverlapper) == 0x000250, "Member 'ARobberTruck_C::MoneyOverlapper' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, EndOfTruck) == 0x000258, "Member 'ARobberTruck_C::EndOfTruck' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, SM_Item_AmmoPack_013) == 0x000260, "Member 'ARobberTruck_C::SM_Item_AmmoPack_013' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, SM_Item_AmmoPack_012) == 0x000268, "Member 'ARobberTruck_C::SM_Item_AmmoPack_012' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, SM_Item_AmmoPack_011) == 0x000270, "Member 'ARobberTruck_C::SM_Item_AmmoPack_011' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, Box3) == 0x000278, "Member 'ARobberTruck_C::Box3' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, SM_Item_AmmoPack_09) == 0x000280, "Member 'ARobberTruck_C::SM_Item_AmmoPack_09' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, WallLamp3) == 0x000288, "Member 'ARobberTruck_C::WallLamp3' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, WallLamp2) == 0x000290, "Member 'ARobberTruck_C::WallLamp2' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, WallLamp1) == 0x000298, "Member 'ARobberTruck_C::WallLamp1' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, WallLamp) == 0x0002A0, "Member 'ARobberTruck_C::WallLamp' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, Clock1) == 0x0002A8, "Member 'ARobberTruck_C::Clock1' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, Ladder) == 0x0002B0, "Member 'ARobberTruck_C::Ladder' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, Socket) == 0x0002B8, "Member 'ARobberTruck_C::Socket' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, WalkWay4) == 0x0002C0, "Member 'ARobberTruck_C::WalkWay4' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, WalkWay3) == 0x0002C8, "Member 'ARobberTruck_C::WalkWay3' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, WalkWay5) == 0x0002D0, "Member 'ARobberTruck_C::WalkWay5' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, Clock) == 0x0002D8, "Member 'ARobberTruck_C::Clock' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, SM_Item_AmmoPack_08) == 0x0002E0, "Member 'ARobberTruck_C::SM_Item_AmmoPack_08' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, SM_Item_AmmoPack_07) == 0x0002E8, "Member 'ARobberTruck_C::SM_Item_AmmoPack_07' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, SM_Item_AmmoPack_06) == 0x0002F0, "Member 'ARobberTruck_C::SM_Item_AmmoPack_06' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, SM_Item_AmmoPack_05) == 0x0002F8, "Member 'ARobberTruck_C::SM_Item_AmmoPack_05' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, SM_Item_AmmoPack_04) == 0x000300, "Member 'ARobberTruck_C::SM_Item_AmmoPack_04' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, SM_Item_AmmoPack_03) == 0x000308, "Member 'ARobberTruck_C::SM_Item_AmmoPack_03' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, SM_Item_AmmoPack_02) == 0x000310, "Member 'ARobberTruck_C::SM_Item_AmmoPack_02' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, SM_Item_AmmoPack_01) == 0x000318, "Member 'ARobberTruck_C::SM_Item_AmmoPack_01' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, Plane) == 0x000320, "Member 'ARobberTruck_C::Plane' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, MinTakeText) == 0x000328, "Member 'ARobberTruck_C::MinTakeText' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, WhiteBoardText) == 0x000330, "Member 'ARobberTruck_C::WhiteBoardText' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, WalkWay2) == 0x000338, "Member 'ARobberTruck_C::WalkWay2' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, WalkWay1) == 0x000340, "Member 'ARobberTruck_C::WalkWay1' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, WalkWay) == 0x000348, "Member 'ARobberTruck_C::WalkWay' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, Vent) == 0x000350, "Member 'ARobberTruck_C::Vent' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, Whiteboard) == 0x000358, "Member 'ARobberTruck_C::Whiteboard' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, FanShell) == 0x000360, "Member 'ARobberTruck_C::FanShell' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, Fan) == 0x000368, "Member 'ARobberTruck_C::Fan' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, FanBase) == 0x000370, "Member 'ARobberTruck_C::FanBase' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, Shelf3) == 0x000378, "Member 'ARobberTruck_C::Shelf3' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, Shelf2) == 0x000380, "Member 'ARobberTruck_C::Shelf2' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, Shelf1) == 0x000388, "Member 'ARobberTruck_C::Shelf1' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, Shelf) == 0x000390, "Member 'ARobberTruck_C::Shelf' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, Poster) == 0x000398, "Member 'ARobberTruck_C::Poster' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, Table4) == 0x0003A0, "Member 'ARobberTruck_C::Table4' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, Table3) == 0x0003A8, "Member 'ARobberTruck_C::Table3' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, Table2) == 0x0003B0, "Member 'ARobberTruck_C::Table2' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, Playerstart3) == 0x0003B8, "Member 'ARobberTruck_C::Playerstart3' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, Playerstart2) == 0x0003C0, "Member 'ARobberTruck_C::Playerstart2' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, Playerstart1) == 0x0003C8, "Member 'ARobberTruck_C::Playerstart1' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, PlayerStart) == 0x0003D0, "Member 'ARobberTruck_C::PlayerStart' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, WeaponBoard) == 0x0003D8, "Member 'ARobberTruck_C::WeaponBoard' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, PointLight2) == 0x0003E0, "Member 'ARobberTruck_C::PointLight2' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, PointLight1) == 0x0003E8, "Member 'ARobberTruck_C::PointLight1' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, PointLight) == 0x0003F0, "Member 'ARobberTruck_C::PointLight' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, TruckMesh) == 0x0003F8, "Member 'ARobberTruck_C::TruckMesh' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, DefaultSceneRoot) == 0x000400, "Member 'ARobberTruck_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, TotalTake) == 0x000408, "Member 'ARobberTruck_C::TotalTake' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, MinimumTake) == 0x00040C, "Member 'ARobberTruck_C::MinimumTake' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, OverlappingPlayers) == 0x000410, "Member 'ARobberTruck_C::OverlappingPlayers' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, CanEndGame_) == 0x000414, "Member 'ARobberTruck_C::CanEndGame_' has a wrong offset!");
static_assert(offsetof(ARobberTruck_C, Timer) == 0x000418, "Member 'ARobberTruck_C::Timer' has a wrong offset!");

}

