#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RobberGM

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function RobberGM.RobberGM_C.SetupControllerTools
// 0x0048 (0x0048 - 0x0000)
struct RobberGM_C_SetupControllerTools final
{
public:
	class ARobberController_C*                    Controller;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         Tools;                                             // 0x0008(0x0010)(Parm, OutParm)
	TArray<class UClass*>                         ToolFunc;                                          // 0x0018(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FBA[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RobberGM_C_SetupControllerTools) == 0x000008, "Wrong alignment on RobberGM_C_SetupControllerTools");
static_assert(sizeof(RobberGM_C_SetupControllerTools) == 0x000048, "Wrong size on RobberGM_C_SetupControllerTools");
static_assert(offsetof(RobberGM_C_SetupControllerTools, Controller) == 0x000000, "Member 'RobberGM_C_SetupControllerTools::Controller' has a wrong offset!");
static_assert(offsetof(RobberGM_C_SetupControllerTools, Tools) == 0x000008, "Member 'RobberGM_C_SetupControllerTools::Tools' has a wrong offset!");
static_assert(offsetof(RobberGM_C_SetupControllerTools, ToolFunc) == 0x000018, "Member 'RobberGM_C_SetupControllerTools::ToolFunc' has a wrong offset!");
static_assert(offsetof(RobberGM_C_SetupControllerTools, Temp_int_Array_Index_Variable) == 0x000028, "Member 'RobberGM_C_SetupControllerTools::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(RobberGM_C_SetupControllerTools, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'RobberGM_C_SetupControllerTools::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(RobberGM_C_SetupControllerTools, CallFunc_Array_Get_Item) == 0x000030, "Member 'RobberGM_C_SetupControllerTools::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(RobberGM_C_SetupControllerTools, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'RobberGM_C_SetupControllerTools::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(RobberGM_C_SetupControllerTools, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'RobberGM_C_SetupControllerTools::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RobberGM_C_SetupControllerTools, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'RobberGM_C_SetupControllerTools::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function RobberGM.RobberGM_C.HandleStartingNewPlayer
// 0x0008 (0x0008 - 0x0000)
struct RobberGM_C_HandleStartingNewPlayer final
{
public:
	class APlayerController*                      NewPlayer;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RobberGM_C_HandleStartingNewPlayer) == 0x000008, "Wrong alignment on RobberGM_C_HandleStartingNewPlayer");
static_assert(sizeof(RobberGM_C_HandleStartingNewPlayer) == 0x000008, "Wrong size on RobberGM_C_HandleStartingNewPlayer");
static_assert(offsetof(RobberGM_C_HandleStartingNewPlayer, NewPlayer) == 0x000000, "Member 'RobberGM_C_HandleStartingNewPlayer::NewPlayer' has a wrong offset!");

// Function RobberGM.RobberGM_C.ExecuteUbergraph_RobberGM
// 0x00C0 (0x00C0 - 0x0000)
struct RobberGM_C_ExecuteUbergraph_RobberGM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FBB[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARobberGameState_C*                     K2Node_DynamicCast_AsRobber_Game_State;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FBC[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_Event_NewPlayer;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class APlayerStart*>                   CallFunc_GetAllActorsOfClass_OutActors;            // 0x0028(0x0010)(ReferenceParm)
	class APlayerStart*                           CallFunc_Array_Random_OutItem;                     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfNetworkPlayers_NumNetPlayers;  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FBD[0x8];                                     // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	class URobberGI_C*                            K2Node_DynamicCast_AsRobber_GI;                    // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FBE[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCharacter_C*                     CallFunc_FinishSpawningActor_ReturnValue;          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RobberGM_C_ExecuteUbergraph_RobberGM) == 0x000010, "Wrong alignment on RobberGM_C_ExecuteUbergraph_RobberGM");
static_assert(sizeof(RobberGM_C_ExecuteUbergraph_RobberGM) == 0x0000C0, "Wrong size on RobberGM_C_ExecuteUbergraph_RobberGM");
static_assert(offsetof(RobberGM_C_ExecuteUbergraph_RobberGM, EntryPoint) == 0x000000, "Member 'RobberGM_C_ExecuteUbergraph_RobberGM::EntryPoint' has a wrong offset!");
static_assert(offsetof(RobberGM_C_ExecuteUbergraph_RobberGM, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'RobberGM_C_ExecuteUbergraph_RobberGM::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(RobberGM_C_ExecuteUbergraph_RobberGM, K2Node_DynamicCast_AsRobber_Game_State) == 0x000010, "Member 'RobberGM_C_ExecuteUbergraph_RobberGM::K2Node_DynamicCast_AsRobber_Game_State' has a wrong offset!");
static_assert(offsetof(RobberGM_C_ExecuteUbergraph_RobberGM, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'RobberGM_C_ExecuteUbergraph_RobberGM::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(RobberGM_C_ExecuteUbergraph_RobberGM, K2Node_Event_NewPlayer) == 0x000020, "Member 'RobberGM_C_ExecuteUbergraph_RobberGM::K2Node_Event_NewPlayer' has a wrong offset!");
static_assert(offsetof(RobberGM_C_ExecuteUbergraph_RobberGM, CallFunc_GetAllActorsOfClass_OutActors) == 0x000028, "Member 'RobberGM_C_ExecuteUbergraph_RobberGM::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(RobberGM_C_ExecuteUbergraph_RobberGM, CallFunc_Array_Random_OutItem) == 0x000038, "Member 'RobberGM_C_ExecuteUbergraph_RobberGM::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(RobberGM_C_ExecuteUbergraph_RobberGM, CallFunc_Array_Random_OutIndex) == 0x000040, "Member 'RobberGM_C_ExecuteUbergraph_RobberGM::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(RobberGM_C_ExecuteUbergraph_RobberGM, CallFunc_GetNumberOfNetworkPlayers_NumNetPlayers) == 0x000044, "Member 'RobberGM_C_ExecuteUbergraph_RobberGM::CallFunc_GetNumberOfNetworkPlayers_NumNetPlayers' has a wrong offset!");
static_assert(offsetof(RobberGM_C_ExecuteUbergraph_RobberGM, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000048, "Member 'RobberGM_C_ExecuteUbergraph_RobberGM::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(RobberGM_C_ExecuteUbergraph_RobberGM, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000054, "Member 'RobberGM_C_ExecuteUbergraph_RobberGM::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(RobberGM_C_ExecuteUbergraph_RobberGM, CallFunc_GetGameInstance_ReturnValue) == 0x000060, "Member 'RobberGM_C_ExecuteUbergraph_RobberGM::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(RobberGM_C_ExecuteUbergraph_RobberGM, CallFunc_MakeTransform_ReturnValue) == 0x000070, "Member 'RobberGM_C_ExecuteUbergraph_RobberGM::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(RobberGM_C_ExecuteUbergraph_RobberGM, K2Node_DynamicCast_AsRobber_GI) == 0x0000A0, "Member 'RobberGM_C_ExecuteUbergraph_RobberGM::K2Node_DynamicCast_AsRobber_GI' has a wrong offset!");
static_assert(offsetof(RobberGM_C_ExecuteUbergraph_RobberGM, K2Node_DynamicCast_bSuccess_1) == 0x0000A8, "Member 'RobberGM_C_ExecuteUbergraph_RobberGM::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(RobberGM_C_ExecuteUbergraph_RobberGM, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000B0, "Member 'RobberGM_C_ExecuteUbergraph_RobberGM::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(RobberGM_C_ExecuteUbergraph_RobberGM, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000B8, "Member 'RobberGM_C_ExecuteUbergraph_RobberGM::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

