#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RobberGM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass RobberGM.RobberGM_C
// 0x0018 (0x02D8 - 0x02C0)
class ARobberGM_C final : public AGameModeBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         NumNetPlayers;                                     // 0x02D0(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetupControllerTools(class ARobberController_C* Controller, TArray<class UClass*>* Tools);
	void HandleStartingNewPlayer(class APlayerController* NewPlayer);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_RobberGM(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RobberGM_C">();
	}
	static class ARobberGM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARobberGM_C>();
	}
};
static_assert(alignof(ARobberGM_C) == 0x000008, "Wrong alignment on ARobberGM_C");
static_assert(sizeof(ARobberGM_C) == 0x0002D8, "Wrong size on ARobberGM_C");
static_assert(offsetof(ARobberGM_C, UberGraphFrame) == 0x0002C0, "Member 'ARobberGM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ARobberGM_C, DefaultSceneRoot) == 0x0002C8, "Member 'ARobberGM_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ARobberGM_C, NumNetPlayers) == 0x0002D0, "Member 'ARobberGM_C::NumNetPlayers' has a wrong offset!");

}

