#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Scope_MarkmanHunter

#include "Basic.hpp"


namespace SDK::Params
{

// Function Scope_MarkmanHunter.Scope_MarkmanHunter_C.ExecuteUbergraph_Scope_MarkmanHunter
// 0x0018 (0x0018 - 0x0000)
struct Scope_MarkmanHunter_C_ExecuteUbergraph_Scope_MarkmanHunter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_CreateRenderTarget2D_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Scope_MarkmanHunter_C_ExecuteUbergraph_Scope_MarkmanHunter) == 0x000008, "Wrong alignment on Scope_MarkmanHunter_C_ExecuteUbergraph_Scope_MarkmanHunter");
static_assert(sizeof(Scope_MarkmanHunter_C_ExecuteUbergraph_Scope_MarkmanHunter) == 0x000018, "Wrong size on Scope_MarkmanHunter_C_ExecuteUbergraph_Scope_MarkmanHunter");
static_assert(offsetof(Scope_MarkmanHunter_C_ExecuteUbergraph_Scope_MarkmanHunter, EntryPoint) == 0x000000, "Member 'Scope_MarkmanHunter_C_ExecuteUbergraph_Scope_MarkmanHunter::EntryPoint' has a wrong offset!");
static_assert(offsetof(Scope_MarkmanHunter_C_ExecuteUbergraph_Scope_MarkmanHunter, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'Scope_MarkmanHunter_C_ExecuteUbergraph_Scope_MarkmanHunter::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scope_MarkmanHunter_C_ExecuteUbergraph_Scope_MarkmanHunter, CallFunc_CreateRenderTarget2D_ReturnValue) == 0x000010, "Member 'Scope_MarkmanHunter_C_ExecuteUbergraph_Scope_MarkmanHunter::CallFunc_CreateRenderTarget2D_ReturnValue' has a wrong offset!");

}

