#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ServerBrowser_Mapselect

#include "Basic.hpp"

#include "SteamCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ServerBrowser_Mapselect.ServerBrowser_Mapselect_C
// 0x0070 (0x02D0 - 0x0260)
class UServerBrowser_Mapselect_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_57;                                         // 0x0270(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_199;                                        // 0x0278(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_59;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_69;                                      // 0x0288(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_149;                                     // 0x0290(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 MapInfo;                                           // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<struct FSteamID>                       LobbiesFound;                                      // 0x02A0(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          Unlocked_;                                         // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UServerBrowserUI_C*                     OwningWidget;                                      // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         ValidLobbies;                                      // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARobberController_C*                    As_Robber_Controller;                              // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ServerBrowser_Mapselect(int32 EntryPoint);
	void BndEvt__MapSelectUIChild_Button_59_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__MapSelectUIChild_Button_59_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__MapSelectUIChild_Button_59_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void UpdateGames();
	struct FSlateBrush GetBackground_0();
	class FText GetText_0();
	class FText GetText_1();
	ESlateVisibility GetVisibility_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ServerBrowser_Mapselect_C">();
	}
	static class UServerBrowser_Mapselect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UServerBrowser_Mapselect_C>();
	}
};
static_assert(alignof(UServerBrowser_Mapselect_C) == 0x000008, "Wrong alignment on UServerBrowser_Mapselect_C");
static_assert(sizeof(UServerBrowser_Mapselect_C) == 0x0002D0, "Wrong size on UServerBrowser_Mapselect_C");
static_assert(offsetof(UServerBrowser_Mapselect_C, UberGraphFrame) == 0x000260, "Member 'UServerBrowser_Mapselect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UServerBrowser_Mapselect_C, Hover) == 0x000268, "Member 'UServerBrowser_Mapselect_C::Hover' has a wrong offset!");
static_assert(offsetof(UServerBrowser_Mapselect_C, Border_57) == 0x000270, "Member 'UServerBrowser_Mapselect_C::Border_57' has a wrong offset!");
static_assert(offsetof(UServerBrowser_Mapselect_C, Border_199) == 0x000278, "Member 'UServerBrowser_Mapselect_C::Border_199' has a wrong offset!");
static_assert(offsetof(UServerBrowser_Mapselect_C, Button_59) == 0x000280, "Member 'UServerBrowser_Mapselect_C::Button_59' has a wrong offset!");
static_assert(offsetof(UServerBrowser_Mapselect_C, TextBlock_69) == 0x000288, "Member 'UServerBrowser_Mapselect_C::TextBlock_69' has a wrong offset!");
static_assert(offsetof(UServerBrowser_Mapselect_C, TextBlock_149) == 0x000290, "Member 'UServerBrowser_Mapselect_C::TextBlock_149' has a wrong offset!");
static_assert(offsetof(UServerBrowser_Mapselect_C, MapInfo) == 0x000298, "Member 'UServerBrowser_Mapselect_C::MapInfo' has a wrong offset!");
static_assert(offsetof(UServerBrowser_Mapselect_C, LobbiesFound) == 0x0002A0, "Member 'UServerBrowser_Mapselect_C::LobbiesFound' has a wrong offset!");
static_assert(offsetof(UServerBrowser_Mapselect_C, Unlocked_) == 0x0002B0, "Member 'UServerBrowser_Mapselect_C::Unlocked_' has a wrong offset!");
static_assert(offsetof(UServerBrowser_Mapselect_C, OwningWidget) == 0x0002B8, "Member 'UServerBrowser_Mapselect_C::OwningWidget' has a wrong offset!");
static_assert(offsetof(UServerBrowser_Mapselect_C, ValidLobbies) == 0x0002C0, "Member 'UServerBrowser_Mapselect_C::ValidLobbies' has a wrong offset!");
static_assert(offsetof(UServerBrowser_Mapselect_C, As_Robber_Controller) == 0x0002C8, "Member 'UServerBrowser_Mapselect_C::As_Robber_Controller' has a wrong offset!");

}

