#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ServerBrowserUI

#include "Basic.hpp"

#include "SteamCore_structs.hpp"
#include "Engine_structs.hpp"
#include "OnlineSubsystemUtils_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ServerBrowserUI.ServerBrowserUI_C
// 0x0188 (0x03E8 - 0x0260)
class UServerBrowserUI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_157;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                CloseButton;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URandomMapUI_C*                         RandomMapUI;                                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               ServerMapWrap;                                     // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FBlueprintSessionResult>        PublicSessions;                                    // 0x0288(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class URobberGI_C*                            As_Robber_GI;                                      // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayersConnected;                                  // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlueprintSessionResult                JoinedSession;                                     // 0x02A8(0x0108)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          SessionsAvailable_;                                // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSteamID                               Lobby;                                             // 0x03B8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FSteamID                               SteamIDLobbyFound;                                 // 0x03C0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSteamID>                       LobbiesFound;                                      // 0x03C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          LookingForServers_;                                // 0x03D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D9[0x7];                                      // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARobberController_C*                    As_Robber_Controller;                              // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ServerBrowserUI(int32 EntryPoint);
	void AddServersMaps();
	void FindServers();
	void SetOwnLobbyPublic();
	void FoundSessions(const struct FBlueprintSessionResult& Session, bool FoundSession_);
	void BndEvt__ServerBrowserUI_Button_157_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__ServerBrowserUI_CloseButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void CheckConnectedPlayers(bool* Alone_);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ServerBrowserUI_C">();
	}
	static class UServerBrowserUI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UServerBrowserUI_C>();
	}
};
static_assert(alignof(UServerBrowserUI_C) == 0x000008, "Wrong alignment on UServerBrowserUI_C");
static_assert(sizeof(UServerBrowserUI_C) == 0x0003E8, "Wrong size on UServerBrowserUI_C");
static_assert(offsetof(UServerBrowserUI_C, UberGraphFrame) == 0x000260, "Member 'UServerBrowserUI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UServerBrowserUI_C, Button_157) == 0x000268, "Member 'UServerBrowserUI_C::Button_157' has a wrong offset!");
static_assert(offsetof(UServerBrowserUI_C, CloseButton) == 0x000270, "Member 'UServerBrowserUI_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UServerBrowserUI_C, RandomMapUI) == 0x000278, "Member 'UServerBrowserUI_C::RandomMapUI' has a wrong offset!");
static_assert(offsetof(UServerBrowserUI_C, ServerMapWrap) == 0x000280, "Member 'UServerBrowserUI_C::ServerMapWrap' has a wrong offset!");
static_assert(offsetof(UServerBrowserUI_C, PublicSessions) == 0x000288, "Member 'UServerBrowserUI_C::PublicSessions' has a wrong offset!");
static_assert(offsetof(UServerBrowserUI_C, As_Robber_GI) == 0x000298, "Member 'UServerBrowserUI_C::As_Robber_GI' has a wrong offset!");
static_assert(offsetof(UServerBrowserUI_C, PlayersConnected) == 0x0002A0, "Member 'UServerBrowserUI_C::PlayersConnected' has a wrong offset!");
static_assert(offsetof(UServerBrowserUI_C, JoinedSession) == 0x0002A8, "Member 'UServerBrowserUI_C::JoinedSession' has a wrong offset!");
static_assert(offsetof(UServerBrowserUI_C, SessionsAvailable_) == 0x0003B0, "Member 'UServerBrowserUI_C::SessionsAvailable_' has a wrong offset!");
static_assert(offsetof(UServerBrowserUI_C, Lobby) == 0x0003B8, "Member 'UServerBrowserUI_C::Lobby' has a wrong offset!");
static_assert(offsetof(UServerBrowserUI_C, SteamIDLobbyFound) == 0x0003C0, "Member 'UServerBrowserUI_C::SteamIDLobbyFound' has a wrong offset!");
static_assert(offsetof(UServerBrowserUI_C, LobbiesFound) == 0x0003C8, "Member 'UServerBrowserUI_C::LobbiesFound' has a wrong offset!");
static_assert(offsetof(UServerBrowserUI_C, LookingForServers_) == 0x0003D8, "Member 'UServerBrowserUI_C::LookingForServers_' has a wrong offset!");
static_assert(offsetof(UServerBrowserUI_C, As_Robber_Controller) == 0x0003E0, "Member 'UServerBrowserUI_C::As_Robber_Controller' has a wrong offset!");

}

