#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShieldAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ShieldAnimBP.ShieldAnimBP_C.ExecuteUbergraph_ShieldAnimBP
// 0x00D8 (0x00D8 - 0x0000)
struct ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Temp_struct_Variable;                              // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ClampAngle_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ANPC_Police_base_C*                     K2Node_DynamicCast_AsNPC_Police_Base;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               K2Node_Select_Default_1;                           // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue_1;           // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP) == 0x000008, "Wrong alignment on ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP");
static_assert(sizeof(ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP) == 0x0000D8, "Wrong size on ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP");
static_assert(offsetof(ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP, EntryPoint) == 0x000000, "Member 'ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP, Temp_struct_Variable) == 0x000004, "Member 'ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP, Temp_bool_Variable) == 0x000010, "Member 'ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP, Temp_float_Variable) == 0x000014, "Member 'ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP, Temp_float_Variable_1) == 0x000018, "Member 'ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP, Temp_bool_Variable_1) == 0x00001C, "Member 'ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP, CallFunc_BreakRotator_Roll) == 0x000020, "Member 'ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP, CallFunc_BreakRotator_Pitch) == 0x000024, "Member 'ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP, CallFunc_BreakRotator_Yaw) == 0x000028, "Member 'ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00002C, "Member 'ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP, CallFunc_Add_FloatFloat_ReturnValue) == 0x000030, "Member 'ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP, CallFunc_ClampAngle_ReturnValue) == 0x000034, "Member 'ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP::CallFunc_ClampAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP, K2Node_Select_Default) == 0x000038, "Member 'ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP, CallFunc_MakeRotator_ReturnValue) == 0x00003C, "Member 'ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP, K2Node_Event_DeltaTimeX) == 0x000048, "Member 'ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000050, "Member 'ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP, K2Node_DynamicCast_AsNPC_Police_Base) == 0x000058, "Member 'ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP::K2Node_DynamicCast_AsNPC_Police_Base' has a wrong offset!");
static_assert(offsetof(ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP, CallFunc_GetVelocity_ReturnValue) == 0x000064, "Member 'ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000074, "Member 'ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000080, "Member 'ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP, CallFunc_IsValid_ReturnValue_1) == 0x00008C, "Member 'ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000090, "Member 'ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP, CallFunc_FindLookAtRotation_ReturnValue) == 0x00009C, "Member 'ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP, K2Node_Select_Default_1) == 0x0000A8, "Member 'ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP, CallFunc_GetActorRightVector_ReturnValue) == 0x0000B4, "Member 'ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP::CallFunc_GetActorRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP, CallFunc_Dot_VectorVector_ReturnValue) == 0x0000C0, "Member 'ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP, CallFunc_GetActorForwardVector_ReturnValue) == 0x0000C4, "Member 'ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP, CallFunc_Dot_VectorVector_ReturnValue_1) == 0x0000D0, "Member 'ShieldAnimBP_C_ExecuteUbergraph_ShieldAnimBP::CallFunc_Dot_VectorVector_ReturnValue_1' has a wrong offset!");

// Function ShieldAnimBP.ShieldAnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ShieldAnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShieldAnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ShieldAnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(ShieldAnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ShieldAnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(ShieldAnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ShieldAnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ShieldAnimBP.ShieldAnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ShieldAnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ShieldAnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on ShieldAnimBP_C_AnimGraph");
static_assert(sizeof(ShieldAnimBP_C_AnimGraph) == 0x000010, "Wrong size on ShieldAnimBP_C_AnimGraph");
static_assert(offsetof(ShieldAnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ShieldAnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

