#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShopItemUI

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "RarityNum_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ShopItemCategory_structs.hpp"


namespace SDK::Params
{

// Function ShopItemUI.ShopItemUI_C.ExecuteUbergraph_ShopItemUI
// 0x01D8 (0x01D8 - 0x0000)
struct ShopItemUI_C_ExecuteUbergraph_ShopItemUI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UShopBuyUI_C*                           CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EShopItemCategory                             K2Node_Event_Category_1;                           // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EShopItemCategory                             K2Node_Event_Category;                             // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_Event_ItemInfo;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SalePrice;                            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARobberController_C*                    K2Node_DynamicCast_AsRobber_Controller;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAllActorsWithInterface_OutActors;      // 0x0058(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUserWidget*>                    CallFunc_GetAllWidgetsWithInterface_FoundWidgets;  // 0x0078(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IMenuUIInteraface_C>   K2Node_DynamicCast_AsMenu_UIInteraface;            // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AB[0x5];                                       // 0x00AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsShop_Item_Weapon_Mod_Base; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUserWidget*>                    CallFunc_GetAllWidgetsWithInterface_FoundWidgets_1; // 0x00C0(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGunStatInterface_C>   K2Node_DynamicCast_AsGun_Stat_Interface;           // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F2[0x2];                                       // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetUpgradeStats_Recoil;                   // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetUpgradeStats_Accuracy;                 // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetUpgradeStats_Damage;                   // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetUpgradeStats_Bullets;                  // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetUpgradeStats_Reload_time;              // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_2;                         // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IMenuUIInteraface_C>   K2Node_DynamicCast_AsMenu_UIInteraface_1;          // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUserWidget*>                    CallFunc_GetAllWidgetsWithInterface_FoundWidgets_2; // 0x0140(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UUserWidget*                            CallFunc_Array_Get_Item_3;                         // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGunStatInterface_C>   K2Node_DynamicCast_AsGun_Stat_Interface_1;         // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_173[0x1];                                      // 0x0173(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0174(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Multiply_Int64Int64_ReturnValue;          // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_Int64Int64_ReturnValue;        // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI) == 0x000008, "Wrong alignment on ShopItemUI_C_ExecuteUbergraph_ShopItemUI");
static_assert(sizeof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI) == 0x0001D8, "Wrong size on ShopItemUI_C_ExecuteUbergraph_ShopItemUI");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, EntryPoint) == 0x000000, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::EntryPoint' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, CallFunc_Create_ReturnValue) == 0x000008, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, Temp_int_Array_Index_Variable) == 0x000018, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, Temp_int_Array_Index_Variable_1) == 0x00001C, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, Temp_int_Loop_Counter_Variable_1) == 0x000020, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, CallFunc_Add_IntInt_ReturnValue_1) == 0x000024, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, Temp_int_Array_Index_Variable_2) == 0x000028, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, Temp_bool_IsClosed_Variable) == 0x00002C, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, Temp_bool_Has_Been_Initd_Variable) == 0x00002D, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, K2Node_Event_Category_1) == 0x00002E, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::K2Node_Event_Category_1' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, K2Node_Event_Category) == 0x00002F, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::K2Node_Event_Category' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, K2Node_Event_ItemInfo) == 0x000030, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::K2Node_Event_ItemInfo' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, K2Node_Event_SalePrice) == 0x000038, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::K2Node_Event_SalePrice' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, CallFunc_GetPlayerController_ReturnValue) == 0x000040, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, K2Node_DynamicCast_AsRobber_Controller) == 0x000048, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::K2Node_DynamicCast_AsRobber_Controller' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, CallFunc_GetAllActorsWithInterface_OutActors) == 0x000058, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::CallFunc_GetAllActorsWithInterface_OutActors' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, Temp_int_Loop_Counter_Variable_2) == 0x000068, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, CallFunc_Array_Length_ReturnValue) == 0x00006C, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, CallFunc_Add_IntInt_ReturnValue_2) == 0x000070, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, CallFunc_Less_IntInt_ReturnValue) == 0x000074, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, CallFunc_GetAllWidgetsWithInterface_FoundWidgets) == 0x000078, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::CallFunc_GetAllWidgetsWithInterface_FoundWidgets' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, CallFunc_Array_Get_Item) == 0x000088, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, K2Node_DynamicCast_AsMenu_UIInteraface) == 0x000090, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::K2Node_DynamicCast_AsMenu_UIInteraface' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, K2Node_DynamicCast_bSuccess_1) == 0x0000A0, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, CallFunc_Array_Length_ReturnValue_1) == 0x0000A4, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000A8, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x0000A9, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, CallFunc_IsValid_ReturnValue) == 0x0000AA, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, K2Node_ClassDynamicCast_AsShop_Item_Weapon_Mod_Base) == 0x0000B0, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::K2Node_ClassDynamicCast_AsShop_Item_Weapon_Mod_Base' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, K2Node_ClassDynamicCast_bSuccess) == 0x0000B8, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, CallFunc_GetAllWidgetsWithInterface_FoundWidgets_1) == 0x0000C0, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::CallFunc_GetAllWidgetsWithInterface_FoundWidgets_1' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, Temp_int_Loop_Counter_Variable_3) == 0x0000D0, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, CallFunc_Array_Get_Item_1) == 0x0000D8, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, K2Node_DynamicCast_AsGun_Stat_Interface) == 0x0000E0, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::K2Node_DynamicCast_AsGun_Stat_Interface' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, K2Node_DynamicCast_bSuccess_2) == 0x0000F0, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000F1, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000F4, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, CallFunc_Array_Length_ReturnValue_2) == 0x0000F8, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000FC, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, CallFunc_GetUpgradeStats_Recoil) == 0x000100, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::CallFunc_GetUpgradeStats_Recoil' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, CallFunc_GetUpgradeStats_Accuracy) == 0x000104, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::CallFunc_GetUpgradeStats_Accuracy' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, CallFunc_GetUpgradeStats_Damage) == 0x000108, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::CallFunc_GetUpgradeStats_Damage' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, CallFunc_GetUpgradeStats_Bullets) == 0x00010C, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::CallFunc_GetUpgradeStats_Bullets' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, CallFunc_GetUpgradeStats_Reload_time) == 0x000110, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::CallFunc_GetUpgradeStats_Reload_time' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000114, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, Temp_int_Array_Index_Variable_3) == 0x000118, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, CallFunc_Array_Get_Item_2) == 0x000120, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, K2Node_DynamicCast_AsMenu_UIInteraface_1) == 0x000128, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::K2Node_DynamicCast_AsMenu_UIInteraface_1' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, K2Node_DynamicCast_bSuccess_3) == 0x000138, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, CallFunc_GetAllWidgetsWithInterface_FoundWidgets_2) == 0x000140, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::CallFunc_GetAllWidgetsWithInterface_FoundWidgets_2' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, CallFunc_Array_Get_Item_3) == 0x000150, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, CallFunc_Array_Length_ReturnValue_3) == 0x000158, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, K2Node_DynamicCast_AsGun_Stat_Interface_1) == 0x000160, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::K2Node_DynamicCast_AsGun_Stat_Interface_1' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, K2Node_DynamicCast_bSuccess_4) == 0x000170, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, CallFunc_Less_IntInt_ReturnValue_3) == 0x000171, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, CallFunc_IsValid_ReturnValue_1) == 0x000172, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, K2Node_Event_MyGeometry) == 0x000174, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, K2Node_Event_InDeltaTime) == 0x0001AC, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, K2Node_Event_IsDesignTime) == 0x0001B0, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, CallFunc_Add_IntInt_ReturnValue_4) == 0x0001B4, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, CallFunc_Add_IntInt_ReturnValue_5) == 0x0001B8, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, CallFunc_Add_IntInt_ReturnValue_6) == 0x0001BC, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::CallFunc_Add_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, CallFunc_Conv_IntToInt64_ReturnValue) == 0x0001C0, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, CallFunc_Multiply_Int64Int64_ReturnValue) == 0x0001C8, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::CallFunc_Multiply_Int64Int64_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_ExecuteUbergraph_ShopItemUI, CallFunc_EqualEqual_Int64Int64_ReturnValue) == 0x0001D0, "Member 'ShopItemUI_C_ExecuteUbergraph_ShopItemUI::CallFunc_EqualEqual_Int64Int64_ReturnValue' has a wrong offset!");

// Function ShopItemUI.ShopItemUI_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ShopItemUI_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ShopItemUI_C_PreConstruct) == 0x000001, "Wrong alignment on ShopItemUI_C_PreConstruct");
static_assert(sizeof(ShopItemUI_C_PreConstruct) == 0x000001, "Wrong size on ShopItemUI_C_PreConstruct");
static_assert(offsetof(ShopItemUI_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ShopItemUI_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ShopItemUI.ShopItemUI_C.Tick
// 0x003C (0x003C - 0x0000)
struct ShopItemUI_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShopItemUI_C_Tick) == 0x000004, "Wrong alignment on ShopItemUI_C_Tick");
static_assert(sizeof(ShopItemUI_C_Tick) == 0x00003C, "Wrong size on ShopItemUI_C_Tick");
static_assert(offsetof(ShopItemUI_C_Tick, MyGeometry) == 0x000000, "Member 'ShopItemUI_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_Tick, InDeltaTime) == 0x000038, "Member 'ShopItemUI_C_Tick::InDeltaTime' has a wrong offset!");

// Function ShopItemUI.ShopItemUI_C.PreviewItem
// 0x0010 (0x0010 - 0x0000)
struct ShopItemUI_C_PreviewItem final
{
public:
	class UClass*                                 ItemInfo;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SalePrice;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShopItemUI_C_PreviewItem) == 0x000008, "Wrong alignment on ShopItemUI_C_PreviewItem");
static_assert(sizeof(ShopItemUI_C_PreviewItem) == 0x000010, "Wrong size on ShopItemUI_C_PreviewItem");
static_assert(offsetof(ShopItemUI_C_PreviewItem, ItemInfo) == 0x000000, "Member 'ShopItemUI_C_PreviewItem::ItemInfo' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_PreviewItem, SalePrice) == 0x000008, "Member 'ShopItemUI_C_PreviewItem::SalePrice' has a wrong offset!");

// Function ShopItemUI.ShopItemUI_C.DragItemFromCategory
// 0x0001 (0x0001 - 0x0000)
struct ShopItemUI_C_DragItemFromCategory final
{
public:
	EShopItemCategory                             Category;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShopItemUI_C_DragItemFromCategory) == 0x000001, "Wrong alignment on ShopItemUI_C_DragItemFromCategory");
static_assert(sizeof(ShopItemUI_C_DragItemFromCategory) == 0x000001, "Wrong size on ShopItemUI_C_DragItemFromCategory");
static_assert(offsetof(ShopItemUI_C_DragItemFromCategory, Category) == 0x000000, "Member 'ShopItemUI_C_DragItemFromCategory::Category' has a wrong offset!");

// Function ShopItemUI.ShopItemUI_C.ChangeCategory
// 0x0001 (0x0001 - 0x0000)
struct ShopItemUI_C_ChangeCategory final
{
public:
	EShopItemCategory                             Category;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShopItemUI_C_ChangeCategory) == 0x000001, "Wrong alignment on ShopItemUI_C_ChangeCategory");
static_assert(sizeof(ShopItemUI_C_ChangeCategory) == 0x000001, "Wrong size on ShopItemUI_C_ChangeCategory");
static_assert(offsetof(ShopItemUI_C_ChangeCategory, Category) == 0x000000, "Member 'ShopItemUI_C_ChangeCategory::Category' has a wrong offset!");

// Function ShopItemUI.ShopItemUI_C.GetText_0
// 0x0038 (0x0038 - 0x0000)
struct ShopItemUI_C_GetText_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
};
static_assert(alignof(ShopItemUI_C_GetText_0) == 0x000008, "Wrong alignment on ShopItemUI_C_GetText_0");
static_assert(sizeof(ShopItemUI_C_GetText_0) == 0x000038, "Wrong size on ShopItemUI_C_GetText_0");
static_assert(offsetof(ShopItemUI_C_GetText_0, ReturnValue) == 0x000000, "Member 'ShopItemUI_C_GetText_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_GetText_0, CallFunc_IsValidClass_ReturnValue) == 0x000018, "Member 'ShopItemUI_C_GetText_0::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_GetText_0, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'ShopItemUI_C_GetText_0::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function ShopItemUI.ShopItemUI_C.PriceText
// 0x0070 (0x0070 - 0x0000)
struct ShopItemUI_C_PriceText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0058(0x0018)()
};
static_assert(alignof(ShopItemUI_C_PriceText) == 0x000008, "Wrong alignment on ShopItemUI_C_PriceText");
static_assert(sizeof(ShopItemUI_C_PriceText) == 0x000070, "Wrong size on ShopItemUI_C_PriceText");
static_assert(offsetof(ShopItemUI_C_PriceText, ReturnValue) == 0x000000, "Member 'ShopItemUI_C_PriceText::ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_PriceText, CallFunc_IsValidClass_ReturnValue) == 0x000018, "Member 'ShopItemUI_C_PriceText::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_PriceText, CallFunc_Conv_IntToText_ReturnValue) == 0x000020, "Member 'ShopItemUI_C_PriceText::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_PriceText, CallFunc_Conv_TextToString_ReturnValue) == 0x000038, "Member 'ShopItemUI_C_PriceText::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_PriceText, CallFunc_Concat_StrStr_ReturnValue) == 0x000048, "Member 'ShopItemUI_C_PriceText::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_PriceText, CallFunc_Conv_StringToText_ReturnValue) == 0x000058, "Member 'ShopItemUI_C_PriceText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function ShopItemUI.ShopItemUI_C.Get_CoinCostBox_Visibility_0
// 0x0003 (0x0003 - 0x0000)
struct ShopItemUI_C_Get_CoinCostBox_Visibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ShopItemUI_C_Get_CoinCostBox_Visibility_0) == 0x000001, "Wrong alignment on ShopItemUI_C_Get_CoinCostBox_Visibility_0");
static_assert(sizeof(ShopItemUI_C_Get_CoinCostBox_Visibility_0) == 0x000003, "Wrong size on ShopItemUI_C_Get_CoinCostBox_Visibility_0");
static_assert(offsetof(ShopItemUI_C_Get_CoinCostBox_Visibility_0, ReturnValue) == 0x000000, "Member 'ShopItemUI_C_Get_CoinCostBox_Visibility_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_Get_CoinCostBox_Visibility_0, CallFunc_IsValidClass_ReturnValue) == 0x000001, "Member 'ShopItemUI_C_Get_CoinCostBox_Visibility_0::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_Get_CoinCostBox_Visibility_0, CallFunc_Greater_IntInt_ReturnValue) == 0x000002, "Member 'ShopItemUI_C_Get_CoinCostBox_Visibility_0::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function ShopItemUI.ShopItemUI_C.Get_CashCostBox_Visibility_0
// 0x0003 (0x0003 - 0x0000)
struct ShopItemUI_C_Get_CashCostBox_Visibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ShopItemUI_C_Get_CashCostBox_Visibility_0) == 0x000001, "Wrong alignment on ShopItemUI_C_Get_CashCostBox_Visibility_0");
static_assert(sizeof(ShopItemUI_C_Get_CashCostBox_Visibility_0) == 0x000003, "Wrong size on ShopItemUI_C_Get_CashCostBox_Visibility_0");
static_assert(offsetof(ShopItemUI_C_Get_CashCostBox_Visibility_0, ReturnValue) == 0x000000, "Member 'ShopItemUI_C_Get_CashCostBox_Visibility_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_Get_CashCostBox_Visibility_0, CallFunc_IsValidClass_ReturnValue) == 0x000001, "Member 'ShopItemUI_C_Get_CashCostBox_Visibility_0::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_Get_CashCostBox_Visibility_0, CallFunc_Greater_IntInt_ReturnValue) == 0x000002, "Member 'ShopItemUI_C_Get_CashCostBox_Visibility_0::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function ShopItemUI.ShopItemUI_C.Get_UnlockBox_Visibility_0
// 0x0003 (0x0003 - 0x0000)
struct ShopItemUI_C_Get_UnlockBox_Visibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ShopItemUI_C_Get_UnlockBox_Visibility_0) == 0x000001, "Wrong alignment on ShopItemUI_C_Get_UnlockBox_Visibility_0");
static_assert(sizeof(ShopItemUI_C_Get_UnlockBox_Visibility_0) == 0x000003, "Wrong size on ShopItemUI_C_Get_UnlockBox_Visibility_0");
static_assert(offsetof(ShopItemUI_C_Get_UnlockBox_Visibility_0, ReturnValue) == 0x000000, "Member 'ShopItemUI_C_Get_UnlockBox_Visibility_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_Get_UnlockBox_Visibility_0, CallFunc_IsValidClass_ReturnValue) == 0x000001, "Member 'ShopItemUI_C_Get_UnlockBox_Visibility_0::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_Get_UnlockBox_Visibility_0, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000002, "Member 'ShopItemUI_C_Get_UnlockBox_Visibility_0::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function ShopItemUI.ShopItemUI_C.Get_PriceBox_Visibility_0
// 0x0003 (0x0003 - 0x0000)
struct ShopItemUI_C_Get_PriceBox_Visibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ShopItemUI_C_Get_PriceBox_Visibility_0) == 0x000001, "Wrong alignment on ShopItemUI_C_Get_PriceBox_Visibility_0");
static_assert(sizeof(ShopItemUI_C_Get_PriceBox_Visibility_0) == 0x000003, "Wrong size on ShopItemUI_C_Get_PriceBox_Visibility_0");
static_assert(offsetof(ShopItemUI_C_Get_PriceBox_Visibility_0, ReturnValue) == 0x000000, "Member 'ShopItemUI_C_Get_PriceBox_Visibility_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_Get_PriceBox_Visibility_0, CallFunc_IsValidClass_ReturnValue) == 0x000001, "Member 'ShopItemUI_C_Get_PriceBox_Visibility_0::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_Get_PriceBox_Visibility_0, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000002, "Member 'ShopItemUI_C_Get_PriceBox_Visibility_0::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function ShopItemUI.ShopItemUI_C.GetText_1
// 0x0058 (0x0058 - 0x0000)
struct ShopItemUI_C_GetText_1 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0018)()
};
static_assert(alignof(ShopItemUI_C_GetText_1) == 0x000008, "Wrong alignment on ShopItemUI_C_GetText_1");
static_assert(sizeof(ShopItemUI_C_GetText_1) == 0x000058, "Wrong size on ShopItemUI_C_GetText_1");
static_assert(offsetof(ShopItemUI_C_GetText_1, ReturnValue) == 0x000000, "Member 'ShopItemUI_C_GetText_1::ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_GetText_1, CallFunc_IsValidClass_ReturnValue) == 0x000018, "Member 'ShopItemUI_C_GetText_1::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_GetText_1, CallFunc_Conv_IntToString_ReturnValue) == 0x000020, "Member 'ShopItemUI_C_GetText_1::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_GetText_1, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'ShopItemUI_C_GetText_1::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_GetText_1, CallFunc_Conv_StringToText_ReturnValue) == 0x000040, "Member 'ShopItemUI_C_GetText_1::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function ShopItemUI.ShopItemUI_C.GetBrush_0
// 0x0118 (0x0118 - 0x0000)
struct ShopItemUI_C_GetBrush_0 final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x0088)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0090(0x0088)()
};
static_assert(alignof(ShopItemUI_C_GetBrush_0) == 0x000008, "Wrong alignment on ShopItemUI_C_GetBrush_0");
static_assert(sizeof(ShopItemUI_C_GetBrush_0) == 0x000118, "Wrong size on ShopItemUI_C_GetBrush_0");
static_assert(offsetof(ShopItemUI_C_GetBrush_0, ReturnValue) == 0x000000, "Member 'ShopItemUI_C_GetBrush_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_GetBrush_0, CallFunc_IsValidClass_ReturnValue) == 0x000088, "Member 'ShopItemUI_C_GetBrush_0::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_GetBrush_0, CallFunc_IsValid_ReturnValue) == 0x000089, "Member 'ShopItemUI_C_GetBrush_0::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_GetBrush_0, K2Node_MakeStruct_SlateBrush) == 0x000090, "Member 'ShopItemUI_C_GetBrush_0::K2Node_MakeStruct_SlateBrush' has a wrong offset!");

// Function ShopItemUI.ShopItemUI_C.GetColorAndOpacity_0
// 0x0080 (0x0080 - 0x0000)
struct ShopItemUI_C_GetColorAndOpacity_0 final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0028)(Parm, OutParm, ReturnParm)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0028(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0050(0x0028)()
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ShopItemUI_C_GetColorAndOpacity_0) == 0x000008, "Wrong alignment on ShopItemUI_C_GetColorAndOpacity_0");
static_assert(sizeof(ShopItemUI_C_GetColorAndOpacity_0) == 0x000080, "Wrong size on ShopItemUI_C_GetColorAndOpacity_0");
static_assert(offsetof(ShopItemUI_C_GetColorAndOpacity_0, ReturnValue) == 0x000000, "Member 'ShopItemUI_C_GetColorAndOpacity_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_GetColorAndOpacity_0, K2Node_MakeStruct_SlateColor) == 0x000028, "Member 'ShopItemUI_C_GetColorAndOpacity_0::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_GetColorAndOpacity_0, K2Node_MakeStruct_SlateColor_1) == 0x000050, "Member 'ShopItemUI_C_GetColorAndOpacity_0::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_GetColorAndOpacity_0, CallFunc_IsValidClass_ReturnValue) == 0x000078, "Member 'ShopItemUI_C_GetColorAndOpacity_0::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_GetColorAndOpacity_0, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000079, "Member 'ShopItemUI_C_GetColorAndOpacity_0::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function ShopItemUI.ShopItemUI_C.GetText_2
// 0x0060 (0x0060 - 0x0000)
struct ShopItemUI_C_GetText_2 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0048(0x0018)()
};
static_assert(alignof(ShopItemUI_C_GetText_2) == 0x000008, "Wrong alignment on ShopItemUI_C_GetText_2");
static_assert(sizeof(ShopItemUI_C_GetText_2) == 0x000060, "Wrong size on ShopItemUI_C_GetText_2");
static_assert(offsetof(ShopItemUI_C_GetText_2, ReturnValue) == 0x000000, "Member 'ShopItemUI_C_GetText_2::ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_GetText_2, CallFunc_IsValidClass_ReturnValue) == 0x000018, "Member 'ShopItemUI_C_GetText_2::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_GetText_2, CallFunc_Conv_IntToText_ReturnValue) == 0x000020, "Member 'ShopItemUI_C_GetText_2::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_GetText_2, CallFunc_Conv_TextToString_ReturnValue) == 0x000038, "Member 'ShopItemUI_C_GetText_2::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_GetText_2, CallFunc_Conv_StringToText_ReturnValue) == 0x000048, "Member 'ShopItemUI_C_GetText_2::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function ShopItemUI.ShopItemUI_C.Get_Rarity_ColorAndOpacity_0
// 0x0068 (0x0068 - 0x0000)
struct ShopItemUI_C_Get_Rarity_ColorAndOpacity_0 final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERarityNum                                    Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShopItemUI_C_Get_Rarity_ColorAndOpacity_0) == 0x000004, "Wrong alignment on ShopItemUI_C_Get_Rarity_ColorAndOpacity_0");
static_assert(sizeof(ShopItemUI_C_Get_Rarity_ColorAndOpacity_0) == 0x000068, "Wrong size on ShopItemUI_C_Get_Rarity_ColorAndOpacity_0");
static_assert(offsetof(ShopItemUI_C_Get_Rarity_ColorAndOpacity_0, ReturnValue) == 0x000000, "Member 'ShopItemUI_C_Get_Rarity_ColorAndOpacity_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_Get_Rarity_ColorAndOpacity_0, Temp_byte_Variable) == 0x000010, "Member 'ShopItemUI_C_Get_Rarity_ColorAndOpacity_0::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_Get_Rarity_ColorAndOpacity_0, Temp_struct_Variable) == 0x000014, "Member 'ShopItemUI_C_Get_Rarity_ColorAndOpacity_0::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_Get_Rarity_ColorAndOpacity_0, Temp_struct_Variable_1) == 0x000024, "Member 'ShopItemUI_C_Get_Rarity_ColorAndOpacity_0::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_Get_Rarity_ColorAndOpacity_0, Temp_struct_Variable_2) == 0x000034, "Member 'ShopItemUI_C_Get_Rarity_ColorAndOpacity_0::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_Get_Rarity_ColorAndOpacity_0, Temp_struct_Variable_3) == 0x000044, "Member 'ShopItemUI_C_Get_Rarity_ColorAndOpacity_0::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_Get_Rarity_ColorAndOpacity_0, CallFunc_IsValidClass_ReturnValue) == 0x000054, "Member 'ShopItemUI_C_Get_Rarity_ColorAndOpacity_0::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_Get_Rarity_ColorAndOpacity_0, K2Node_Select_Default) == 0x000058, "Member 'ShopItemUI_C_Get_Rarity_ColorAndOpacity_0::K2Node_Select_Default' has a wrong offset!");

// Function ShopItemUI.ShopItemUI_C.Get_AlreadyOwnedBorder_Visibility_0
// 0x0001 (0x0001 - 0x0000)
struct ShopItemUI_C_Get_AlreadyOwnedBorder_Visibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShopItemUI_C_Get_AlreadyOwnedBorder_Visibility_0) == 0x000001, "Wrong alignment on ShopItemUI_C_Get_AlreadyOwnedBorder_Visibility_0");
static_assert(sizeof(ShopItemUI_C_Get_AlreadyOwnedBorder_Visibility_0) == 0x000001, "Wrong size on ShopItemUI_C_Get_AlreadyOwnedBorder_Visibility_0");
static_assert(offsetof(ShopItemUI_C_Get_AlreadyOwnedBorder_Visibility_0, ReturnValue) == 0x000000, "Member 'ShopItemUI_C_Get_AlreadyOwnedBorder_Visibility_0::ReturnValue' has a wrong offset!");

// Function ShopItemUI.ShopItemUI_C.SetRandomNumber
// 0x0028 (0x0028 - 0x0000)
struct ShopItemUI_C_SetRandomNumber final
{
public:
	int64                                         CallFunc_RandomInteger64InRange_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Multiply_Int64Int64_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShopItemUI_C_SetRandomNumber) == 0x000008, "Wrong alignment on ShopItemUI_C_SetRandomNumber");
static_assert(sizeof(ShopItemUI_C_SetRandomNumber) == 0x000028, "Wrong size on ShopItemUI_C_SetRandomNumber");
static_assert(offsetof(ShopItemUI_C_SetRandomNumber, CallFunc_RandomInteger64InRange_ReturnValue) == 0x000000, "Member 'ShopItemUI_C_SetRandomNumber::CallFunc_RandomInteger64InRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_SetRandomNumber, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'ShopItemUI_C_SetRandomNumber::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShopItemUI_C_SetRandomNumber, CallFunc_Add_IntInt_ReturnValue_1) == 0x00000C, "Member 'ShopItemUI_C_SetRandomNumber::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
