#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShopItemUI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "RarityNum_structs.hpp"
#include "ShopItemCategory_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ShopItemUI.ShopItemUI_C
// 0x00C8 (0x0328 - 0x0260)
class UShopItemUI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                AlreadyOwnedBorder;                                // 0x0268(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         CashCostBox;                                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         CoinCostBox;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_132;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_174;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_186;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PriceBox;                                          // 0x02A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Rarity;                                            // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               SaleOverlay;                                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x02B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_63;                                      // 0x02C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_85;                                      // 0x02C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_101;                                     // 0x02D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_172;                                     // 0x02D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         UnlockBox;                                         // 0x02E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 Item;                                              // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class ARobberController_C*                    As_Robber_Controller;                              // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InShop_;                                           // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGunBase_C*                             GunRef;                                            // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         ItemIndexReference;                                // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          AutoEquip_;                                        // 0x030C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          AleadyOwned_;                                      // 0x030D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_30E[0x2];                                      // 0x030E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         Multiplier;                                        // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         InitialMultipluerValue;                            // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SaleAmount;                                        // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         PriceAfterSale;                                    // 0x0324(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ShopItemUI(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void StopCompare();
	void BndEvt__GunModChild_Button_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__ShopItemUI_Button_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__ShopItemUI_Button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void PreviewItem(class UClass* ItemInfo, int32 SalePrice);
	void CancelDrag();
	void DragItemFromCategory(EShopItemCategory Category);
	void ChangeCategory(EShopItemCategory Category);
	void RemoveloadoutCategory();
	void RefreshInventory();
	void Remove();
	class FText GetText_0();
	class FText PriceText();
	ESlateVisibility Get_CoinCostBox_Visibility_0();
	ESlateVisibility Get_CashCostBox_Visibility_0();
	ESlateVisibility Get_UnlockBox_Visibility_0();
	ESlateVisibility Get_PriceBox_Visibility_0();
	class FText GetText_1();
	struct FSlateBrush GetBrush_0();
	struct FSlateColor GetColorAndOpacity_0();
	class FText GetText_2();
	struct FLinearColor Get_Rarity_ColorAndOpacity_0();
	ESlateVisibility Get_AlreadyOwnedBorder_Visibility_0();
	void SetRandomNumber();
	ESlateVisibility Get_SaleOverlay_Visibility_0();
	class FText PriceWithSale();
	void SetSalePrice();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ShopItemUI_C">();
	}
	static class UShopItemUI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShopItemUI_C>();
	}
};
static_assert(alignof(UShopItemUI_C) == 0x000008, "Wrong alignment on UShopItemUI_C");
static_assert(sizeof(UShopItemUI_C) == 0x000328, "Wrong size on UShopItemUI_C");
static_assert(offsetof(UShopItemUI_C, UberGraphFrame) == 0x000260, "Member 'UShopItemUI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UShopItemUI_C, AlreadyOwnedBorder) == 0x000268, "Member 'UShopItemUI_C::AlreadyOwnedBorder' has a wrong offset!");
static_assert(offsetof(UShopItemUI_C, Button) == 0x000270, "Member 'UShopItemUI_C::Button' has a wrong offset!");
static_assert(offsetof(UShopItemUI_C, CashCostBox) == 0x000278, "Member 'UShopItemUI_C::CashCostBox' has a wrong offset!");
static_assert(offsetof(UShopItemUI_C, CoinCostBox) == 0x000280, "Member 'UShopItemUI_C::CoinCostBox' has a wrong offset!");
static_assert(offsetof(UShopItemUI_C, Image_132) == 0x000288, "Member 'UShopItemUI_C::Image_132' has a wrong offset!");
static_assert(offsetof(UShopItemUI_C, Image_174) == 0x000290, "Member 'UShopItemUI_C::Image_174' has a wrong offset!");
static_assert(offsetof(UShopItemUI_C, Image_186) == 0x000298, "Member 'UShopItemUI_C::Image_186' has a wrong offset!");
static_assert(offsetof(UShopItemUI_C, PriceBox) == 0x0002A0, "Member 'UShopItemUI_C::PriceBox' has a wrong offset!");
static_assert(offsetof(UShopItemUI_C, Rarity) == 0x0002A8, "Member 'UShopItemUI_C::Rarity' has a wrong offset!");
static_assert(offsetof(UShopItemUI_C, SaleOverlay) == 0x0002B0, "Member 'UShopItemUI_C::SaleOverlay' has a wrong offset!");
static_assert(offsetof(UShopItemUI_C, TextBlock) == 0x0002B8, "Member 'UShopItemUI_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UShopItemUI_C, TextBlock_63) == 0x0002C0, "Member 'UShopItemUI_C::TextBlock_63' has a wrong offset!");
static_assert(offsetof(UShopItemUI_C, TextBlock_85) == 0x0002C8, "Member 'UShopItemUI_C::TextBlock_85' has a wrong offset!");
static_assert(offsetof(UShopItemUI_C, TextBlock_101) == 0x0002D0, "Member 'UShopItemUI_C::TextBlock_101' has a wrong offset!");
static_assert(offsetof(UShopItemUI_C, TextBlock_172) == 0x0002D8, "Member 'UShopItemUI_C::TextBlock_172' has a wrong offset!");
static_assert(offsetof(UShopItemUI_C, UnlockBox) == 0x0002E0, "Member 'UShopItemUI_C::UnlockBox' has a wrong offset!");
static_assert(offsetof(UShopItemUI_C, Item) == 0x0002E8, "Member 'UShopItemUI_C::Item' has a wrong offset!");
static_assert(offsetof(UShopItemUI_C, As_Robber_Controller) == 0x0002F0, "Member 'UShopItemUI_C::As_Robber_Controller' has a wrong offset!");
static_assert(offsetof(UShopItemUI_C, InShop_) == 0x0002F8, "Member 'UShopItemUI_C::InShop_' has a wrong offset!");
static_assert(offsetof(UShopItemUI_C, GunRef) == 0x000300, "Member 'UShopItemUI_C::GunRef' has a wrong offset!");
static_assert(offsetof(UShopItemUI_C, ItemIndexReference) == 0x000308, "Member 'UShopItemUI_C::ItemIndexReference' has a wrong offset!");
static_assert(offsetof(UShopItemUI_C, AutoEquip_) == 0x00030C, "Member 'UShopItemUI_C::AutoEquip_' has a wrong offset!");
static_assert(offsetof(UShopItemUI_C, AleadyOwned_) == 0x00030D, "Member 'UShopItemUI_C::AleadyOwned_' has a wrong offset!");
static_assert(offsetof(UShopItemUI_C, Multiplier) == 0x000310, "Member 'UShopItemUI_C::Multiplier' has a wrong offset!");
static_assert(offsetof(UShopItemUI_C, InitialMultipluerValue) == 0x000318, "Member 'UShopItemUI_C::InitialMultipluerValue' has a wrong offset!");
static_assert(offsetof(UShopItemUI_C, SaleAmount) == 0x000320, "Member 'UShopItemUI_C::SaleAmount' has a wrong offset!");
static_assert(offsetof(UShopItemUI_C, PriceAfterSale) == 0x000324, "Member 'UShopItemUI_C::PriceAfterSale' has a wrong offset!");

}

