#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShopBuyUI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "ShopItemCategory_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ShopBuyUI.ShopBuyUI_C
// 0x0088 (0x02E8 - 0x0260)
class UShopBuyUI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_629;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                CashBuyButton;                                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                CloseButton;                                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_223;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x0290(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_79;                                      // 0x0298(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_343;                                     // 0x02A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UThrobber*                              Throbber_49;                                       // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 Item;                                              // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Coin_;                                             // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARobberController_C*                    As_Robber_Controller;                              // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Purchased_;                                        // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UShopUI_C*                              ParentWidget;                                      // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         ItemIndexReference;                                // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          AutoEquip_;                                        // 0x02DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          Map_;                                              // 0x02DD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_2DE[0x2];                                      // 0x02DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SalePrice;                                         // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ShopBuyUI(int32 EntryPoint);
	void RefreshInventoryAndClose();
	void CheckCanBuy();
	void BndEvt__ShopBuyUI_Button_629_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__ShopBuyUI_CloseButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__ShopBuyUI_CashBuyButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	class FText GetText_0();
	struct FSlateBrush GetBrush_0();
	class FText GetText_1();
	class FText GetText_2();
	ESlateVisibility VisibleWhenPurchased();
	ESlateVisibility HiddenWhenPurchased();
	ESlateVisibility GetVisibility_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ShopBuyUI_C">();
	}
	static class UShopBuyUI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShopBuyUI_C>();
	}
};
static_assert(alignof(UShopBuyUI_C) == 0x000008, "Wrong alignment on UShopBuyUI_C");
static_assert(sizeof(UShopBuyUI_C) == 0x0002E8, "Wrong size on UShopBuyUI_C");
static_assert(offsetof(UShopBuyUI_C, UberGraphFrame) == 0x000260, "Member 'UShopBuyUI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UShopBuyUI_C, Button_629) == 0x000268, "Member 'UShopBuyUI_C::Button_629' has a wrong offset!");
static_assert(offsetof(UShopBuyUI_C, CashBuyButton) == 0x000270, "Member 'UShopBuyUI_C::CashBuyButton' has a wrong offset!");
static_assert(offsetof(UShopBuyUI_C, CloseButton) == 0x000278, "Member 'UShopBuyUI_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UShopBuyUI_C, Image_0) == 0x000280, "Member 'UShopBuyUI_C::Image_0' has a wrong offset!");
static_assert(offsetof(UShopBuyUI_C, Image_223) == 0x000288, "Member 'UShopBuyUI_C::Image_223' has a wrong offset!");
static_assert(offsetof(UShopBuyUI_C, TextBlock) == 0x000290, "Member 'UShopBuyUI_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UShopBuyUI_C, TextBlock_79) == 0x000298, "Member 'UShopBuyUI_C::TextBlock_79' has a wrong offset!");
static_assert(offsetof(UShopBuyUI_C, TextBlock_343) == 0x0002A0, "Member 'UShopBuyUI_C::TextBlock_343' has a wrong offset!");
static_assert(offsetof(UShopBuyUI_C, Throbber_49) == 0x0002A8, "Member 'UShopBuyUI_C::Throbber_49' has a wrong offset!");
static_assert(offsetof(UShopBuyUI_C, Item) == 0x0002B0, "Member 'UShopBuyUI_C::Item' has a wrong offset!");
static_assert(offsetof(UShopBuyUI_C, Coin_) == 0x0002B8, "Member 'UShopBuyUI_C::Coin_' has a wrong offset!");
static_assert(offsetof(UShopBuyUI_C, As_Robber_Controller) == 0x0002C0, "Member 'UShopBuyUI_C::As_Robber_Controller' has a wrong offset!");
static_assert(offsetof(UShopBuyUI_C, Purchased_) == 0x0002C8, "Member 'UShopBuyUI_C::Purchased_' has a wrong offset!");
static_assert(offsetof(UShopBuyUI_C, ParentWidget) == 0x0002D0, "Member 'UShopBuyUI_C::ParentWidget' has a wrong offset!");
static_assert(offsetof(UShopBuyUI_C, ItemIndexReference) == 0x0002D8, "Member 'UShopBuyUI_C::ItemIndexReference' has a wrong offset!");
static_assert(offsetof(UShopBuyUI_C, AutoEquip_) == 0x0002DC, "Member 'UShopBuyUI_C::AutoEquip_' has a wrong offset!");
static_assert(offsetof(UShopBuyUI_C, Map_) == 0x0002DD, "Member 'UShopBuyUI_C::Map_' has a wrong offset!");
static_assert(offsetof(UShopBuyUI_C, SalePrice) == 0x0002E0, "Member 'UShopBuyUI_C::SalePrice' has a wrong offset!");

}

