#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShopItem_Map_base

#include "Basic.hpp"

#include "MapDifficulty_structs.hpp"
#include "ShopItem_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ShopItem_Map_base.ShopItem_Map_base_C
// 0x0050 (0x02C0 - 0x0270)
class AShopItem_Map_base_C : public AShopItem_Base_C
{
public:
	class FString                                 Filename;                                          // 0x0270(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Cash_low_estimate;                                 // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Cash_high_estimate;                                // 0x0284(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	EMapDifficulty                                Difficulty;                                        // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             MainObjectiveIcon;                                 // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTexture2D*                             SketchIcon;                                        // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UBaseMediaSource*                       MapTrailerMedia;                                   // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         Setups;                                            // 0x02A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         MinSetupsRequired;                                 // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ShopItem_Map_base_C">();
	}
	static class AShopItem_Map_base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AShopItem_Map_base_C>();
	}
};
static_assert(alignof(AShopItem_Map_base_C) == 0x000008, "Wrong alignment on AShopItem_Map_base_C");
static_assert(sizeof(AShopItem_Map_base_C) == 0x0002C0, "Wrong size on AShopItem_Map_base_C");
static_assert(offsetof(AShopItem_Map_base_C, Filename) == 0x000270, "Member 'AShopItem_Map_base_C::Filename' has a wrong offset!");
static_assert(offsetof(AShopItem_Map_base_C, Cash_low_estimate) == 0x000280, "Member 'AShopItem_Map_base_C::Cash_low_estimate' has a wrong offset!");
static_assert(offsetof(AShopItem_Map_base_C, Cash_high_estimate) == 0x000284, "Member 'AShopItem_Map_base_C::Cash_high_estimate' has a wrong offset!");
static_assert(offsetof(AShopItem_Map_base_C, Difficulty) == 0x000288, "Member 'AShopItem_Map_base_C::Difficulty' has a wrong offset!");
static_assert(offsetof(AShopItem_Map_base_C, MainObjectiveIcon) == 0x000290, "Member 'AShopItem_Map_base_C::MainObjectiveIcon' has a wrong offset!");
static_assert(offsetof(AShopItem_Map_base_C, SketchIcon) == 0x000298, "Member 'AShopItem_Map_base_C::SketchIcon' has a wrong offset!");
static_assert(offsetof(AShopItem_Map_base_C, MapTrailerMedia) == 0x0002A0, "Member 'AShopItem_Map_base_C::MapTrailerMedia' has a wrong offset!");
static_assert(offsetof(AShopItem_Map_base_C, Setups) == 0x0002A8, "Member 'AShopItem_Map_base_C::Setups' has a wrong offset!");
static_assert(offsetof(AShopItem_Map_base_C, MinSetupsRequired) == 0x0002B8, "Member 'AShopItem_Map_base_C::MinSetupsRequired' has a wrong offset!");

}

