#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Sign

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Sign.Sign_C
// 0x0020 (0x0240 - 0x0220)
class ASign_C final : public AActor
{
public:
	class UTextRenderComponent*                   TextRender;                                        // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FString                                 Text;                                              // 0x0230(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Sign_C">();
	}
	static class ASign_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASign_C>();
	}
};
static_assert(alignof(ASign_C) == 0x000008, "Wrong alignment on ASign_C");
static_assert(sizeof(ASign_C) == 0x000240, "Wrong size on ASign_C");
static_assert(offsetof(ASign_C, TextRender) == 0x000220, "Member 'ASign_C::TextRender' has a wrong offset!");
static_assert(offsetof(ASign_C, StaticMesh) == 0x000228, "Member 'ASign_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ASign_C, Text) == 0x000230, "Member 'ASign_C::Text' has a wrong offset!");

}

