#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkillChildUI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "ShopItemCategory_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SkillChildUI.SkillChildUI_C
// 0x0070 (0x02D0 - 0x0260)
class USkillChildUI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_66;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_132;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_284;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_108;                                   // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_87;                                        // 0x0290(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_115;                                     // 0x0298(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_172;                                     // 0x02A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TierGlow;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         UnlockBox;                                         // 0x02B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 SkillInfo;                                         // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class ARobberController_C*                    As_Robber_Controller;                              // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Tier;                                              // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SkillChildUI(int32 EntryPoint);
	void FindTier();
	void BndEvt__SkillChildUI_Button_66_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__SkillChildUI_Button_66_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void Construct();
	void PreviewItem(class UClass* ItemInfo, int32 SalePrice);
	void CancelDrag();
	void DragItemFromCategory(EShopItemCategory Category);
	void ChangeCategory(EShopItemCategory Category);
	void RemoveloadoutCategory();
	void RefreshInventory();
	void Remove();
	struct FSlateBrush GetBrush_0();
	class FText GetText_0();
	struct FLinearColor Get_Rarity_ColorAndOpacity_0();
	class FText GetText_1();
	ESlateVisibility Get_UnlockBox_Visibility_0();
	ESlateVisibility GetVisibility_0();
	float GetPercent_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SkillChildUI_C">();
	}
	static class USkillChildUI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USkillChildUI_C>();
	}
};
static_assert(alignof(USkillChildUI_C) == 0x000008, "Wrong alignment on USkillChildUI_C");
static_assert(sizeof(USkillChildUI_C) == 0x0002D0, "Wrong size on USkillChildUI_C");
static_assert(offsetof(USkillChildUI_C, UberGraphFrame) == 0x000260, "Member 'USkillChildUI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USkillChildUI_C, HoverAnim) == 0x000268, "Member 'USkillChildUI_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(USkillChildUI_C, Button_66) == 0x000270, "Member 'USkillChildUI_C::Button_66' has a wrong offset!");
static_assert(offsetof(USkillChildUI_C, Image_132) == 0x000278, "Member 'USkillChildUI_C::Image_132' has a wrong offset!");
static_assert(offsetof(USkillChildUI_C, Image_284) == 0x000280, "Member 'USkillChildUI_C::Image_284' has a wrong offset!");
static_assert(offsetof(USkillChildUI_C, ProgressBar_108) == 0x000288, "Member 'USkillChildUI_C::ProgressBar_108' has a wrong offset!");
static_assert(offsetof(USkillChildUI_C, SizeBox_87) == 0x000290, "Member 'USkillChildUI_C::SizeBox_87' has a wrong offset!");
static_assert(offsetof(USkillChildUI_C, TextBlock_115) == 0x000298, "Member 'USkillChildUI_C::TextBlock_115' has a wrong offset!");
static_assert(offsetof(USkillChildUI_C, TextBlock_172) == 0x0002A0, "Member 'USkillChildUI_C::TextBlock_172' has a wrong offset!");
static_assert(offsetof(USkillChildUI_C, TierGlow) == 0x0002A8, "Member 'USkillChildUI_C::TierGlow' has a wrong offset!");
static_assert(offsetof(USkillChildUI_C, UnlockBox) == 0x0002B0, "Member 'USkillChildUI_C::UnlockBox' has a wrong offset!");
static_assert(offsetof(USkillChildUI_C, SkillInfo) == 0x0002B8, "Member 'USkillChildUI_C::SkillInfo' has a wrong offset!");
static_assert(offsetof(USkillChildUI_C, As_Robber_Controller) == 0x0002C0, "Member 'USkillChildUI_C::As_Robber_Controller' has a wrong offset!");
static_assert(offsetof(USkillChildUI_C, Tier) == 0x0002C8, "Member 'USkillChildUI_C::Tier' has a wrong offset!");

}

