#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkinShop

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SkinRotationStructure_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ShopItemCategory_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SkinShop.SkinShop_C
// 0x0100 (0x0360 - 0x0260)
class USkinShop_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SwipeInAnim;                                       // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                BackButton;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_0;                                          // 0x0278(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                CashBuyButton;                                     // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                CoinBuyButton;                                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                DescriptionBorder;                                 // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               FeatureItemsWrap;                                  // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_0;                                   // 0x02A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_124;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             InventoryScroll;                                   // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               InventoryWrap;                                     // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShopCategoryTab_C*                     ShopCategoryTab;                                   // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShopCategoryTab_C*                     ShopCategoryTab_1;                                 // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShopCategoryTab_C*                     ShopCategoryTab_2;                                 // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x02D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_0;                                       // 0x02E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_1;                                       // 0x02E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_3;                                       // 0x02F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_4;                                       // 0x02F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShopUI_C*                              ShopParent;                                        // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FTimespan                              TimeLeft;                                          // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         RotationNumber;                                    // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Item_Info;                                         // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARobberController_C*                    As_Robber_Controller;                              // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         FeaturedItems;                                     // 0x0328(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FSkinRotationStructure>         SkinRotationStruct;                                // 0x0338(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         FocusedItemSalePrice;                              // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EShopItemCategory>                     Categories;                                        // 0x0350(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_SkinShop(int32 EntryPoint);
	void AddItemsFromCategory(EShopItemCategory Category);
	void AddCategories();
	void ChangeCategory(EShopItemCategory Category);
	void BndEvt__SkinShop_CashBuyButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void RefreshInventory();
	void BndEvt__SkinShop_CoinBuyButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void PreviewItem(class UClass* ItemInfo, int32 SalePrice);
	void BndEvt__SkinShop_Tools_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Remove();
	void Construct();
	void CancelDrag();
	void DragItemFromCategory(EShopItemCategory Category);
	void RemoveloadoutCategory();
	void FindTimeLeft(int32* SkinRot);
	class FText GetText_0();
	class FText GetText_1();
	class FText GetText_2();
	ESlateVisibility Get_CoinBuyButton_Visibility_0();
	ESlateVisibility Get_CashBuyButton_Visibility_0();
	ESlateVisibility GetVisibility_0();
	class FText GetText_3();
	class FText GetText_4();
	struct FSlateColor GetColorAndOpacity_0();
	ESlateVisibility GetVisibility_1();
	void AddPreviousRotationItemsToFeatured();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SkinShop_C">();
	}
	static class USkinShop_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USkinShop_C>();
	}
};
static_assert(alignof(USkinShop_C) == 0x000008, "Wrong alignment on USkinShop_C");
static_assert(sizeof(USkinShop_C) == 0x000360, "Wrong size on USkinShop_C");
static_assert(offsetof(USkinShop_C, UberGraphFrame) == 0x000260, "Member 'USkinShop_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USkinShop_C, SwipeInAnim) == 0x000268, "Member 'USkinShop_C::SwipeInAnim' has a wrong offset!");
static_assert(offsetof(USkinShop_C, BackButton) == 0x000270, "Member 'USkinShop_C::BackButton' has a wrong offset!");
static_assert(offsetof(USkinShop_C, Border_0) == 0x000278, "Member 'USkinShop_C::Border_0' has a wrong offset!");
static_assert(offsetof(USkinShop_C, CashBuyButton) == 0x000280, "Member 'USkinShop_C::CashBuyButton' has a wrong offset!");
static_assert(offsetof(USkinShop_C, CoinBuyButton) == 0x000288, "Member 'USkinShop_C::CoinBuyButton' has a wrong offset!");
static_assert(offsetof(USkinShop_C, DescriptionBorder) == 0x000290, "Member 'USkinShop_C::DescriptionBorder' has a wrong offset!");
static_assert(offsetof(USkinShop_C, FeatureItemsWrap) == 0x000298, "Member 'USkinShop_C::FeatureItemsWrap' has a wrong offset!");
static_assert(offsetof(USkinShop_C, HorizontalBox_0) == 0x0002A0, "Member 'USkinShop_C::HorizontalBox_0' has a wrong offset!");
static_assert(offsetof(USkinShop_C, Image_124) == 0x0002A8, "Member 'USkinShop_C::Image_124' has a wrong offset!");
static_assert(offsetof(USkinShop_C, InventoryScroll) == 0x0002B0, "Member 'USkinShop_C::InventoryScroll' has a wrong offset!");
static_assert(offsetof(USkinShop_C, InventoryWrap) == 0x0002B8, "Member 'USkinShop_C::InventoryWrap' has a wrong offset!");
static_assert(offsetof(USkinShop_C, ShopCategoryTab) == 0x0002C0, "Member 'USkinShop_C::ShopCategoryTab' has a wrong offset!");
static_assert(offsetof(USkinShop_C, ShopCategoryTab_1) == 0x0002C8, "Member 'USkinShop_C::ShopCategoryTab_1' has a wrong offset!");
static_assert(offsetof(USkinShop_C, ShopCategoryTab_2) == 0x0002D0, "Member 'USkinShop_C::ShopCategoryTab_2' has a wrong offset!");
static_assert(offsetof(USkinShop_C, TextBlock) == 0x0002D8, "Member 'USkinShop_C::TextBlock' has a wrong offset!");
static_assert(offsetof(USkinShop_C, TextBlock_0) == 0x0002E0, "Member 'USkinShop_C::TextBlock_0' has a wrong offset!");
static_assert(offsetof(USkinShop_C, TextBlock_1) == 0x0002E8, "Member 'USkinShop_C::TextBlock_1' has a wrong offset!");
static_assert(offsetof(USkinShop_C, TextBlock_3) == 0x0002F0, "Member 'USkinShop_C::TextBlock_3' has a wrong offset!");
static_assert(offsetof(USkinShop_C, TextBlock_4) == 0x0002F8, "Member 'USkinShop_C::TextBlock_4' has a wrong offset!");
static_assert(offsetof(USkinShop_C, ShopParent) == 0x000300, "Member 'USkinShop_C::ShopParent' has a wrong offset!");
static_assert(offsetof(USkinShop_C, TimeLeft) == 0x000308, "Member 'USkinShop_C::TimeLeft' has a wrong offset!");
static_assert(offsetof(USkinShop_C, RotationNumber) == 0x000310, "Member 'USkinShop_C::RotationNumber' has a wrong offset!");
static_assert(offsetof(USkinShop_C, Item_Info) == 0x000318, "Member 'USkinShop_C::Item_Info' has a wrong offset!");
static_assert(offsetof(USkinShop_C, As_Robber_Controller) == 0x000320, "Member 'USkinShop_C::As_Robber_Controller' has a wrong offset!");
static_assert(offsetof(USkinShop_C, FeaturedItems) == 0x000328, "Member 'USkinShop_C::FeaturedItems' has a wrong offset!");
static_assert(offsetof(USkinShop_C, SkinRotationStruct) == 0x000338, "Member 'USkinShop_C::SkinRotationStruct' has a wrong offset!");
static_assert(offsetof(USkinShop_C, FocusedItemSalePrice) == 0x000348, "Member 'USkinShop_C::FocusedItemSalePrice' has a wrong offset!");
static_assert(offsetof(USkinShop_C, Categories) == 0x000350, "Member 'USkinShop_C::Categories' has a wrong offset!");

}

