#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SteamFriend_parent

#include "Basic.hpp"

#include "AdvancedSessions_structs.hpp"


namespace SDK::Params
{

// Function SteamFriend_parent.SteamFriend_parent_C.ExecuteUbergraph_SteamFriend_parent
// 0x0338 (0x0338 - 0x0000)
struct SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USteamFriend_child_C*                   CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USteamFriend_child_C*                   CallFunc_Create_ReturnValue_1;                     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USteamFriend_child_C*                   CallFunc_Create_ReturnValue_2;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USteamFriend_child_C*                   CallFunc_Create_ReturnValue_3;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBPFriendInfo>                  Temp_struct_Variable;                              // 0x0040(0x0010)(ReferenceParm)
	struct FBPFriendInfo                          CallFunc_Array_Get_Item;                           // 0x0050(0x0068)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBPFriendInfo                          CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0068)()
	EBlueprintResultSwitch                        CallFunc_GetSteamFriendGamePlayed_Result;          // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSteamFriendGamePlayed_AppID;           // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14A[0x2];                                      // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBPFriendInfo                          CallFunc_Array_Get_Item_2;                         // 0x0150(0x0068)()
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BD[0x3];                                      // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGetFriendsCallbackProxy*               CallFunc_GetAndStoreFriendsList_ReturnValue;       // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FBPFriendInfo>                  K2Node_CustomEvent_Results_1;                      // 0x01D8(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TArray<struct FBPFriendInfo>& Results)> K2Node_CreateDelegate_OutputDelegate;              // 0x01F8(0x0010)(ZeroConstructor, NoDestructor)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FBPFriendInfo>                  K2Node_CustomEvent_Results;                        // 0x0210(0x0010)(ConstParm, ReferenceParm)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_2;                   // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_3;                   // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBPFriendInfo                          K2Node_CustomEvent_Friend;                         // 0x0240(0x0068)()
	TDelegate<void(TArray<struct FBPFriendInfo>& Results)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x02A8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBPFriendInfo                          CallFunc_Array_Get_Item_3;                         // 0x02C0(0x0068)()
	EBlueprintResultSwitch                        CallFunc_GetSteamFriendGamePlayed_Result_1;        // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x3];                                      // 0x0329(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSteamFriendGamePlayed_AppID_1;         // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent) == 0x000008, "Wrong alignment on SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent");
static_assert(sizeof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent) == 0x000338, "Wrong size on SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, EntryPoint) == 0x000000, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, CallFunc_Create_ReturnValue) == 0x000010, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, CallFunc_Create_ReturnValue_1) == 0x000018, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, CallFunc_Create_ReturnValue_2) == 0x000020, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, CallFunc_Create_ReturnValue_3) == 0x000028, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, Temp_int_Loop_Counter_Variable_1) == 0x000030, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, CallFunc_Add_IntInt_ReturnValue_1) == 0x000034, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, Temp_int_Array_Index_Variable) == 0x000038, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, Temp_struct_Variable) == 0x000040, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, CallFunc_Array_Get_Item) == 0x000050, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, CallFunc_Array_Length_ReturnValue) == 0x0000B8, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, CallFunc_Array_Length_ReturnValue_1) == 0x0000BC, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000C0, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, CallFunc_Less_IntInt_ReturnValue) == 0x0000C1, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, CallFunc_Array_Length_ReturnValue_2) == 0x0000C4, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, CallFunc_Array_Length_ReturnValue_3) == 0x0000C8, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000CC, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, Temp_int_Array_Index_Variable_1) == 0x0000D0, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, CallFunc_Array_Get_Item_1) == 0x0000D8, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, CallFunc_GetSteamFriendGamePlayed_Result) == 0x000140, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::CallFunc_GetSteamFriendGamePlayed_Result' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, CallFunc_GetSteamFriendGamePlayed_AppID) == 0x000144, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::CallFunc_GetSteamFriendGamePlayed_AppID' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000148, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, K2Node_SwitchEnum_CmpSuccess) == 0x000149, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, Temp_int_Array_Index_Variable_2) == 0x00014C, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, CallFunc_Array_Get_Item_2) == 0x000150, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, Temp_int_Loop_Counter_Variable_2) == 0x0001B8, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, CallFunc_Less_IntInt_ReturnValue_2) == 0x0001BC, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, CallFunc_Add_IntInt_ReturnValue_2) == 0x0001C0, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, CallFunc_GetOwningPlayer_ReturnValue) == 0x0001C8, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, CallFunc_GetAndStoreFriendsList_ReturnValue) == 0x0001D0, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::CallFunc_GetAndStoreFriendsList_ReturnValue' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, K2Node_CustomEvent_Results_1) == 0x0001D8, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::K2Node_CustomEvent_Results_1' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, CallFunc_IsValid_ReturnValue) == 0x0001E8, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, CallFunc_AddChild_ReturnValue) == 0x0001F0, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, K2Node_CreateDelegate_OutputDelegate) == 0x0001F8, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, CallFunc_AddChild_ReturnValue_1) == 0x000208, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, K2Node_CustomEvent_Results) == 0x000210, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::K2Node_CustomEvent_Results' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, CallFunc_AddChild_ReturnValue_2) == 0x000220, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::CallFunc_AddChild_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, Temp_int_Loop_Counter_Variable_3) == 0x000228, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, CallFunc_AddChild_ReturnValue_3) == 0x000230, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::CallFunc_AddChild_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, CallFunc_Less_IntInt_ReturnValue_3) == 0x000238, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, CallFunc_Add_IntInt_ReturnValue_3) == 0x00023C, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, K2Node_CustomEvent_Friend) == 0x000240, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::K2Node_CustomEvent_Friend' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, K2Node_CreateDelegate_OutputDelegate_1) == 0x0002A8, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, CallFunc_Array_Add_ReturnValue) == 0x0002B8, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, Temp_int_Array_Index_Variable_3) == 0x0002BC, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, CallFunc_Array_Get_Item_3) == 0x0002C0, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, CallFunc_GetSteamFriendGamePlayed_Result_1) == 0x000328, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::CallFunc_GetSteamFriendGamePlayed_Result_1' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, CallFunc_GetSteamFriendGamePlayed_AppID_1) == 0x00032C, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::CallFunc_GetSteamFriendGamePlayed_AppID_1' has a wrong offset!");
static_assert(offsetof(SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent, K2Node_SwitchEnum_CmpSuccess_1) == 0x000330, "Member 'SteamFriend_parent_C_ExecuteUbergraph_SteamFriend_parent::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");

// Function SteamFriend_parent.SteamFriend_parent_C.NewInvite
// 0x0068 (0x0068 - 0x0000)
struct SteamFriend_parent_C_NewInvite final
{
public:
	struct FBPFriendInfo                          Friend;                                            // 0x0000(0x0068)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(SteamFriend_parent_C_NewInvite) == 0x000008, "Wrong alignment on SteamFriend_parent_C_NewInvite");
static_assert(sizeof(SteamFriend_parent_C_NewInvite) == 0x000068, "Wrong size on SteamFriend_parent_C_NewInvite");
static_assert(offsetof(SteamFriend_parent_C_NewInvite, Friend) == 0x000000, "Member 'SteamFriend_parent_C_NewInvite::Friend' has a wrong offset!");

// Function SteamFriend_parent.SteamFriend_parent_C.OnSuccess_1633A15441575CAAA115EEA570C4599B
// 0x0010 (0x0010 - 0x0000)
struct SteamFriend_parent_C_OnSuccess_1633A15441575CAAA115EEA570C4599B final
{
public:
	TArray<struct FBPFriendInfo>                  Results;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(SteamFriend_parent_C_OnSuccess_1633A15441575CAAA115EEA570C4599B) == 0x000008, "Wrong alignment on SteamFriend_parent_C_OnSuccess_1633A15441575CAAA115EEA570C4599B");
static_assert(sizeof(SteamFriend_parent_C_OnSuccess_1633A15441575CAAA115EEA570C4599B) == 0x000010, "Wrong size on SteamFriend_parent_C_OnSuccess_1633A15441575CAAA115EEA570C4599B");
static_assert(offsetof(SteamFriend_parent_C_OnSuccess_1633A15441575CAAA115EEA570C4599B, Results) == 0x000000, "Member 'SteamFriend_parent_C_OnSuccess_1633A15441575CAAA115EEA570C4599B::Results' has a wrong offset!");

// Function SteamFriend_parent.SteamFriend_parent_C.OnFailure_1633A15441575CAAA115EEA570C4599B
// 0x0010 (0x0010 - 0x0000)
struct SteamFriend_parent_C_OnFailure_1633A15441575CAAA115EEA570C4599B final
{
public:
	TArray<struct FBPFriendInfo>                  Results;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(SteamFriend_parent_C_OnFailure_1633A15441575CAAA115EEA570C4599B) == 0x000008, "Wrong alignment on SteamFriend_parent_C_OnFailure_1633A15441575CAAA115EEA570C4599B");
static_assert(sizeof(SteamFriend_parent_C_OnFailure_1633A15441575CAAA115EEA570C4599B) == 0x000010, "Wrong size on SteamFriend_parent_C_OnFailure_1633A15441575CAAA115EEA570C4599B");
static_assert(offsetof(SteamFriend_parent_C_OnFailure_1633A15441575CAAA115EEA570C4599B, Results) == 0x000000, "Member 'SteamFriend_parent_C_OnFailure_1633A15441575CAAA115EEA570C4599B::Results' has a wrong offset!");

}

