#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SteamCoreWeb

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "SteamCoreWeb_structs.hpp"
#include "Engine_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class SteamCoreWeb.SteamCoreWeb
// 0x0000 (0x0028 - 0x0028)
class USteamCoreWeb final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SteamCoreWeb">();
	}
	static class USteamCoreWeb* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamCoreWeb>();
	}
};
static_assert(alignof(USteamCoreWeb) == 0x000008, "Wrong alignment on USteamCoreWeb");
static_assert(sizeof(USteamCoreWeb) == 0x000028, "Wrong size on USteamCoreWeb");

// Class SteamCoreWeb.SteamCoreWebSubsystem
// 0x0018 (0x0048 - 0x0030)
class USteamCoreWebSubsystem : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x18];                                      // 0x0030(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SteamCoreWebSubsystem">();
	}
	static class USteamCoreWebSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamCoreWebSubsystem>();
	}
};
static_assert(alignof(USteamCoreWebSubsystem) == 0x000008, "Wrong alignment on USteamCoreWebSubsystem");
static_assert(sizeof(USteamCoreWebSubsystem) == 0x000048, "Wrong size on USteamCoreWebSubsystem");

// Class SteamCoreWeb.SteamCoreWebAsyncAction
// 0x0028 (0x0058 - 0x0030)
class USteamCoreWebAsyncAction : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_             OnCallback;                                        // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x18];                                      // 0x0040(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleCallback(const class FString& Data, bool bWasSuccessful);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SteamCoreWebAsyncAction">();
	}
	static class USteamCoreWebAsyncAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamCoreWebAsyncAction>();
	}
};
static_assert(alignof(USteamCoreWebAsyncAction) == 0x000008, "Wrong alignment on USteamCoreWebAsyncAction");
static_assert(sizeof(USteamCoreWebAsyncAction) == 0x000058, "Wrong size on USteamCoreWebAsyncAction");
static_assert(offsetof(USteamCoreWebAsyncAction, OnCallback) == 0x000030, "Member 'USteamCoreWebAsyncAction::OnCallback' has a wrong offset!");

// Class SteamCoreWeb.SteamCoreWebSettings
// 0x0040 (0x0078 - 0x0038)
class USteamCoreWebSettings final : public UDeveloperSettings
{
public:
	float                                         AsyncTaskTimeout;                                  // 0x0038(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DisabledSubsystems;                                // 0x003C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebugging;                                        // 0x0040(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDevMode;                                          // 0x0041(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Key;                                               // 0x0048(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AppID;                                             // 0x0058(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DevSteamID;                                        // 0x0060(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSandboxMode;                                      // 0x0070(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SteamCoreWebSettings">();
	}
	static class USteamCoreWebSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamCoreWebSettings>();
	}
};
static_assert(alignof(USteamCoreWebSettings) == 0x000008, "Wrong alignment on USteamCoreWebSettings");
static_assert(sizeof(USteamCoreWebSettings) == 0x000078, "Wrong size on USteamCoreWebSettings");
static_assert(offsetof(USteamCoreWebSettings, AsyncTaskTimeout) == 0x000038, "Member 'USteamCoreWebSettings::AsyncTaskTimeout' has a wrong offset!");
static_assert(offsetof(USteamCoreWebSettings, DisabledSubsystems) == 0x00003C, "Member 'USteamCoreWebSettings::DisabledSubsystems' has a wrong offset!");
static_assert(offsetof(USteamCoreWebSettings, bDebugging) == 0x000040, "Member 'USteamCoreWebSettings::bDebugging' has a wrong offset!");
static_assert(offsetof(USteamCoreWebSettings, bDevMode) == 0x000041, "Member 'USteamCoreWebSettings::bDevMode' has a wrong offset!");
static_assert(offsetof(USteamCoreWebSettings, Key) == 0x000048, "Member 'USteamCoreWebSettings::Key' has a wrong offset!");
static_assert(offsetof(USteamCoreWebSettings, AppID) == 0x000058, "Member 'USteamCoreWebSettings::AppID' has a wrong offset!");
static_assert(offsetof(USteamCoreWebSettings, DevSteamID) == 0x000060, "Member 'USteamCoreWebSettings::DevSteamID' has a wrong offset!");
static_assert(offsetof(USteamCoreWebSettings, bSandboxMode) == 0x000070, "Member 'USteamCoreWebSettings::bSandboxMode' has a wrong offset!");

// Class SteamCoreWeb.SteamWebUtilities
// 0x0000 (0x0028 - 0x0028)
class USteamWebUtilities final : public UBlueprintFunctionLibrary
{
public:
	static void FindJsonBool(const class FString& JsonString, const class FString& Key, bool* bValue, ESteamJsonResult* Result);
	static void FindJsonBools(const class FString& JsonString, const class FString& Key, TArray<bool>* bValues, ESteamJsonResult* Result);
	static void FindJsonNumber(const class FString& JsonString, const class FString& Key, int32* Value, ESteamJsonResult* Result);
	static void FindJsonNumbers(const class FString& JsonString, const class FString& Key, TArray<int32>* Values, ESteamJsonResult* Result);
	static void FindJsonString(const class FString& JsonString, const class FString& Key, class FString* Value, ESteamJsonResult* Result);
	static void FindJsonStrings(const class FString& JsonString, const class FString& Key, TArray<class FString>* Values, ESteamJsonResult* Result);
	static class FString GetDevSteamID();
	static int32 GetProjectAppID();
	static class FString GetProjectKey();
	static bool ParseJson(const class FString& JsonString, TArray<struct FSteamCoreJson>* Data);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SteamWebUtilities">();
	}
	static class USteamWebUtilities* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamWebUtilities>();
	}
};
static_assert(alignof(USteamWebUtilities) == 0x000008, "Wrong alignment on USteamWebUtilities");
static_assert(sizeof(USteamWebUtilities) == 0x000028, "Wrong size on USteamWebUtilities");

// Class SteamCoreWeb.WebApps
// 0x0000 (0x0048 - 0x0048)
class UWebApps final : public USteamCoreWebSubsystem
{
public:
	void GetAppBetas(const TDelegate<void(const class FString& Data, bool bWasSuccessful)>& Callback, const class FString& Key, int32 AppID);
	void GetAppBuilds(const TDelegate<void(const class FString& Data, bool bWasSuccessful)>& Callback, const class FString& Key, int32 AppID, int32 Count);
	void GetAppDepotVersions(const TDelegate<void(const class FString& Data, bool bWasSuccessful)>& Callback, const class FString& Key, int32 AppID);
	void GetAppList(const TDelegate<void(TArray<struct FWebAppsGetAppList>& Data, bool bWasSuccessful)>& Callback, const class FString& Key);
	void GetCheatingReports(const TDelegate<void(const class FString& Data, bool bWasSuccessful)>& Callback, const class FString& Key, int32 AppID, int32 TimeBegin, int32 TimeEnd, bool bIncludeReports, bool bIncludeBans, int32 ReportidMin);
	void GetPlayersBanned(const TDelegate<void(const class FString& Data, bool bWasSuccessful)>& Callback, const class FString& Key, int32 AppID);
	void GetServerList(const TDelegate<void(const class FString& Data, bool bWasSuccessful)>& Callback, const class FString& Key, const class FString& Filter, int32 Limit);
	void GetServersAtAddress(const TDelegate<void(const class FString& Data, bool bWasSuccessful)>& Callback, const class FString& Addr);
	void SetAppBuildLive(const TDelegate<void(const class FString& Data, bool bWasSuccessful)>& Callback, const class FString& Key, int32 AppID, int32 BuildID, const class FString& BetaKey, const class FString& Description);
	void UpToDateCheck(const TDelegate<void(const class FString& Data, bool bWasSuccessful)>& Callback, int32 AppID, int32 Version);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WebApps">();
	}
	static class UWebApps* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWebApps>();
	}
};
static_assert(alignof(UWebApps) == 0x000008, "Wrong alignment on UWebApps");
static_assert(sizeof(UWebApps) == 0x000048, "Wrong size on UWebApps");

// Class SteamCoreWeb.SteamCoreAppsAsyncActionGetAppBetas
// 0x0000 (0x0058 - 0x0058)
class USteamCoreAppsAsyncActionGetAppBetas final : public USteamCoreWebAsyncAction
{
public:
	static class USteamCoreAppsAsyncActionGetAppBetas* GetAppBetasAsync(class UObject* WorldContextObject, const class FString& Key, int32 AppID);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SteamCoreAppsAsyncActionGetAppBetas">();
	}
	static class USteamCoreAppsAsyncActionGetAppBetas* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamCoreAppsAsyncActionGetAppBetas>();
	}
};
static_assert(alignof(USteamCoreAppsAsyncActionGetAppBetas) == 0x000008, "Wrong alignment on USteamCoreAppsAsyncActionGetAppBetas");
static_assert(sizeof(USteamCoreAppsAsyncActionGetAppBetas) == 0x000058, "Wrong size on USteamCoreAppsAsyncActionGetAppBetas");

// Class SteamCoreWeb.SteamCoreAppsAsyncActionGetAppBuilds
// 0x0000 (0x0058 - 0x0058)
class USteamCoreAppsAsyncActionGetAppBuilds final : public USteamCoreWebAsyncAction
{
public:
	static class USteamCoreAppsAsyncActionGetAppBuilds* GetAppBuildsAsync(class UObject* WorldContextObject, const class FString& Key, int32 AppID, int32 Count);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SteamCoreAppsAsyncActionGetAppBuilds">();
	}
	static class USteamCoreAppsAsyncActionGetAppBuilds* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamCoreAppsAsyncActionGetAppBuilds>();
	}
};
static_assert(alignof(USteamCoreAppsAsyncActionGetAppBuilds) == 0x000008, "Wrong alignment on USteamCoreAppsAsyncActionGetAppBuilds");
static_assert(sizeof(USteamCoreAppsAsyncActionGetAppBuilds) == 0x000058, "Wrong size on USteamCoreAppsAsyncActionGetAppBuilds");

// Class SteamCoreWeb.SteamCoreAppsAsyncActionGetAppDepotVersions
// 0x0000 (0x0058 - 0x0058)
class USteamCoreAppsAsyncActionGetAppDepotVersions final : public USteamCoreWebAsyncAction
{
public:
	static class USteamCoreAppsAsyncActionGetAppDepotVersions* GetAppDepotVersionsAsync(class UObject* WorldContextObject, const class FString& Key, int32 AppID);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SteamCoreAppsAsyncActionGetAppDepotVersions">();
	}
	static class USteamCoreAppsAsyncActionGetAppDepotVersions* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamCoreAppsAsyncActionGetAppDepotVersions>();
	}
};
static_assert(alignof(USteamCoreAppsAsyncActionGetAppDepotVersions) == 0x000008, "Wrong alignment on USteamCoreAppsAsyncActionGetAppDepotVersions");
static_assert(sizeof(USteamCoreAppsAsyncActionGetAppDepotVersions) == 0x000058, "Wrong size on USteamCoreAppsAsyncActionGetAppDepotVersions");

// Class SteamCoreWeb.SteamCoreAppsAsyncActionGetAppList
// 0x0020 (0x0050 - 0x0030)
class USteamCoreAppsAsyncActionGetAppList final : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_             OnCallback;                                        // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class USteamCoreAppsAsyncActionGetAppList* GetAppListAsync(class UObject* WorldContextObject);

	void HandleCallback(const TArray<struct FWebAppsGetAppList>& Data, bool bWasSuccessful);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SteamCoreAppsAsyncActionGetAppList">();
	}
	static class USteamCoreAppsAsyncActionGetAppList* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamCoreAppsAsyncActionGetAppList>();
	}
};
static_assert(alignof(USteamCoreAppsAsyncActionGetAppList) == 0x000008, "Wrong alignment on USteamCoreAppsAsyncActionGetAppList");
static_assert(sizeof(USteamCoreAppsAsyncActionGetAppList) == 0x000050, "Wrong size on USteamCoreAppsAsyncActionGetAppList");
static_assert(offsetof(USteamCoreAppsAsyncActionGetAppList, OnCallback) == 0x000030, "Member 'USteamCoreAppsAsyncActionGetAppList::OnCallback' has a wrong offset!");

