#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SteamFriend_child

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AdvancedSessions_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SteamFriend_child.SteamFriend_child_C
// 0x00A0 (0x0300 - 0x0260)
class USteamFriend_child_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverName;                                         // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_238;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Friendimage;                                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             FriendName;                                        // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_348;                                     // 0x0288(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FBPFriendInfo                          FriendInfo;                                        // 0x0290(0x0068)(Edit, BlueprintVisible, ExposeOnSpawn)
	int32                                         FriendID;                                          // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SteamFriend_child(int32 EntryPoint);
	void BndEvt__SteamFriend_child_Button_238_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__SteamFriend_child_Button_238_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__SteamFriend_child_Button_238_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void Construct();
	void SetAvatar();
	void SetName();
	struct FSlateColor GetColor();
	ESlateVisibility GetVisibility_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SteamFriend_child_C">();
	}
	static class USteamFriend_child_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamFriend_child_C>();
	}
};
static_assert(alignof(USteamFriend_child_C) == 0x000008, "Wrong alignment on USteamFriend_child_C");
static_assert(sizeof(USteamFriend_child_C) == 0x000300, "Wrong size on USteamFriend_child_C");
static_assert(offsetof(USteamFriend_child_C, UberGraphFrame) == 0x000260, "Member 'USteamFriend_child_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USteamFriend_child_C, HoverName) == 0x000268, "Member 'USteamFriend_child_C::HoverName' has a wrong offset!");
static_assert(offsetof(USteamFriend_child_C, Button_238) == 0x000270, "Member 'USteamFriend_child_C::Button_238' has a wrong offset!");
static_assert(offsetof(USteamFriend_child_C, Friendimage) == 0x000278, "Member 'USteamFriend_child_C::Friendimage' has a wrong offset!");
static_assert(offsetof(USteamFriend_child_C, FriendName) == 0x000280, "Member 'USteamFriend_child_C::FriendName' has a wrong offset!");
static_assert(offsetof(USteamFriend_child_C, TextBlock_348) == 0x000288, "Member 'USteamFriend_child_C::TextBlock_348' has a wrong offset!");
static_assert(offsetof(USteamFriend_child_C, FriendInfo) == 0x000290, "Member 'USteamFriend_child_C::FriendInfo' has a wrong offset!");
static_assert(offsetof(USteamFriend_child_C, FriendID) == 0x0002F8, "Member 'USteamFriend_child_C::FriendID' has a wrong offset!");

}

