#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tool_AngleGrinder

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PickupItem_base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Tool_AngleGrinder.Tool_AngleGrinder_C
// 0x0068 (0x02C0 - 0x0258)
class ATool_AngleGrinder_C final : public APickupItem_base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Tool_AngleGrinder_C;                // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHighlightInRangeComponent_C*           HighlightInRangeComponent;                         // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        DrillSound;                                        // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Drill_Drill;                                       // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Drill_Drill3;                                      // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Drill_Drill2;                                      // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Drill_Drill1;                                      // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAlertComponent_C*                      AlertComponent;                                    // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHighlightWhenHolding_C*                HighlightWhenHolding;                              // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USusItemComponent_C*                    SusItemComponent;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UToolComponent_C*                       ToolComponent;                                     // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Tool_AngleGrinder(int32 EntryPoint);
	void BndEvt__DrillBP_ToolComponent_K2Node_ComponentBoundEvent_1_DeactivateTool__DelegateSignature();
	void BndEvt__DrillBP_ToolComponent_K2Node_ComponentBoundEvent_0_ActivateTool__DelegateSignature();
	void DeactivateDrill();
	void ActivateDrill();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Tool_AngleGrinder_C">();
	}
	static class ATool_AngleGrinder_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATool_AngleGrinder_C>();
	}
};
static_assert(alignof(ATool_AngleGrinder_C) == 0x000008, "Wrong alignment on ATool_AngleGrinder_C");
static_assert(sizeof(ATool_AngleGrinder_C) == 0x0002C0, "Wrong size on ATool_AngleGrinder_C");
static_assert(offsetof(ATool_AngleGrinder_C, UberGraphFrame_Tool_AngleGrinder_C) == 0x000258, "Member 'ATool_AngleGrinder_C::UberGraphFrame_Tool_AngleGrinder_C' has a wrong offset!");
static_assert(offsetof(ATool_AngleGrinder_C, HighlightInRangeComponent) == 0x000260, "Member 'ATool_AngleGrinder_C::HighlightInRangeComponent' has a wrong offset!");
static_assert(offsetof(ATool_AngleGrinder_C, DrillSound) == 0x000268, "Member 'ATool_AngleGrinder_C::DrillSound' has a wrong offset!");
static_assert(offsetof(ATool_AngleGrinder_C, Drill_Drill) == 0x000270, "Member 'ATool_AngleGrinder_C::Drill_Drill' has a wrong offset!");
static_assert(offsetof(ATool_AngleGrinder_C, Drill_Drill3) == 0x000278, "Member 'ATool_AngleGrinder_C::Drill_Drill3' has a wrong offset!");
static_assert(offsetof(ATool_AngleGrinder_C, Drill_Drill2) == 0x000280, "Member 'ATool_AngleGrinder_C::Drill_Drill2' has a wrong offset!");
static_assert(offsetof(ATool_AngleGrinder_C, Drill_Drill1) == 0x000288, "Member 'ATool_AngleGrinder_C::Drill_Drill1' has a wrong offset!");
static_assert(offsetof(ATool_AngleGrinder_C, Arrow) == 0x000290, "Member 'ATool_AngleGrinder_C::Arrow' has a wrong offset!");
static_assert(offsetof(ATool_AngleGrinder_C, ParticleSystem) == 0x000298, "Member 'ATool_AngleGrinder_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(ATool_AngleGrinder_C, AlertComponent) == 0x0002A0, "Member 'ATool_AngleGrinder_C::AlertComponent' has a wrong offset!");
static_assert(offsetof(ATool_AngleGrinder_C, HighlightWhenHolding) == 0x0002A8, "Member 'ATool_AngleGrinder_C::HighlightWhenHolding' has a wrong offset!");
static_assert(offsetof(ATool_AngleGrinder_C, SusItemComponent) == 0x0002B0, "Member 'ATool_AngleGrinder_C::SusItemComponent' has a wrong offset!");
static_assert(offsetof(ATool_AngleGrinder_C, ToolComponent) == 0x0002B8, "Member 'ATool_AngleGrinder_C::ToolComponent' has a wrong offset!");

}

