#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TutorialSelect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TutorialSelect.TutorialSelect_C
// 0x0048 (0x02A8 - 0x0260)
class UTutorialSelect_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_74;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_84;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_226;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                MoreButton;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                TutorialButton;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                TutorialButton_1;                                  // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TutorialSelect(int32 EntryPoint);
	void BndEvt__TutorialSelect_TutorialButton_1_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__TutorialSelect_TutorialButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__TutorialSelect_MoreButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__TutorialSelect_Button_74_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void OnSuccess_13324FFB498E22B33A9AE6B5CD4A9354();
	void OnFailure_13324FFB498E22B33A9AE6B5CD4A9354();
	void OnSuccess_7F068F8247FA36D69894268D9DD4EA0B();
	void OnFailure_7F068F8247FA36D69894268D9DD4EA0B();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TutorialSelect_C">();
	}
	static class UTutorialSelect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTutorialSelect_C>();
	}
};
static_assert(alignof(UTutorialSelect_C) == 0x000008, "Wrong alignment on UTutorialSelect_C");
static_assert(sizeof(UTutorialSelect_C) == 0x0002A8, "Wrong size on UTutorialSelect_C");
static_assert(offsetof(UTutorialSelect_C, UberGraphFrame) == 0x000260, "Member 'UTutorialSelect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTutorialSelect_C, Button_74) == 0x000268, "Member 'UTutorialSelect_C::Button_74' has a wrong offset!");
static_assert(offsetof(UTutorialSelect_C, Image) == 0x000270, "Member 'UTutorialSelect_C::Image' has a wrong offset!");
static_assert(offsetof(UTutorialSelect_C, Image_1) == 0x000278, "Member 'UTutorialSelect_C::Image_1' has a wrong offset!");
static_assert(offsetof(UTutorialSelect_C, Image_84) == 0x000280, "Member 'UTutorialSelect_C::Image_84' has a wrong offset!");
static_assert(offsetof(UTutorialSelect_C, Image_226) == 0x000288, "Member 'UTutorialSelect_C::Image_226' has a wrong offset!");
static_assert(offsetof(UTutorialSelect_C, MoreButton) == 0x000290, "Member 'UTutorialSelect_C::MoreButton' has a wrong offset!");
static_assert(offsetof(UTutorialSelect_C, TutorialButton) == 0x000298, "Member 'UTutorialSelect_C::TutorialButton' has a wrong offset!");
static_assert(offsetof(UTutorialSelect_C, TutorialButton_1) == 0x0002A0, "Member 'UTutorialSelect_C::TutorialButton_1' has a wrong offset!");

}

