#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WallBase_Ventilation

#include "Basic.hpp"

#include "WallBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass WallBase_Ventilation.WallBase_Ventilation_C
// 0x0020 (0x02F8 - 0x02D8)
class AWallBase_Ventilation_C final : public AWallBase_C
{
public:
	class UStaticMeshComponent*                   SM_Prop_Light_Wall_01;                             // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Bld_Wall_Brick_01__4_10_StaticMeshComponent3;   // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Bld_Wall_Brick_01__4_10_StaticMeshComponent2;   // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Bld_Wall_Brick_01__4_10_StaticMeshComponent1;   // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WallBase_Ventilation_C">();
	}
	static class AWallBase_Ventilation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWallBase_Ventilation_C>();
	}
};
static_assert(alignof(AWallBase_Ventilation_C) == 0x000008, "Wrong alignment on AWallBase_Ventilation_C");
static_assert(sizeof(AWallBase_Ventilation_C) == 0x0002F8, "Wrong size on AWallBase_Ventilation_C");
static_assert(offsetof(AWallBase_Ventilation_C, SM_Prop_Light_Wall_01) == 0x0002D8, "Member 'AWallBase_Ventilation_C::SM_Prop_Light_Wall_01' has a wrong offset!");
static_assert(offsetof(AWallBase_Ventilation_C, SM_Bld_Wall_Brick_01__4_10_StaticMeshComponent3) == 0x0002E0, "Member 'AWallBase_Ventilation_C::SM_Bld_Wall_Brick_01__4_10_StaticMeshComponent3' has a wrong offset!");
static_assert(offsetof(AWallBase_Ventilation_C, SM_Bld_Wall_Brick_01__4_10_StaticMeshComponent2) == 0x0002E8, "Member 'AWallBase_Ventilation_C::SM_Bld_Wall_Brick_01__4_10_StaticMeshComponent2' has a wrong offset!");
static_assert(offsetof(AWallBase_Ventilation_C, SM_Bld_Wall_Brick_01__4_10_StaticMeshComponent1) == 0x0002F0, "Member 'AWallBase_Ventilation_C::SM_Bld_Wall_Brick_01__4_10_StaticMeshComponent1' has a wrong offset!");

}

