#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WallBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function WallBase.WallBase_C.UserConstructionScript
// 0x0058 (0x0058 - 0x0000)
struct WallBase_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetParentActor_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AClosebuildingBlolckBase_C*             K2Node_DynamicCast_AsClosebuilding_Blolck_Base;    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           CallFunc_GetComponentsByTag_ReturnValue;           // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_Array_RandomFromStream_OutItem;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_RandomFromStream_OutIndex;          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WallBase_C_UserConstructionScript) == 0x000008, "Wrong alignment on WallBase_C_UserConstructionScript");
static_assert(sizeof(WallBase_C_UserConstructionScript) == 0x000058, "Wrong size on WallBase_C_UserConstructionScript");
static_assert(offsetof(WallBase_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WallBase_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WallBase_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WallBase_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WallBase_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WallBase_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WallBase_C_UserConstructionScript, CallFunc_GetParentActor_ReturnValue) == 0x000010, "Member 'WallBase_C_UserConstructionScript::CallFunc_GetParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WallBase_C_UserConstructionScript, K2Node_DynamicCast_AsClosebuilding_Blolck_Base) == 0x000018, "Member 'WallBase_C_UserConstructionScript::K2Node_DynamicCast_AsClosebuilding_Blolck_Base' has a wrong offset!");
static_assert(offsetof(WallBase_C_UserConstructionScript, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WallBase_C_UserConstructionScript::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WallBase_C_UserConstructionScript, CallFunc_GetComponentsByTag_ReturnValue) == 0x000028, "Member 'WallBase_C_UserConstructionScript::CallFunc_GetComponentsByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WallBase_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000038, "Member 'WallBase_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WallBase_C_UserConstructionScript, CallFunc_Array_RandomFromStream_OutItem) == 0x000040, "Member 'WallBase_C_UserConstructionScript::CallFunc_Array_RandomFromStream_OutItem' has a wrong offset!");
static_assert(offsetof(WallBase_C_UserConstructionScript, CallFunc_Array_RandomFromStream_OutIndex) == 0x000048, "Member 'WallBase_C_UserConstructionScript::CallFunc_Array_RandomFromStream_OutIndex' has a wrong offset!");
static_assert(offsetof(WallBase_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x00004C, "Member 'WallBase_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(WallBase_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'WallBase_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WallBase_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'WallBase_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

