#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WinUI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WinUI.WinUI_C
// 0x00B0 (0x0310 - 0x0260)
class UWinUI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       CashEndAnim;                                       // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RevealLevel;                                       // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RevealCashAnim;                                    // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       LevelUpAnimation;                                  // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         CivCasualtyPenaltyBox;                             // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           LevelBox;                                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_106;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                QuitButton;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           RewardsBox;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x02B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_1;                                       // 0x02B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_2;                                       // 0x02C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_200;                                     // 0x02C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_230;                                     // 0x02D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_559;                                     // 0x02D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ARobberController_C*                    Controller;                                        // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class ARobberTruck_C*                         Truck;                                             // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GainedEXP;                                         // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         RecordedLevel;                                     // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CountEXP;                                          // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RecordedEXP;                                       // 0x02FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RecordedRequiredEXP;                               // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CashCount;                                         // 0x0304(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CivCasualtyPenalty;                                // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RecordedTotalTake;                                 // 0x030C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WinUI(int32 EntryPoint);
	void BndEvt__WinUI_QuitButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void StartEXPCount();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void CustomEvent_0();
	void Construct();
	class FText GetText_0();
	class FText GetText_1();
	float GetPercent_0();
	class FText GetText_2();
	class FText GetText_3();
	class FText GetText_4();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WinUI_C">();
	}
	static class UWinUI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWinUI_C>();
	}
};
static_assert(alignof(UWinUI_C) == 0x000008, "Wrong alignment on UWinUI_C");
static_assert(sizeof(UWinUI_C) == 0x000310, "Wrong size on UWinUI_C");
static_assert(offsetof(UWinUI_C, UberGraphFrame) == 0x000260, "Member 'UWinUI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWinUI_C, CashEndAnim) == 0x000268, "Member 'UWinUI_C::CashEndAnim' has a wrong offset!");
static_assert(offsetof(UWinUI_C, RevealLevel) == 0x000270, "Member 'UWinUI_C::RevealLevel' has a wrong offset!");
static_assert(offsetof(UWinUI_C, RevealCashAnim) == 0x000278, "Member 'UWinUI_C::RevealCashAnim' has a wrong offset!");
static_assert(offsetof(UWinUI_C, LevelUpAnimation) == 0x000280, "Member 'UWinUI_C::LevelUpAnimation' has a wrong offset!");
static_assert(offsetof(UWinUI_C, CivCasualtyPenaltyBox) == 0x000288, "Member 'UWinUI_C::CivCasualtyPenaltyBox' has a wrong offset!");
static_assert(offsetof(UWinUI_C, LevelBox) == 0x000290, "Member 'UWinUI_C::LevelBox' has a wrong offset!");
static_assert(offsetof(UWinUI_C, ProgressBar_106) == 0x000298, "Member 'UWinUI_C::ProgressBar_106' has a wrong offset!");
static_assert(offsetof(UWinUI_C, QuitButton) == 0x0002A0, "Member 'UWinUI_C::QuitButton' has a wrong offset!");
static_assert(offsetof(UWinUI_C, RewardsBox) == 0x0002A8, "Member 'UWinUI_C::RewardsBox' has a wrong offset!");
static_assert(offsetof(UWinUI_C, TextBlock) == 0x0002B0, "Member 'UWinUI_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UWinUI_C, TextBlock_1) == 0x0002B8, "Member 'UWinUI_C::TextBlock_1' has a wrong offset!");
static_assert(offsetof(UWinUI_C, TextBlock_2) == 0x0002C0, "Member 'UWinUI_C::TextBlock_2' has a wrong offset!");
static_assert(offsetof(UWinUI_C, TextBlock_200) == 0x0002C8, "Member 'UWinUI_C::TextBlock_200' has a wrong offset!");
static_assert(offsetof(UWinUI_C, TextBlock_230) == 0x0002D0, "Member 'UWinUI_C::TextBlock_230' has a wrong offset!");
static_assert(offsetof(UWinUI_C, TextBlock_559) == 0x0002D8, "Member 'UWinUI_C::TextBlock_559' has a wrong offset!");
static_assert(offsetof(UWinUI_C, Controller) == 0x0002E0, "Member 'UWinUI_C::Controller' has a wrong offset!");
static_assert(offsetof(UWinUI_C, Truck) == 0x0002E8, "Member 'UWinUI_C::Truck' has a wrong offset!");
static_assert(offsetof(UWinUI_C, GainedEXP) == 0x0002F0, "Member 'UWinUI_C::GainedEXP' has a wrong offset!");
static_assert(offsetof(UWinUI_C, RecordedLevel) == 0x0002F4, "Member 'UWinUI_C::RecordedLevel' has a wrong offset!");
static_assert(offsetof(UWinUI_C, CountEXP) == 0x0002F8, "Member 'UWinUI_C::CountEXP' has a wrong offset!");
static_assert(offsetof(UWinUI_C, RecordedEXP) == 0x0002FC, "Member 'UWinUI_C::RecordedEXP' has a wrong offset!");
static_assert(offsetof(UWinUI_C, RecordedRequiredEXP) == 0x000300, "Member 'UWinUI_C::RecordedRequiredEXP' has a wrong offset!");
static_assert(offsetof(UWinUI_C, CashCount) == 0x000304, "Member 'UWinUI_C::CashCount' has a wrong offset!");
static_assert(offsetof(UWinUI_C, CivCasualtyPenalty) == 0x000308, "Member 'UWinUI_C::CivCasualtyPenalty' has a wrong offset!");
static_assert(offsetof(UWinUI_C, RecordedTotalTake) == 0x00030C, "Member 'UWinUI_C::RecordedTotalTake' has a wrong offset!");

}

