#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WorldPositionInventoryEquipSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ShopItemCategory_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WorldPositionInventoryEquipSlot.WorldPositionInventoryEquipSlot_C
// 0x0030 (0x0290 - 0x0260)
class UWorldPositionInventoryEquipSlot_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Postition;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<EShopItemCategory>                     Categories;                                        // 0x0270(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	int32                                         Index_0;                                           // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0284(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WorldPositionInventoryEquipSlot(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WorldPositionInventoryEquipSlot_C">();
	}
	static class UWorldPositionInventoryEquipSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWorldPositionInventoryEquipSlot_C>();
	}
};
static_assert(alignof(UWorldPositionInventoryEquipSlot_C) == 0x000008, "Wrong alignment on UWorldPositionInventoryEquipSlot_C");
static_assert(sizeof(UWorldPositionInventoryEquipSlot_C) == 0x000290, "Wrong size on UWorldPositionInventoryEquipSlot_C");
static_assert(offsetof(UWorldPositionInventoryEquipSlot_C, UberGraphFrame) == 0x000260, "Member 'UWorldPositionInventoryEquipSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWorldPositionInventoryEquipSlot_C, Postition) == 0x000268, "Member 'UWorldPositionInventoryEquipSlot_C::Postition' has a wrong offset!");
static_assert(offsetof(UWorldPositionInventoryEquipSlot_C, Categories) == 0x000270, "Member 'UWorldPositionInventoryEquipSlot_C::Categories' has a wrong offset!");
static_assert(offsetof(UWorldPositionInventoryEquipSlot_C, Index_0) == 0x000280, "Member 'UWorldPositionInventoryEquipSlot_C::Index_0' has a wrong offset!");
static_assert(offsetof(UWorldPositionInventoryEquipSlot_C, Location) == 0x000284, "Member 'UWorldPositionInventoryEquipSlot_C::Location' has a wrong offset!");

}

