#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SteamCoreWeb

#include "Basic.hpp"

#include "SteamCoreWeb_structs.hpp"


namespace SDK::Params
{

// Function SteamCoreWeb.SteamCoreWebAsyncAction.HandleCallback
// 0x0018 (0x0018 - 0x0000)
struct SteamCoreWebAsyncAction_HandleCallback final
{
public:
	class FString                                 Data;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWasSuccessful;                                    // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SteamCoreWebAsyncAction_HandleCallback) == 0x000008, "Wrong alignment on SteamCoreWebAsyncAction_HandleCallback");
static_assert(sizeof(SteamCoreWebAsyncAction_HandleCallback) == 0x000018, "Wrong size on SteamCoreWebAsyncAction_HandleCallback");
static_assert(offsetof(SteamCoreWebAsyncAction_HandleCallback, Data) == 0x000000, "Member 'SteamCoreWebAsyncAction_HandleCallback::Data' has a wrong offset!");
static_assert(offsetof(SteamCoreWebAsyncAction_HandleCallback, bWasSuccessful) == 0x000010, "Member 'SteamCoreWebAsyncAction_HandleCallback::bWasSuccessful' has a wrong offset!");

// Function SteamCoreWeb.SteamWebUtilities.FindJsonBool
// 0x0028 (0x0028 - 0x0000)
struct SteamWebUtilities_FindJsonBool final
{
public:
	class FString                                 JsonString;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bValue;                                            // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESteamJsonResult                              Result;                                            // 0x0021(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SteamWebUtilities_FindJsonBool) == 0x000008, "Wrong alignment on SteamWebUtilities_FindJsonBool");
static_assert(sizeof(SteamWebUtilities_FindJsonBool) == 0x000028, "Wrong size on SteamWebUtilities_FindJsonBool");
static_assert(offsetof(SteamWebUtilities_FindJsonBool, JsonString) == 0x000000, "Member 'SteamWebUtilities_FindJsonBool::JsonString' has a wrong offset!");
static_assert(offsetof(SteamWebUtilities_FindJsonBool, Key) == 0x000010, "Member 'SteamWebUtilities_FindJsonBool::Key' has a wrong offset!");
static_assert(offsetof(SteamWebUtilities_FindJsonBool, bValue) == 0x000020, "Member 'SteamWebUtilities_FindJsonBool::bValue' has a wrong offset!");
static_assert(offsetof(SteamWebUtilities_FindJsonBool, Result) == 0x000021, "Member 'SteamWebUtilities_FindJsonBool::Result' has a wrong offset!");

// Function SteamCoreWeb.SteamWebUtilities.FindJsonBools
// 0x0038 (0x0038 - 0x0000)
struct SteamWebUtilities_FindJsonBools final
{
public:
	class FString                                 JsonString;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<bool>                                  bValues;                                           // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	ESteamJsonResult                              Result;                                            // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SteamWebUtilities_FindJsonBools) == 0x000008, "Wrong alignment on SteamWebUtilities_FindJsonBools");
static_assert(sizeof(SteamWebUtilities_FindJsonBools) == 0x000038, "Wrong size on SteamWebUtilities_FindJsonBools");
static_assert(offsetof(SteamWebUtilities_FindJsonBools, JsonString) == 0x000000, "Member 'SteamWebUtilities_FindJsonBools::JsonString' has a wrong offset!");
static_assert(offsetof(SteamWebUtilities_FindJsonBools, Key) == 0x000010, "Member 'SteamWebUtilities_FindJsonBools::Key' has a wrong offset!");
static_assert(offsetof(SteamWebUtilities_FindJsonBools, bValues) == 0x000020, "Member 'SteamWebUtilities_FindJsonBools::bValues' has a wrong offset!");
static_assert(offsetof(SteamWebUtilities_FindJsonBools, Result) == 0x000030, "Member 'SteamWebUtilities_FindJsonBools::Result' has a wrong offset!");

// Function SteamCoreWeb.SteamWebUtilities.FindJsonNumber
// 0x0028 (0x0028 - 0x0000)
struct SteamWebUtilities_FindJsonNumber final
{
public:
	class FString                                 JsonString;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESteamJsonResult                              Result;                                            // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SteamWebUtilities_FindJsonNumber) == 0x000008, "Wrong alignment on SteamWebUtilities_FindJsonNumber");
static_assert(sizeof(SteamWebUtilities_FindJsonNumber) == 0x000028, "Wrong size on SteamWebUtilities_FindJsonNumber");
static_assert(offsetof(SteamWebUtilities_FindJsonNumber, JsonString) == 0x000000, "Member 'SteamWebUtilities_FindJsonNumber::JsonString' has a wrong offset!");
static_assert(offsetof(SteamWebUtilities_FindJsonNumber, Key) == 0x000010, "Member 'SteamWebUtilities_FindJsonNumber::Key' has a wrong offset!");
static_assert(offsetof(SteamWebUtilities_FindJsonNumber, Value) == 0x000020, "Member 'SteamWebUtilities_FindJsonNumber::Value' has a wrong offset!");
static_assert(offsetof(SteamWebUtilities_FindJsonNumber, Result) == 0x000024, "Member 'SteamWebUtilities_FindJsonNumber::Result' has a wrong offset!");

// Function SteamCoreWeb.SteamWebUtilities.FindJsonNumbers
// 0x0038 (0x0038 - 0x0000)
struct SteamWebUtilities_FindJsonNumbers final
{
public:
	class FString                                 JsonString;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 Values;                                            // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	ESteamJsonResult                              Result;                                            // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SteamWebUtilities_FindJsonNumbers) == 0x000008, "Wrong alignment on SteamWebUtilities_FindJsonNumbers");
static_assert(sizeof(SteamWebUtilities_FindJsonNumbers) == 0x000038, "Wrong size on SteamWebUtilities_FindJsonNumbers");
static_assert(offsetof(SteamWebUtilities_FindJsonNumbers, JsonString) == 0x000000, "Member 'SteamWebUtilities_FindJsonNumbers::JsonString' has a wrong offset!");
static_assert(offsetof(SteamWebUtilities_FindJsonNumbers, Key) == 0x000010, "Member 'SteamWebUtilities_FindJsonNumbers::Key' has a wrong offset!");
static_assert(offsetof(SteamWebUtilities_FindJsonNumbers, Values) == 0x000020, "Member 'SteamWebUtilities_FindJsonNumbers::Values' has a wrong offset!");
static_assert(offsetof(SteamWebUtilities_FindJsonNumbers, Result) == 0x000030, "Member 'SteamWebUtilities_FindJsonNumbers::Result' has a wrong offset!");

// Function SteamCoreWeb.SteamWebUtilities.FindJsonString
// 0x0038 (0x0038 - 0x0000)
struct SteamWebUtilities_FindJsonString final
{
public:
	class FString                                 JsonString;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESteamJsonResult                              Result;                                            // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SteamWebUtilities_FindJsonString) == 0x000008, "Wrong alignment on SteamWebUtilities_FindJsonString");
static_assert(sizeof(SteamWebUtilities_FindJsonString) == 0x000038, "Wrong size on SteamWebUtilities_FindJsonString");
static_assert(offsetof(SteamWebUtilities_FindJsonString, JsonString) == 0x000000, "Member 'SteamWebUtilities_FindJsonString::JsonString' has a wrong offset!");
static_assert(offsetof(SteamWebUtilities_FindJsonString, Key) == 0x000010, "Member 'SteamWebUtilities_FindJsonString::Key' has a wrong offset!");
static_assert(offsetof(SteamWebUtilities_FindJsonString, Value) == 0x000020, "Member 'SteamWebUtilities_FindJsonString::Value' has a wrong offset!");
static_assert(offsetof(SteamWebUtilities_FindJsonString, Result) == 0x000030, "Member 'SteamWebUtilities_FindJsonString::Result' has a wrong offset!");

// Function SteamCoreWeb.SteamWebUtilities.FindJsonStrings
// 0x0038 (0x0038 - 0x0000)
struct SteamWebUtilities_FindJsonStrings final
{
public:
	class FString                                 JsonString;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         Values;                                            // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	ESteamJsonResult                              Result;                                            // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SteamWebUtilities_FindJsonStrings) == 0x000008, "Wrong alignment on SteamWebUtilities_FindJsonStrings");
static_assert(sizeof(SteamWebUtilities_FindJsonStrings) == 0x000038, "Wrong size on SteamWebUtilities_FindJsonStrings");
static_assert(offsetof(SteamWebUtilities_FindJsonStrings, JsonString) == 0x000000, "Member 'SteamWebUtilities_FindJsonStrings::JsonString' has a wrong offset!");
static_assert(offsetof(SteamWebUtilities_FindJsonStrings, Key) == 0x000010, "Member 'SteamWebUtilities_FindJsonStrings::Key' has a wrong offset!");
static_assert(offsetof(SteamWebUtilities_FindJsonStrings, Values) == 0x000020, "Member 'SteamWebUtilities_FindJsonStrings::Values' has a wrong offset!");
static_assert(offsetof(SteamWebUtilities_FindJsonStrings, Result) == 0x000030, "Member 'SteamWebUtilities_FindJsonStrings::Result' has a wrong offset!");

// Function SteamCoreWeb.SteamWebUtilities.GetDevSteamID
// 0x0010 (0x0010 - 0x0000)
struct SteamWebUtilities_GetDevSteamID final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SteamWebUtilities_GetDevSteamID) == 0x000008, "Wrong alignment on SteamWebUtilities_GetDevSteamID");
static_assert(sizeof(SteamWebUtilities_GetDevSteamID) == 0x000010, "Wrong size on SteamWebUtilities_GetDevSteamID");
static_assert(offsetof(SteamWebUtilities_GetDevSteamID, ReturnValue) == 0x000000, "Member 'SteamWebUtilities_GetDevSteamID::ReturnValue' has a wrong offset!");

// Function SteamCoreWeb.SteamWebUtilities.GetProjectAppID
// 0x0004 (0x0004 - 0x0000)
struct SteamWebUtilities_GetProjectAppID final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SteamWebUtilities_GetProjectAppID) == 0x000004, "Wrong alignment on SteamWebUtilities_GetProjectAppID");
static_assert(sizeof(SteamWebUtilities_GetProjectAppID) == 0x000004, "Wrong size on SteamWebUtilities_GetProjectAppID");
static_assert(offsetof(SteamWebUtilities_GetProjectAppID, ReturnValue) == 0x000000, "Member 'SteamWebUtilities_GetProjectAppID::ReturnValue' has a wrong offset!");

// Function SteamCoreWeb.SteamWebUtilities.GetProjectKey
// 0x0010 (0x0010 - 0x0000)
struct SteamWebUtilities_GetProjectKey final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SteamWebUtilities_GetProjectKey) == 0x000008, "Wrong alignment on SteamWebUtilities_GetProjectKey");
static_assert(sizeof(SteamWebUtilities_GetProjectKey) == 0x000010, "Wrong size on SteamWebUtilities_GetProjectKey");
static_assert(offsetof(SteamWebUtilities_GetProjectKey, ReturnValue) == 0x000000, "Member 'SteamWebUtilities_GetProjectKey::ReturnValue' has a wrong offset!");

// Function SteamCoreWeb.SteamWebUtilities.ParseJson
// 0x0028 (0x0028 - 0x0000)
struct SteamWebUtilities_ParseJson final
{
public:
	class FString                                 JsonString;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSteamCoreJson>                 Data;                                              // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SteamWebUtilities_ParseJson) == 0x000008, "Wrong alignment on SteamWebUtilities_ParseJson");
static_assert(sizeof(SteamWebUtilities_ParseJson) == 0x000028, "Wrong size on SteamWebUtilities_ParseJson");
static_assert(offsetof(SteamWebUtilities_ParseJson, JsonString) == 0x000000, "Member 'SteamWebUtilities_ParseJson::JsonString' has a wrong offset!");
static_assert(offsetof(SteamWebUtilities_ParseJson, Data) == 0x000010, "Member 'SteamWebUtilities_ParseJson::Data' has a wrong offset!");
static_assert(offsetof(SteamWebUtilities_ParseJson, ReturnValue) == 0x000020, "Member 'SteamWebUtilities_ParseJson::ReturnValue' has a wrong offset!");

// Function SteamCoreWeb.WebApps.GetAppBetas
// 0x0028 (0x0028 - 0x0000)
struct WebApps_GetAppBetas final
{
public:
	TDelegate<void(const class FString& Data, bool bWasSuccessful)> Callback;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AppID;                                             // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WebApps_GetAppBetas) == 0x000008, "Wrong alignment on WebApps_GetAppBetas");
static_assert(sizeof(WebApps_GetAppBetas) == 0x000028, "Wrong size on WebApps_GetAppBetas");
static_assert(offsetof(WebApps_GetAppBetas, Callback) == 0x000000, "Member 'WebApps_GetAppBetas::Callback' has a wrong offset!");
static_assert(offsetof(WebApps_GetAppBetas, Key) == 0x000010, "Member 'WebApps_GetAppBetas::Key' has a wrong offset!");
static_assert(offsetof(WebApps_GetAppBetas, AppID) == 0x000020, "Member 'WebApps_GetAppBetas::AppID' has a wrong offset!");

// Function SteamCoreWeb.WebApps.GetAppBuilds
// 0x0028 (0x0028 - 0x0000)
struct WebApps_GetAppBuilds final
{
public:
	TDelegate<void(const class FString& Data, bool bWasSuccessful)> Callback;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AppID;                                             // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApps_GetAppBuilds) == 0x000008, "Wrong alignment on WebApps_GetAppBuilds");
static_assert(sizeof(WebApps_GetAppBuilds) == 0x000028, "Wrong size on WebApps_GetAppBuilds");
static_assert(offsetof(WebApps_GetAppBuilds, Callback) == 0x000000, "Member 'WebApps_GetAppBuilds::Callback' has a wrong offset!");
static_assert(offsetof(WebApps_GetAppBuilds, Key) == 0x000010, "Member 'WebApps_GetAppBuilds::Key' has a wrong offset!");
static_assert(offsetof(WebApps_GetAppBuilds, AppID) == 0x000020, "Member 'WebApps_GetAppBuilds::AppID' has a wrong offset!");
static_assert(offsetof(WebApps_GetAppBuilds, Count) == 0x000024, "Member 'WebApps_GetAppBuilds::Count' has a wrong offset!");

// Function SteamCoreWeb.WebApps.GetAppDepotVersions
// 0x0028 (0x0028 - 0x0000)
struct WebApps_GetAppDepotVersions final
{
public:
	TDelegate<void(const class FString& Data, bool bWasSuccessful)> Callback;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AppID;                                             // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WebApps_GetAppDepotVersions) == 0x000008, "Wrong alignment on WebApps_GetAppDepotVersions");
static_assert(sizeof(WebApps_GetAppDepotVersions) == 0x000028, "Wrong size on WebApps_GetAppDepotVersions");
static_assert(offsetof(WebApps_GetAppDepotVersions, Callback) == 0x000000, "Member 'WebApps_GetAppDepotVersions::Callback' has a wrong offset!");
static_assert(offsetof(WebApps_GetAppDepotVersions, Key) == 0x000010, "Member 'WebApps_GetAppDepotVersions::Key' has a wrong offset!");
static_assert(offsetof(WebApps_GetAppDepotVersions, AppID) == 0x000020, "Member 'WebApps_GetAppDepotVersions::AppID' has a wrong offset!");

// Function SteamCoreWeb.WebApps.GetAppList
// 0x0020 (0x0020 - 0x0000)
struct WebApps_GetAppList final
{
public:
	TDelegate<void(TArray<struct FWebAppsGetAppList>& Data, bool bWasSuccessful)> Callback;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApps_GetAppList) == 0x000008, "Wrong alignment on WebApps_GetAppList");
static_assert(sizeof(WebApps_GetAppList) == 0x000020, "Wrong size on WebApps_GetAppList");
static_assert(offsetof(WebApps_GetAppList, Callback) == 0x000000, "Member 'WebApps_GetAppList::Callback' has a wrong offset!");
static_assert(offsetof(WebApps_GetAppList, Key) == 0x000010, "Member 'WebApps_GetAppList::Key' has a wrong offset!");

// Function SteamCoreWeb.WebApps.GetCheatingReports
// 0x0038 (0x0038 - 0x0000)
struct WebApps_GetCheatingReports final
{
public:
	TDelegate<void(const class FString& Data, bool bWasSuccessful)> Callback;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AppID;                                             // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TimeBegin;                                         // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TimeEnd;                                           // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeReports;                                   // 0x002C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeBans;                                      // 0x002D(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReportidMin;                                       // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WebApps_GetCheatingReports) == 0x000008, "Wrong alignment on WebApps_GetCheatingReports");
static_assert(sizeof(WebApps_GetCheatingReports) == 0x000038, "Wrong size on WebApps_GetCheatingReports");
static_assert(offsetof(WebApps_GetCheatingReports, Callback) == 0x000000, "Member 'WebApps_GetCheatingReports::Callback' has a wrong offset!");
static_assert(offsetof(WebApps_GetCheatingReports, Key) == 0x000010, "Member 'WebApps_GetCheatingReports::Key' has a wrong offset!");
static_assert(offsetof(WebApps_GetCheatingReports, AppID) == 0x000020, "Member 'WebApps_GetCheatingReports::AppID' has a wrong offset!");
static_assert(offsetof(WebApps_GetCheatingReports, TimeBegin) == 0x000024, "Member 'WebApps_GetCheatingReports::TimeBegin' has a wrong offset!");
static_assert(offsetof(WebApps_GetCheatingReports, TimeEnd) == 0x000028, "Member 'WebApps_GetCheatingReports::TimeEnd' has a wrong offset!");
static_assert(offsetof(WebApps_GetCheatingReports, bIncludeReports) == 0x00002C, "Member 'WebApps_GetCheatingReports::bIncludeReports' has a wrong offset!");
static_assert(offsetof(WebApps_GetCheatingReports, bIncludeBans) == 0x00002D, "Member 'WebApps_GetCheatingReports::bIncludeBans' has a wrong offset!");
static_assert(offsetof(WebApps_GetCheatingReports, ReportidMin) == 0x000030, "Member 'WebApps_GetCheatingReports::ReportidMin' has a wrong offset!");

// Function SteamCoreWeb.WebApps.GetPlayersBanned
// 0x0028 (0x0028 - 0x0000)
struct WebApps_GetPlayersBanned final
{
public:
	TDelegate<void(const class FString& Data, bool bWasSuccessful)> Callback;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AppID;                                             // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WebApps_GetPlayersBanned) == 0x000008, "Wrong alignment on WebApps_GetPlayersBanned");
static_assert(sizeof(WebApps_GetPlayersBanned) == 0x000028, "Wrong size on WebApps_GetPlayersBanned");
static_assert(offsetof(WebApps_GetPlayersBanned, Callback) == 0x000000, "Member 'WebApps_GetPlayersBanned::Callback' has a wrong offset!");
static_assert(offsetof(WebApps_GetPlayersBanned, Key) == 0x000010, "Member 'WebApps_GetPlayersBanned::Key' has a wrong offset!");
static_assert(offsetof(WebApps_GetPlayersBanned, AppID) == 0x000020, "Member 'WebApps_GetPlayersBanned::AppID' has a wrong offset!");

// Function SteamCoreWeb.WebApps.GetServerList
// 0x0038 (0x0038 - 0x0000)
struct WebApps_GetServerList final
{
public:
	TDelegate<void(const class FString& Data, bool bWasSuccessful)> Callback;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Filter;                                            // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Limit;                                             // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WebApps_GetServerList) == 0x000008, "Wrong alignment on WebApps_GetServerList");
static_assert(sizeof(WebApps_GetServerList) == 0x000038, "Wrong size on WebApps_GetServerList");
static_assert(offsetof(WebApps_GetServerList, Callback) == 0x000000, "Member 'WebApps_GetServerList::Callback' has a wrong offset!");
static_assert(offsetof(WebApps_GetServerList, Key) == 0x000010, "Member 'WebApps_GetServerList::Key' has a wrong offset!");
static_assert(offsetof(WebApps_GetServerList, Filter) == 0x000020, "Member 'WebApps_GetServerList::Filter' has a wrong offset!");
static_assert(offsetof(WebApps_GetServerList, Limit) == 0x000030, "Member 'WebApps_GetServerList::Limit' has a wrong offset!");

// Function SteamCoreWeb.WebApps.GetServersAtAddress
// 0x0020 (0x0020 - 0x0000)
struct WebApps_GetServersAtAddress final
{
public:
	TDelegate<void(const class FString& Data, bool bWasSuccessful)> Callback;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 Addr;                                              // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApps_GetServersAtAddress) == 0x000008, "Wrong alignment on WebApps_GetServersAtAddress");
static_assert(sizeof(WebApps_GetServersAtAddress) == 0x000020, "Wrong size on WebApps_GetServersAtAddress");
static_assert(offsetof(WebApps_GetServersAtAddress, Callback) == 0x000000, "Member 'WebApps_GetServersAtAddress::Callback' has a wrong offset!");
static_assert(offsetof(WebApps_GetServersAtAddress, Addr) == 0x000010, "Member 'WebApps_GetServersAtAddress::Addr' has a wrong offset!");

// Function SteamCoreWeb.WebApps.SetAppBuildLive
// 0x0048 (0x0048 - 0x0000)
struct WebApps_SetAppBuildLive final
{
public:
	TDelegate<void(const class FString& Data, bool bWasSuccessful)> Callback;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AppID;                                             // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BuildID;                                           // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BetaKey;                                           // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Description;                                       // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApps_SetAppBuildLive) == 0x000008, "Wrong alignment on WebApps_SetAppBuildLive");
static_assert(sizeof(WebApps_SetAppBuildLive) == 0x000048, "Wrong size on WebApps_SetAppBuildLive");
static_assert(offsetof(WebApps_SetAppBuildLive, Callback) == 0x000000, "Member 'WebApps_SetAppBuildLive::Callback' has a wrong offset!");
static_assert(offsetof(WebApps_SetAppBuildLive, Key) == 0x000010, "Member 'WebApps_SetAppBuildLive::Key' has a wrong offset!");
static_assert(offsetof(WebApps_SetAppBuildLive, AppID) == 0x000020, "Member 'WebApps_SetAppBuildLive::AppID' has a wrong offset!");
static_assert(offsetof(WebApps_SetAppBuildLive, BuildID) == 0x000024, "Member 'WebApps_SetAppBuildLive::BuildID' has a wrong offset!");
static_assert(offsetof(WebApps_SetAppBuildLive, BetaKey) == 0x000028, "Member 'WebApps_SetAppBuildLive::BetaKey' has a wrong offset!");
static_assert(offsetof(WebApps_SetAppBuildLive, Description) == 0x000038, "Member 'WebApps_SetAppBuildLive::Description' has a wrong offset!");

// Function SteamCoreWeb.WebApps.UpToDateCheck
// 0x0018 (0x0018 - 0x0000)
struct WebApps_UpToDateCheck final
{
public:
	TDelegate<void(const class FString& Data, bool bWasSuccessful)> Callback;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         AppID;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Version;                                           // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WebApps_UpToDateCheck) == 0x000004, "Wrong alignment on WebApps_UpToDateCheck");
static_assert(sizeof(WebApps_UpToDateCheck) == 0x000018, "Wrong size on WebApps_UpToDateCheck");
static_assert(offsetof(WebApps_UpToDateCheck, Callback) == 0x000000, "Member 'WebApps_UpToDateCheck::Callback' has a wrong offset!");
static_assert(offsetof(WebApps_UpToDateCheck, AppID) == 0x000010, "Member 'WebApps_UpToDateCheck::AppID' has a wrong offset!");
static_assert(offsetof(WebApps_UpToDateCheck, Version) == 0x000014, "Member 'WebApps_UpToDateCheck::Version' has a wrong offset!");

// Function SteamCoreWeb.SteamCoreAppsAsyncActionGetAppBetas.GetAppBetasAsync
// 0x0028 (0x0028 - 0x0000)
struct SteamCoreAppsAsyncActionGetAppBetas_GetAppBetasAsync final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AppID;                                             // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USteamCoreAppsAsyncActionGetAppBetas*   ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SteamCoreAppsAsyncActionGetAppBetas_GetAppBetasAsync) == 0x000008, "Wrong alignment on SteamCoreAppsAsyncActionGetAppBetas_GetAppBetasAsync");
static_assert(sizeof(SteamCoreAppsAsyncActionGetAppBetas_GetAppBetasAsync) == 0x000028, "Wrong size on SteamCoreAppsAsyncActionGetAppBetas_GetAppBetasAsync");
static_assert(offsetof(SteamCoreAppsAsyncActionGetAppBetas_GetAppBetasAsync, WorldContextObject) == 0x000000, "Member 'SteamCoreAppsAsyncActionGetAppBetas_GetAppBetasAsync::WorldContextObject' has a wrong offset!");
static_assert(offsetof(SteamCoreAppsAsyncActionGetAppBetas_GetAppBetasAsync, Key) == 0x000008, "Member 'SteamCoreAppsAsyncActionGetAppBetas_GetAppBetasAsync::Key' has a wrong offset!");
static_assert(offsetof(SteamCoreAppsAsyncActionGetAppBetas_GetAppBetasAsync, AppID) == 0x000018, "Member 'SteamCoreAppsAsyncActionGetAppBetas_GetAppBetasAsync::AppID' has a wrong offset!");
static_assert(offsetof(SteamCoreAppsAsyncActionGetAppBetas_GetAppBetasAsync, ReturnValue) == 0x000020, "Member 'SteamCoreAppsAsyncActionGetAppBetas_GetAppBetasAsync::ReturnValue' has a wrong offset!");

// Function SteamCoreWeb.SteamCoreAppsAsyncActionGetAppBuilds.GetAppBuildsAsync
// 0x0028 (0x0028 - 0x0000)
struct SteamCoreAppsAsyncActionGetAppBuilds_GetAppBuildsAsync final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AppID;                                             // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USteamCoreAppsAsyncActionGetAppBuilds*  ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SteamCoreAppsAsyncActionGetAppBuilds_GetAppBuildsAsync) == 0x000008, "Wrong alignment on SteamCoreAppsAsyncActionGetAppBuilds_GetAppBuildsAsync");
static_assert(sizeof(SteamCoreAppsAsyncActionGetAppBuilds_GetAppBuildsAsync) == 0x000028, "Wrong size on SteamCoreAppsAsyncActionGetAppBuilds_GetAppBuildsAsync");
static_assert(offsetof(SteamCoreAppsAsyncActionGetAppBuilds_GetAppBuildsAsync, WorldContextObject) == 0x000000, "Member 'SteamCoreAppsAsyncActionGetAppBuilds_GetAppBuildsAsync::WorldContextObject' has a wrong offset!");
static_assert(offsetof(SteamCoreAppsAsyncActionGetAppBuilds_GetAppBuildsAsync, Key) == 0x000008, "Member 'SteamCoreAppsAsyncActionGetAppBuilds_GetAppBuildsAsync::Key' has a wrong offset!");
static_assert(offsetof(SteamCoreAppsAsyncActionGetAppBuilds_GetAppBuildsAsync, AppID) == 0x000018, "Member 'SteamCoreAppsAsyncActionGetAppBuilds_GetAppBuildsAsync::AppID' has a wrong offset!");
static_assert(offsetof(SteamCoreAppsAsyncActionGetAppBuilds_GetAppBuildsAsync, Count) == 0x00001C, "Member 'SteamCoreAppsAsyncActionGetAppBuilds_GetAppBuildsAsync::Count' has a wrong offset!");
static_assert(offsetof(SteamCoreAppsAsyncActionGetAppBuilds_GetAppBuildsAsync, ReturnValue) == 0x000020, "Member 'SteamCoreAppsAsyncActionGetAppBuilds_GetAppBuildsAsync::ReturnValue' has a wrong offset!");

// Function SteamCoreWeb.SteamCoreAppsAsyncActionGetAppDepotVersions.GetAppDepotVersionsAsync
// 0x0028 (0x0028 - 0x0000)
struct SteamCoreAppsAsyncActionGetAppDepotVersions_GetAppDepotVersionsAsync final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AppID;                                             // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USteamCoreAppsAsyncActionGetAppDepotVersions* ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SteamCoreAppsAsyncActionGetAppDepotVersions_GetAppDepotVersionsAsync) == 0x000008, "Wrong alignment on SteamCoreAppsAsyncActionGetAppDepotVersions_GetAppDepotVersionsAsync");
static_assert(sizeof(SteamCoreAppsAsyncActionGetAppDepotVersions_GetAppDepotVersionsAsync) == 0x000028, "Wrong size on SteamCoreAppsAsyncActionGetAppDepotVersions_GetAppDepotVersionsAsync");
static_assert(offsetof(SteamCoreAppsAsyncActionGetAppDepotVersions_GetAppDepotVersionsAsync, WorldContextObject) == 0x000000, "Member 'SteamCoreAppsAsyncActionGetAppDepotVersions_GetAppDepotVersionsAsync::WorldContextObject' has a wrong offset!");
static_assert(offsetof(SteamCoreAppsAsyncActionGetAppDepotVersions_GetAppDepotVersionsAsync, Key) == 0x000008, "Member 'SteamCoreAppsAsyncActionGetAppDepotVersions_GetAppDepotVersionsAsync::Key' has a wrong offset!");
static_assert(offsetof(SteamCoreAppsAsyncActionGetAppDepotVersions_GetAppDepotVersionsAsync, AppID) == 0x000018, "Member 'SteamCoreAppsAsyncActionGetAppDepotVersions_GetAppDepotVersionsAsync::AppID' has a wrong offset!");
static_assert(offsetof(SteamCoreAppsAsyncActionGetAppDepotVersions_GetAppDepotVersionsAsync, ReturnValue) == 0x000020, "Member 'SteamCoreAppsAsyncActionGetAppDepotVersions_GetAppDepotVersionsAsync::ReturnValue' has a wrong offset!");

// Function SteamCoreWeb.SteamCoreAppsAsyncActionGetAppList.GetAppListAsync
// 0x0010 (0x0010 - 0x0000)
struct SteamCoreAppsAsyncActionGetAppList_GetAppListAsync final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USteamCoreAppsAsyncActionGetAppList*    ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SteamCoreAppsAsyncActionGetAppList_GetAppListAsync) == 0x000008, "Wrong alignment on SteamCoreAppsAsyncActionGetAppList_GetAppListAsync");
static_assert(sizeof(SteamCoreAppsAsyncActionGetAppList_GetAppListAsync) == 0x000010, "Wrong size on SteamCoreAppsAsyncActionGetAppList_GetAppListAsync");
static_assert(offsetof(SteamCoreAppsAsyncActionGetAppList_GetAppListAsync, WorldContextObject) == 0x000000, "Member 'SteamCoreAppsAsyncActionGetAppList_GetAppListAsync::WorldContextObject' has a wrong offset!");
static_assert(offsetof(SteamCoreAppsAsyncActionGetAppList_GetAppListAsync, ReturnValue) == 0x000008, "Member 'SteamCoreAppsAsyncActionGetAppList_GetAppListAsync::ReturnValue' has a wrong offset!");

// Function SteamCoreWeb.SteamCoreAppsAsyncActionGetAppList.HandleCallback
// 0x0018 (0x0018 - 0x0000)
struct SteamCoreAppsAsyncActionGetAppList_HandleCallback final
{
public:
	TArray<struct FWebAppsGetAppList>             Data;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bWasSuccessful;                                    // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SteamCoreAppsAsyncActionGetAppList_HandleCallback) == 0x000008, "Wrong alignment on SteamCoreAppsAsyncActionGetAppList_HandleCallback");
static_assert(sizeof(SteamCoreAppsAsyncActionGetAppList_HandleCallback) == 0x000018, "Wrong size on SteamCoreAppsAsyncActionGetAppList_HandleCallback");
static_assert(offsetof(SteamCoreAppsAsyncActionGetAppList_HandleCallback, Data) == 0x000000, "Member 'SteamCoreAppsAsyncActionGetAppList_HandleCallback::Data' has a wrong offset!");
static_assert(offsetof(SteamCoreAppsAsyncActionGetAppList_HandleCallback, bWasSuccessful) == 0x000010, "Member 'SteamCoreAppsAsyncActionGetAppList_HandleCallback::bWasSuccessful' has a wrong offset!");

// Function SteamCoreWeb.SteamCoreAppsAsyncActionGetCheatingReports.GetCheatingReportsAsync
// 0x0038 (0x0038 - 0x0000)
struct SteamCoreAppsAsyncActionGetCheatingReports_GetCheatingReportsAsync final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AppID;                                             // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TimeBegin;                                         // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TimeEnd;                                           // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeReports;                                   // 0x0024(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeBans;                                      // 0x0025(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReportidMin;                                       // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USteamCoreAppsAsyncActionGetCheatingReports* ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SteamCoreAppsAsyncActionGetCheatingReports_GetCheatingReportsAsync) == 0x000008, "Wrong alignment on SteamCoreAppsAsyncActionGetCheatingReports_GetCheatingReportsAsync");
static_assert(sizeof(SteamCoreAppsAsyncActionGetCheatingReports_GetCheatingReportsAsync) == 0x000038, "Wrong size on SteamCoreAppsAsyncActionGetCheatingReports_GetCheatingReportsAsync");
static_assert(offsetof(SteamCoreAppsAsyncActionGetCheatingReports_GetCheatingReportsAsync, WorldContextObject) == 0x000000, "Member 'SteamCoreAppsAsyncActionGetCheatingReports_GetCheatingReportsAsync::WorldContextObject' has a wrong offset!");
static_assert(offsetof(SteamCoreAppsAsyncActionGetCheatingReports_GetCheatingReportsAsync, Key) == 0x000008, "Member 'SteamCoreAppsAsyncActionGetCheatingReports_GetCheatingReportsAsync::Key' has a wrong offset!");
static_assert(offsetof(SteamCoreAppsAsyncActionGetCheatingReports_GetCheatingReportsAsync, AppID) == 0x000018, "Member 'SteamCoreAppsAsyncActionGetCheatingReports_GetCheatingReportsAsync::AppID' has a wrong offset!");
static_assert(offsetof(SteamCoreAppsAsyncActionGetCheatingReports_GetCheatingReportsAsync, TimeBegin) == 0x00001C, "Member 'SteamCoreAppsAsyncActionGetCheatingReports_GetCheatingReportsAsync::TimeBegin' has a wrong offset!");
static_assert(offsetof(SteamCoreAppsAsyncActionGetCheatingReports_GetCheatingReportsAsync, TimeEnd) == 0x000020, "Member 'SteamCoreAppsAsyncActionGetCheatingReports_GetCheatingReportsAsync::TimeEnd' has a wrong offset!");
static_assert(offsetof(SteamCoreAppsAsyncActionGetCheatingReports_GetCheatingReportsAsync, bIncludeReports) == 0x000024, "Member 'SteamCoreAppsAsyncActionGetCheatingReports_GetCheatingReportsAsync::bIncludeReports' has a wrong offset!");
static_assert(offsetof(SteamCoreAppsAsyncActionGetCheatingReports_GetCheatingReportsAsync, bIncludeBans) == 0x000025, "Member 'SteamCoreAppsAsyncActionGetCheatingReports_GetCheatingReportsAsync::bIncludeBans' has a wrong offset!");
static_assert(offsetof(SteamCoreAppsAsyncActionGetCheatingReports_GetCheatingReportsAsync, ReportidMin) == 0x000028, "Member 'SteamCoreAppsAsyncActionGetCheatingReports_GetCheatingReportsAsync::ReportidMin' has a wrong offset!");
static_assert(offsetof(SteamCoreAppsAsyncActionGetCheatingReports_GetCheatingReportsAsync, ReturnValue) == 0x000030, "Member 'SteamCoreAppsAsyncActionGetCheatingReports_GetCheatingReportsAsync::ReturnValue' has a wrong offset!");

// Function SteamCoreWeb.SteamCoreAppsAsyncActionGetPlayersBanned.GetPlayersBannedAsync
// 0x0028 (0x0028 - 0x0000)
struct SteamCoreAppsAsyncActionGetPlayersBanned_GetPlayersBannedAsync final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AppID;                                             // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USteamCoreAppsAsyncActionGetPlayersBanned* ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SteamCoreAppsAsyncActionGetPlayersBanned_GetPlayersBannedAsync) == 0x000008, "Wrong alignment on SteamCoreAppsAsyncActionGetPlayersBanned_GetPlayersBannedAsync");
static_assert(sizeof(SteamCoreAppsAsyncActionGetPlayersBanned_GetPlayersBannedAsync) == 0x000028, "Wrong size on SteamCoreAppsAsyncActionGetPlayersBanned_GetPlayersBannedAsync");
static_assert(offsetof(SteamCoreAppsAsyncActionGetPlayersBanned_GetPlayersBannedAsync, WorldContextObject) == 0x000000, "Member 'SteamCoreAppsAsyncActionGetPlayersBanned_GetPlayersBannedAsync::WorldContextObject' has a wrong offset!");
static_assert(offsetof(SteamCoreAppsAsyncActionGetPlayersBanned_GetPlayersBannedAsync, Key) == 0x000008, "Member 'SteamCoreAppsAsyncActionGetPlayersBanned_GetPlayersBannedAsync::Key' has a wrong offset!");
static_assert(offsetof(SteamCoreAppsAsyncActionGetPlayersBanned_GetPlayersBannedAsync, AppID) == 0x000018, "Member 'SteamCoreAppsAsyncActionGetPlayersBanned_GetPlayersBannedAsync::AppID' has a wrong offset!");
static_assert(offsetof(SteamCoreAppsAsyncActionGetPlayersBanned_GetPlayersBannedAsync, ReturnValue) == 0x000020, "Member 'SteamCoreAppsAsyncActionGetPlayersBanned_GetPlayersBannedAsync::ReturnValue' has a wrong offset!");

// Function SteamCoreWeb.SteamCoreAppsAsyncActionGetServerList.GetServerListAsync
// 0x0038 (0x0038 - 0x0000)
struct SteamCoreAppsAsyncActionGetServerList_GetServerListAsync final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Filter;                                            // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Limit;                                             // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USteamCoreAppsAsyncActionGetServerList* ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SteamCoreAppsAsyncActionGetServerList_GetServerListAsync) == 0x000008, "Wrong alignment on SteamCoreAppsAsyncActionGetServerList_GetServerListAsync");
static_assert(sizeof(SteamCoreAppsAsyncActionGetServerList_GetServerListAsync) == 0x000038, "Wrong size on SteamCoreAppsAsyncActionGetServerList_GetServerListAsync");
static_assert(offsetof(SteamCoreAppsAsyncActionGetServerList_GetServerListAsync, WorldContextObject) == 0x000000, "Member 'SteamCoreAppsAsyncActionGetServerList_GetServerListAsync::WorldContextObject' has a wrong offset!");
static_assert(offsetof(SteamCoreAppsAsyncActionGetServerList_GetServerListAsync, Key) == 0x000008, "Member 'SteamCoreAppsAsyncActionGetServerList_GetServerListAsync::Key' has a wrong offset!");
static_assert(offsetof(SteamCoreAppsAsyncActionGetServerList_GetServerListAsync, Filter) == 0x000018, "Member 'SteamCoreAppsAsyncActionGetServerList_GetServerListAsync::Filter' has a wrong offset!");
static_assert(offsetof(SteamCoreAppsAsyncActionGetServerList_GetServerListAsync, Limit) == 0x000028, "Member 'SteamCoreAppsAsyncActionGetServerList_GetServerListAsync::Limit' has a wrong offset!");
static_assert(offsetof(SteamCoreAppsAsyncActionGetServerList_GetServerListAsync, ReturnValue) == 0x000030, "Member 'SteamCoreAppsAsyncActionGetServerList_GetServerListAsync::ReturnValue' has a wrong offset!");

// Function SteamCoreWeb.SteamCoreAppsAsyncActionGetServersAtAddress.GetServersAtAddressAsync
// 0x0020 (0x0020 - 0x0000)
struct SteamCoreAppsAsyncActionGetServersAtAddress_GetServersAtAddressAsync final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Addr;                                              // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USteamCoreAppsAsyncActionGetServersAtAddress* ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SteamCoreAppsAsyncActionGetServersAtAddress_GetServersAtAddressAsync) == 0x000008, "Wrong alignment on SteamCoreAppsAsyncActionGetServersAtAddress_GetServersAtAddressAsync");
static_assert(sizeof(SteamCoreAppsAsyncActionGetServersAtAddress_GetServersAtAddressAsync) == 0x000020, "Wrong size on SteamCoreAppsAsyncActionGetServersAtAddress_GetServersAtAddressAsync");
static_assert(offsetof(SteamCoreAppsAsyncActionGetServersAtAddress_GetServersAtAddressAsync, WorldContextObject) == 0x000000, "Member 'SteamCoreAppsAsyncActionGetServersAtAddress_GetServersAtAddressAsync::WorldContextObject' has a wrong offset!");
static_assert(offsetof(SteamCoreAppsAsyncActionGetServersAtAddress_GetServersAtAddressAsync, Addr) == 0x000008, "Member 'SteamCoreAppsAsyncActionGetServersAtAddress_GetServersAtAddressAsync::Addr' has a wrong offset!");
static_assert(offsetof(SteamCoreAppsAsyncActionGetServersAtAddress_GetServersAtAddressAsync, ReturnValue) == 0x000018, "Member 'SteamCoreAppsAsyncActionGetServersAtAddress_GetServersAtAddressAsync::ReturnValue' has a wrong offset!");

// Function SteamCoreWeb.SteamCoreAppsAsyncActionSetAppBuildLive.SetAppBuildLiveAsync
// 0x0048 (0x0048 - 0x0000)
struct SteamCoreAppsAsyncActionSetAppBuildLive_SetAppBuildLiveAsync final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AppID;                                             // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BuildID;                                           // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BetaKey;                                           // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Description;                                       // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USteamCoreAppsAsyncActionSetAppBuildLive* ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SteamCoreAppsAsyncActionSetAppBuildLive_SetAppBuildLiveAsync) == 0x000008, "Wrong alignment on SteamCoreAppsAsyncActionSetAppBuildLive_SetAppBuildLiveAsync");
static_assert(sizeof(SteamCoreAppsAsyncActionSetAppBuildLive_SetAppBuildLiveAsync) == 0x000048, "Wrong size on SteamCoreAppsAsyncActionSetAppBuildLive_SetAppBuildLiveAsync");
static_assert(offsetof(SteamCoreAppsAsyncActionSetAppBuildLive_SetAppBuildLiveAsync, WorldContextObject) == 0x000000, "Member 'SteamCoreAppsAsyncActionSetAppBuildLive_SetAppBuildLiveAsync::WorldContextObject' has a wrong offset!");
static_assert(offsetof(SteamCoreAppsAsyncActionSetAppBuildLive_SetAppBuildLiveAsync, Key) == 0x000008, "Member 'SteamCoreAppsAsyncActionSetAppBuildLive_SetAppBuildLiveAsync::Key' has a wrong offset!");
